[
  {
    "name": "NFTs",
    "url": "http://twitter.com/search?q=NFTs",
    "promoted_content": null,
    "query": "NFTs",
    "tweet_volume": 70366,
    "tweets": [
      "Bang the old system with NUDES #NFTs. 💥 Rewards, governance, $BALZ—this is how we rewrite the rules. https://t.co/RftYHotGxp",
      "Meet the Global DePIN Chain Marketplace: Launching Soon\n\nDePIN Chain Marketplace is where your digital experiences become an asset. \n\n-> AI Cube NFTs: Each cube is a unique representation of your browsing data, secured on the blockchain.\n\n-> Mining with Data: Put your AI Cubes to work. Mine  tokens by contributing your data to the ecosystem.\n\n-> NFT Trading Hub: Buy, sell, or trade your AI Cube NFTs. Each transaction is a step towards controlling and monetizing your personal data.\n\n-> Privacy at All Times: Your data is yours to control. Decide who uses it and get rewarded for your contribution.\n\nDon't just browse the web, own it. Global DePIN Chain Marketplace launching soon.",
      "It’s pay day 💰💰💰💰💰💰💰💰\n\n-Drop your NFTs, I’m collecting on all chains #sol #Tez #Eth #Base https://t.co/tOKjd4KH3i",
      "Our shark NFT floor: ⠀ $13,730\n\nMint price (2022): ⠀⠀ ⠀ ⠀ $315\n\nHolding a 44X while NFTs are \"dead\"\n\nMassive $V airdrop ahead to reward their loyalty 🤝 https://t.co/hBUp4xOqV6",
      "Make NFTs great again @spaace_io 🟠🤑🪂 https://t.co/0lcJCMwztn",
      "Today is a crucial day: in just a few hours, we are launching the FLORK NFTs. All funds raised will go towards the biggest marketing campaign ever seen. We have the most influential KOLs in the crypto world. If you're looking for a x50, now is the time to mint. Don't miss out! https://t.co/uFNFn8dRTz",
      "Gmorning X, \n\nif you say GM https://t.co/M1FRiOCxBG",
      "ApeChain's new Spotlight season is on & it’s all eyes on you (and ME @MagicEden).\n\nThis season, we're sending the intern out with over $250,000 to scoop up NFTs ON APECHAIN from Spotlight's top-ranking communities.\n\nHere’s the deal, for the first time ever, there's gonna be a Community Leaderboard.\n\n• Points you earn from quests won't just boost your rank; they'll boost the community leaderboard position of each NFT you hold.\n• Holding a lot of NFTs? All your communities will benefit.\n• Got a heavy bag from one collection? Boom: the points multiplier is based on holdings + floor price (math).\n\nYes, there are unreal individual rewards too (surprises), but this season is about your squad.\n\nSpread the word, rally the chat, and get ready to sweep the board.\n\nDo you want glory, or are you just collecting grails?\n\nLearn more about the points logic in the new blog below, you'll earn points doing the things you've been doing anyway, so don't worry.\nhttps://t.co/pv99c5Qa3n",
      "Gm Gamers 🧊\n\nAnime Gaming Friday! (2-5 PM EST)\n\nSee you on Abstract! https://t.co/qDFrN0JMKE",
      "🚨 $KAS x $KANGO GIVEAWAY! 🚨\n\n💰 3,000 $KAS (split between 3 winners)\n🎨 1 Exclusive $KANGO NFT\n\n🔥 Here’s how: 🔥\n1️⃣ Follow @KANGO_ON_KAS &amp; @raullpzlpz\n2️⃣ Comment how many $KANGO NFTs you want! 👀\n3️⃣ Like &amp; RT this post 🫡\n\nWhat would you call this kameleon band? https://t.co/W33s69z3LZ"
    ]
  },
  {
    "name": "Drury",
    "url": "http://twitter.com/search?q=Drury",
    "promoted_content": null,
    "query": "Drury",
    "tweet_volume": null,
    "tweets": [
      "“Nate and Cale are texting me and Necas right away..talking to Landy he’s thought of so highly around the league and he lives up to that” \n\nDrury touches on how the guys have been so welcoming and building chemistry ⬇️\n\n#GoAvsGo https://t.co/cPROGcMZZi",
      "@FabrizioRomano The Brazilian league is now officially bigger than the French Ligue https://t.co/k7dM0fPEel",
      "🚨Before Haaland, there was Diego Costa…..\n\nIn 2014/15, he signed for Chelsea and tore the Premier League apart; scoring 20 goals in his debut season &amp; striking fear into every defender.\n\nHere’s a MUST-OPEN thread of all his 20 goals in that iconic season🧵 https://t.co/lOvlcNL98m",
      "chris drury while in the process of making trades  https://t.co/u4C4nqUcIb",
      "Real Madrid vs Manchester City UCL semi-final 2021/22\nIt wasn’t just a tie, it was a movie \n\nThe greatest UCL tie of all time, Peter Drury did justice \n\n https://t.co/VUKPVucDpK",
      "Buck down, MAN DOWN😂 This drag out turned into a drag out FAIL real quick. Who's been there before? https://t.co/bZPfdtxu2q",
      "No Othmann or Schneider involved, Drury masterclass https://t.co/isX3qxgcAz",
      "CHRISTOPHER ELIS DRURY YOU MONSTER HOW COULD YOU TRADE MY SON https://t.co/ar7FDKSemU",
      "New addition ➡️ new addition\n\nHow about this pass from Martin Necas to Jack Drury?! \n\n📺: @ESPNPlus ➡️ https://t.co/S5tPrXCygm https://t.co/aExC4yZGNe",
      "That control and then the strike only Marcus Alonso could. \n\nhttps://t.co/abxzbkJiQ5"
    ]
  },
  {
    "name": "Rangers",
    "url": "http://twitter.com/search?q=Rangers",
    "promoted_content": null,
    "query": "Rangers",
    "tweet_volume": 26719,
    "tweets": [
      "go go power rangers https://t.co/8pzMjJZ9eG",
      "Back where it all began.\n\nA Ranger through + through. https://t.co/PYrkCtBxt5",
      "Canucks: “We’ll give you J.T. Miller but you have to give us something good back, okay?”\n\nRangers: “You can have this bundle of brown bananas.”\n\nCanucks: “But he scored over 100 points last year!”\n\nRangers: “Do you want the bananas or not?”\n\nCanucks: https://t.co/4PdWC8Hbj3",
      "For the work, the smiles + playing with heart since Day 1.\n\nThanks for everything, Filda! https://t.co/8JyyTlOHw1",
      "Once a Ranger, always a Ranger.\n\nThrilled to have you BACK with the Blueshirts, J.T. 👏 https://t.co/SL8jFVIPYC",
      "Thank you, Fil. https://t.co/YRJhVMrsqQ",
      "Happy birthday to the greatest of all time, Nolan Ryan! 🐐 https://t.co/2cVP1ZettG",
      "Thank you for all the memories over the years. \n\nBest of luck in Vancouver, Fil! https://t.co/quCuT6sY85",
      "I photoshopped JT Miller in a Rangers jersey, hope it turned out good https://t.co/W7h00SFSaH",
      "The Penguins acquired the Rangers’ 2025 first-round pick (conditional), forward Danton Heinen, defenseman Vincent Desharnais, and 2024 third-round pick Melvin Fernstrom from the Canucks for defenseman Marcus Pettersson and forward Drew O’Connor.\n\nDetails: https://t.co/96yIZjGSC4 https://t.co/3gBNgTiFLw"
    ]
  },
  {
    "name": "Mancini",
    "url": "http://twitter.com/search?q=Mancini",
    "promoted_content": null,
    "query": "Mancini",
    "tweet_volume": null,
    "tweets": [
      "Hey #Canucks fans: you’re going to absolutely love Victor Mancini. https://t.co/l3eWiYWaCk",
      "I'll be reviewing some Victor Mancini tape over the next bit. #Canucks\n\nFirst impressions: He big. https://t.co/iBZeRxqbDK",
      "Victor Mancini before warmups a few weeks ago. Going to miss him so bad 😪\n#nyr #canucks https://t.co/td61vdH7g4",
      "Here is a look at 22-year-old Victor Mancini’s three goals in the AHL this season.\n\n#Canucks https://t.co/D8LxMRLZz0",
      "thank you victor mancini 🫎🤍 #NYR https://t.co/l4Hqky1aC1",
      "The end of the Mandate. \n\nWe’ll miss you Victor Mancini: https://t.co/hnjcMv6zdj",
      "Mazanec, 3rd, 1st \n\n- Miller for 6ish seasons\n\nChytil, Mancini, 1st\n\nCould’ve been worse. \n\n#Canucks https://t.co/gZPVlypfzA",
      "just remembered chytil and mancini aren’t on my team anymore and everyones shit talking them https://t.co/HLOsnoUavg",
      "Breaking: The Vancouver Canucks have traded J.T. Miller to the New York Rangers in exchange for Filip Chytil, defenseman Victor Mancini and a 2025 first-round draft pick.\n\nDefensemen Erik Brannstrom and Jackson Dorrington were also a part of the package with Miller to New York. https://t.co/HuGzsIs8VL",
      "HMU If you look like Shrek https://t.co/lqpJvmh5jn"
    ]
  },
  {
    "name": "Mika",
    "url": "http://twitter.com/search?q=Mika",
    "promoted_content": null,
    "query": "Mika",
    "tweet_volume": 23164,
    "tweets": [
      "Can i bite him\n\nhttps://t.co/meaSO6hD9n",
      "#YothaGun - take a chance with me ♡˚₊·\n\n#Perfect10LinersEP14 https://t.co/6tbIB7QBmh",
      "ugly crying. sorry taki i swear ill be better next time.\n\nwhen he saw me and realized he was like OooOOOUuuOOOOO!!!!!\n\nthe cutest!!!!!😭😭😭😭😭 then i broke down ey ey sorry i fumbled with the crammed japanese but i hope i got the message across😭 https://t.co/xRfyzsodH3",
      "i wish the world was kinder to you both, https://t.co/pu1ExuK2Tr",
      "Somebody said Juji is Tom Cruise from Korea 😂🤣 \n#JuJiHoon #traumacodeheroesoncall https://t.co/WGvdaG2y6Y",
      "LOOK AT THEM 😭 I'M SO HAPPY, DO Y'ALL GET ME?? 😭\n\nLINE MAN PERTH SANTA\n#LINEMANONLYxPERTHSANTA https://t.co/DTUyuvKhnS",
      "my beloved https://t.co/zTqZ1v5ft4",
      "Art trade. Oc belongs to rainygreyy on insta. I looove this pose https://t.co/nUscHpzaPW",
      "firma Speed FIRMAAAAA https://t.co/zYFqDA8QEa",
      "Get ready to soar with Valkyrie idols Shu Itsuki and Mika Kagehira from Ensemble Stars!! in Huggy Good Smile form! Don’t miss out on bringing these adorable idols into your world. Preorders open now!\n\nShop: https://t.co/Vr2MVhJRBa\n\n#EnsembleStarsMusic #Goodsmile https://t.co/6s4XSwPdSt"
    ]
  },
  {
    "name": "Rob Ray",
    "url": "http://twitter.com/search?q=%22Rob+Ray%22",
    "promoted_content": null,
    "query": "%22Rob+Ray%22",
    "tweet_volume": null,
    "tweets": [
      "Rob Ray laying into a Nordiques fan who ran onto the ice will never get old https://t.co/JIk7HOyqm4",
      "The newest member of the Buffalo Sabres Hall of Fame, Rob Ray. ⚔️\n\nCongratulations, Rayzor!\n\n#LetsGoBuffalo | @Ticketmaster https://t.co/zlxkL4LidJ",
      "\"You'll be honored forever, Rayzor!\"\n\nTie Domi's congratulatory message for Rob Ray ahead of his Sabres Hall of Fame induction 😊\n\nMore messages for Rayzor → https://t.co/8CgiexXNZS | @Ticketmaster https://t.co/jk1Y6oSyTY",
      "One of our favorite Rob Ray sounds ever https://t.co/yT1yPW0EGr",
      "In honor of Rob Ray being inducted into the Buffalo Sabres Hall of Fame tonight, here is a clip from 1999 when he won the King Clancy Memorial Trophy, given to player who best exemplifies leadership qualities on and off the ice and has made a significant humanitarian contribution to his community.\n\nRay’s work with charities like Make a Wish Foundation, Roswell Park Cancer Institute, his work with underprivileged children, the Hardship Fund, which helps former Sabres alumni, who are experiencing financial trouble, is second to none to any pro athlete who has represented the City of Buffalo.\n\nCongrats Rayzor.",
      "Just absolutely nutty work by my coworker Michael putting this together in about 1 day without being asked. \n\nSo much nostalgia with this game and deserves all the love. Incredible fan cam for Rob Ray Night https://t.co/9glYlq8dpJ",
      "Rob Ray used to wear his boxers backwards \"so his noodle wasn't flopping all over the place\" ..... 😂#Sabrehood https://t.co/SMZoIUzJ4O",
      "Happy Rob Ray Day, don’t show Steve Webb. https://t.co/TVgBqWi4Cn",
      "Congratulations to Rob Ray getting inducted into the #Sabres HOF!  I just uploaded 6 straight hours of Rob Ray fights here:  https://t.co/sBeS1DpMgo Here's a preview.  #Sabrehood https://t.co/DRS7chM4Eu",
      "Before Rob Ray is inducted into the Sabres Hall of Fame tonight, Terry Pegula unveiled his name in our hockey hallway.\n\nForever enshrined with the Sabres greats. ⚔️\n\n#LetsGoBuffalo | @Ticketmaster https://t.co/3YpgGtd5eo"
    ]
  },
  {
    "name": "#Sabrehood",
    "url": "http://twitter.com/search?q=%23Sabrehood",
    "promoted_content": null,
    "query": "%23Sabrehood",
    "tweet_volume": null,
    "tweets": [
      "The return of Doug Allen #Sabrehood #Preds https://t.co/XX5pVhmZHg",
      "Congratulations to Rob Ray getting inducted into the #Sabres HOF!  I just uploaded 6 straight hours of Rob Ray fights here:  https://t.co/sBeS1DpMgo Here's a preview.  #Sabrehood https://t.co/DRS7chM4Eu",
      "In Game 4 of the ECF against the #MapleLeafs on May 29, 1999, Rob Ray scored what ended up being the game winner.  Here is that goal courtesy of ESPN SportsCenter.  Full game versions of CBC and ESPN are available at https://t.co/O6pJi31g3D #Sabres #Sabrehood https://t.co/3BxaHZEbH4",
      "Rob Ray used to wear his boxers backwards \"so his noodle wasn't flopping all over the place\" ..... 😂#Sabrehood https://t.co/SMZoIUzJ4O",
      "Rob Ray thanking RJ for his impact on him #Sabrehood https://t.co/8dEt5oMZpY",
      "Rob Ray accepts his sword from Ryan Miller #Sabrehood https://t.co/mS2g5mINC9",
      "Rob Ray loves to hate Matthew Barnaby #Sabrehood https://t.co/6x0LZVsIr3",
      "The greatest goaltender to ever play the game of hockey is turning 60!  @hasek_dominik Happy Birthday!  Thank you for so many memories!  Here are some of Dom's highlights from his Sabres HOF ceremony.  #Sabres #sabrehood https://t.co/AARS5YIlWQ",
      "Here is Rob Ray's first NHL fight!  It was on October 29, 1989.  #Sabres #Sabrehood #Rayzor Full game here:  https://t.co/4UurBJFOxo https://t.co/w63OdoF8cq",
      "Sandra Jeanneret's message for Rob Ray 😢 #Sabrehood https://t.co/eGq0P4OKz2"
    ]
  },
  {
    "name": "#Sabres",
    "url": "http://twitter.com/search?q=%23Sabres",
    "promoted_content": null,
    "query": "%23Sabres",
    "tweet_volume": null,
    "tweets": [
      "Biffalo Sabre to the bone. Tough SOB that always had ur back and was a great teammate. Worked hard to become a very good broadcaster. charity work that most people don't even know about. Sabres HOF well deserved. #Razor #Sabres https://t.co/lQfzqF9elm",
      "A huge ovation for the return of Doug Allen to sing the national anthems. #Sabres https://t.co/9w8ODx5qzO",
      "Congratulations to Rob Ray getting inducted into the #Sabres HOF!  I just uploaded 6 straight hours of Rob Ray fights here:  https://t.co/sBeS1DpMgo Here's a preview.  #Sabrehood https://t.co/DRS7chM4Eu",
      "In Game 4 of the ECF against the #MapleLeafs on May 29, 1999, Rob Ray scored what ended up being the game winner.  Here is that goal courtesy of ESPN SportsCenter.  Full game versions of CBC and ESPN are available at https://t.co/O6pJi31g3D #Sabres #Sabrehood https://t.co/3BxaHZEbH4",
      "Here is Rob Ray's first NHL fight!  It was on October 29, 1989.  #Sabres #Sabrehood #Rayzor Full game here:  https://t.co/4UurBJFOxo https://t.co/w63OdoF8cq",
      "West Seneca native and NHL linesman James Tobias works the #Sabres vs #Predators https://t.co/bDEYexgSne",
      "No words, other than this is one of the dumbest defenseman in the NHL. #Sabres https://t.co/SCxfe8P1UG",
      "A very optional #Sabres morning skate includes the return of Jordan Greenway to the ice. https://t.co/9H6eGurp7j",
      "The man of the night. #Sabres https://t.co/hvdfVCCAzw",
      "Here's Rob Ray's first goal in his first NHL game on October 21, 1989.  Full game at https://t.co/O6pJi31g3D  #Sabres #Sabrehood https://t.co/C6mYs1XLjn"
    ]
  },
  {
    "name": "#RoyalRumble",
    "url": "http://twitter.com/search?q=%23RoyalRumble",
    "promoted_content": null,
    "query": "%23RoyalRumble",
    "tweet_volume": 48944,
    "tweets": [
      "PENTA ASSISTING AN INJURED RETIRED FIREFIGHTER AT HIS MEET AND GREET\n\nONE OF THE MOST WHOLESOME THINGS YOU WILL SEE TODAY ❤️\n\n#RoyalRumble https://t.co/2vEgLEKmvk",
      "I like my odds. #RoyalRumble https://t.co/0gJDni5rPh",
      "The disrespect is unconscionable.\n\nI don’t care if I haven’t won it. When someone says “Royal Rumble”, you think of me. \n\nI should be on every single #royalrumble ad until the end of time. \n\nAnd you still don’t understand why we are the way we are... https://t.co/c5JlCSyzDN",
      "CRAZIEST #RoyalRumble MATCH SAVES \n\n A THREAD 🪡🪡 https://t.co/THUkEMh3zO",
      "ITS OFFICIALLY ROYAL RUMBLE DAY‼️ #RoyalRumble https://t.co/FVUn3pyBof",
      "Never know what’ll happen around #RoyalRumble time… https://t.co/1Tf9MBfDkl",
      "MICHAEL COLE FINALLY GOT THE HANDSHAKE DOWN 😂\n\nLMFAOOOOOOOOO\n\n#RoyalRumble https://t.co/DsUJIStprB",
      "Penta face-to-face with THE GOAT luchador Dominik Mysterio\n#RoyalRumble \nhttps://t.co/jUpURghbuc",
      "CM Punk posts his haul of bracelets (and a Wolfman Larry Talbot figure) from #RoyalRumble Meet &amp; Greets thanking WWE fans and saying they’re the best.\n\n31st January 2025 https://t.co/7JRFMomvuP",
      "CODY SAID IT HIMSELF.\n\nBRING BACK SHEAMUS OLD THEME  #RoyalRumble https://t.co/V0jh45ghwS"
    ]
  },
  {
    "name": "Sabrina",
    "url": "http://twitter.com/search?q=Sabrina",
    "promoted_content": null,
    "query": "Sabrina",
    "tweet_volume": 42566,
    "tweets": [
      "THE FRONT                         THE BACK https://t.co/9NpSZkYgv6",
      "sabrina carpenter's pink heart corset https://t.co/bkhjzrkiHG",
      "Me this Sunday watching Taylor, Sabrina, and Gracie tie their hair up following Olivia into the bathroom https://t.co/BnSLa2VWyl",
      "her hair omg https://t.co/Y0xFPzuf7h",
      "Sabrina Carpenter &amp; Doechii are seated next to each other the Grammys this Sunday. https://t.co/1I90x00JMx",
      "SABRINA DRILLS AN INSANE ONE-FOOT THREE OFF THE GLASS TO END THE 3Q 🤯 https://t.co/9IB134n0P9",
      "Sabrina really spent a weekend in Paris and came back to drop 32 points in unrivaled https://t.co/OSKub0suah",
      "sabrina carpenter as fran fine.. this is everything to me! https://t.co/WHbOGkUY7r",
      "pov: you’re at sabrina carpenter’s concert https://t.co/lGAA6gEN2B",
      "girls just want sabrina carpenter’s hair. https://t.co/vKdH5RnYxI"
    ]
  },
  {
    "name": "Tariffs",
    "url": "http://twitter.com/search?q=Tariffs",
    "promoted_content": null,
    "query": "Tariffs",
    "tweet_volume": 419517,
    "tweets": [
      "Jesus Christ. \n\nDonald Trump says he is going to put tariffs on pharmaceutical drugs. \n\nThis will literally kill people.  \n\n https://t.co/XL4eQafhty",
      "BREAKING: In a stunning moment, the media finally asks Donald Trump how his tariffs fit into his plans to lower costs. Trump responds by saying that these tariffs will increase prices. This is a stunning admission. https://t.co/fZNLetwFkl",
      "BREAKING: Canada is planning to cut off all energy supplies to the U.S as soon as next week in fight back against Trump’s tariffs https://t.co/gkSy8mGv5y",
      "Donald Trump says that \"people will understand\" that prices will go up because of his Trump Tax tariffs to Canada, Mexico, and China. \n\nHe campaigned on lowering the price of food and goods, not raising them. \n\nhttps://t.co/P7tHKtOXNQ",
      "Karina Gould says not to worry about Trump’s 25% tariffs—because “Canadians are smarter than Americans.”\n\nThis literally proves that Karina Gould is partially or fully retarded. \n https://t.co/j0qBdVfxKw",
      "Reporter: “Is there anything China, Canada, and Mexico can do tonight to forestall your implementation of tariffs tomorrow?”\n\nDonald Trump “No. Nothing.”\n\nTrump is the strongest leader the United States has ever had. https://t.co/NgGWuq7eAk",
      "Remember that Donald Trump did not destroy the Canadian economy through tariffs. https://t.co/8Flrsj8Sqc",
      "Brilliant explanation of how Trump tariffs will help American companies. https://t.co/io7ANRv2JV",
      "This is why we are facing 25% tariffs? https://t.co/KhTwzwzKWd",
      "🚨BREAKING: A small plane fell out of the sky in Northeast Philadelphia.\n\nWow, less than 2 weeks in trump's America, egg prices through the roof, tariffs making other prices skyrocket, and planes falling out of the sky.\n\nMAGA: Making America Gross Again\nhttps://t.co/yiLjKYyaAB"
    ]
  },
  {
    "name": "Philadelphia",
    "url": "http://twitter.com/search?q=Philadelphia",
    "promoted_content": null,
    "query": "Philadelphia",
    "tweet_volume": 386916,
    "tweets": []
  },
  {
    "name": "#SmackDown",
    "url": "http://twitter.com/search?q=%23SmackDown",
    "promoted_content": null,
    "query": "%23SmackDown",
    "tweet_volume": 54683,
    "tweets": [
      "It's R-Truth's world and we're all just living in it! 😂\n\n#SmackDown https://t.co/1ibWxB76lb",
      "Fatu said you can get your hair braided all you want, but don't get it twisted \n#SmackDown https://t.co/7mM5iNjOWG",
      "“You can get your hair braided all you want Priest, but don’t get it twisted!”\n\n— Jacob Fatu 🎤\n\n#SmackDown\n\n https://t.co/H0LqT6wyAX",
      "THIS MAN JACOB FATU JUST PUNCHED A STEEL CHAIR AND DIDN’T FEEL A THING \n\nTHIS MAN IS UNREAL 😭\n\n#SmackDown https://t.co/pQvPLhNvbR",
      "Jacob Fatu and Damian Priest is the feud i didn't know i needed until i saw the face to face tonight.  #SmackDown https://t.co/JLyiTa6sgT",
      "#SmackDown  FOLLOW TRAIN \n\n- Follow me (IFB everybody)\n\n- RT and comment a gif of your favorite Smackdown superstar\n \n- Follow back everyone in comments\n\n- Drop a prediction you’ve got for this weeks episode https://t.co/FMkqUmCmwY",
      "I could take a loss all day but MFs will never defeat me!!!! 😈 #SmackDown https://t.co/FqOmD0xPCh",
      "Carmelo Hayes selling in this match #SmackDown https://t.co/Lh97SuRQ5a",
      "Another week, Another Carmelo Hayes loss. Thanks @TripleH for being so predictable and ruining young stars careers with garbage booking . You’re so predictable at this point . Jesus Christ #SmackDown https://t.co/meikpWSBB6",
      "It's really amazing that Kevin Owens never had his WWE theme changed.\n\nIt's a great one.\n\n#SmackDown \n\nhttps://t.co/AraInJMIQk"
    ]
  },
  {
    "name": "Happy Black History Month",
    "url": "http://twitter.com/search?q=%22Happy+Black+History+Month%22",
    "promoted_content": null,
    "query": "%22Happy+Black+History+Month%22",
    "tweet_volume": null,
    "tweets": [
      "HAPPY BLACK HISTORY MONTH!!!!!!!!!!!!!!!!!!!!!!!!!!!! https://t.co/U7xdwHTj2q",
      "Happy Black History Month! https://t.co/i4c6rB1het",
      "IT'S FEBRUARY 1ST! YOU KNOW WHAT THAT MEANS, HAPPY BLACK HISTORY MONTH 🤪✊🏽\n\nhttps://t.co/J3RlDCkrB4",
      "Happy Black History Month! https://t.co/c2v1SF9wkY",
      "Happy Black History Month! ✊🏿 https://t.co/vcuv5Sj6CW",
      "Happy Black History Month to all the black people who didn’t vote for Trump . https://t.co/r1aZ5fEDmU",
      "Happy Black History Month! I honor and give all my love to my ancestors who paved the way before me. I encourage everyone to pause amidst your busy lives and reflect on all they did for us the love, struggles, joy, pain, talents, and everything in between.\n#BlackHistoryMonth https://t.co/HLmsWiajfu",
      "HAPPY BLACK HISTORY MONTH\n\nIF YOU AINT BLACK GET TO THE BACK ✊🏾✊🏾✊🏾 https://t.co/KTPPDmiKpx",
      "Happy black history Month \nPhoto from-@PopBase https://t.co/BHsDnP2vn5",
      "HAPPY BLACK HISTORY MONTH!\n\n(If you voted for that orange bastard then you can go to hell) https://t.co/xAsDUcKKkl"
    ]
  },
  {
    "name": "#DragRace",
    "url": "http://twitter.com/search?q=%23DragRace",
    "promoted_content": null,
    "query": "%23DragRace",
    "tweet_volume": 14687,
    "tweets": [
      "- michelle insulted her mug (HER mug)\n- robbed of a design challenge win\n- back to back bottom placements\n- lost a lipsync\n- upcoming 2nd design challenge\n- pissed as fuck\n\narrietty is about to win these bitches an EMMY #dragrace https://t.co/k4Yi1vRrMC",
      "We haven’t had a queen this charismatic in a long time I fear #DragRace https://t.co/v4WHBrPpEE",
      "onya and suzie got everybody mad LMFAOOOO #DragRace https://t.co/xBveb9q8Hj",
      "THESE GIRLS FINDING OUT YOU CANT WIN THE COMP WITH JUST GOOD RUNWAYS IM LIVING #DragRace https://t.co/Gee2oKUSxB",
      "ARRIETTY POPPING OFF ON EVERYBODY.....,\n\nTHEM QUESTIONING SUZIE'S TOP PLACMENT BECAUSE OF HER LOOK.\n\nAND THEN SUZIE JUST NOT GIVING A FUCK, AND TWIRLING IN HER CLOWN LOOK.\n\nLIKE THIS UNTUCKED MOMENT IS SO HEATED &amp; FUNNY AT THE SAME TIME LMAOOO !!!!! 😂😂😂\n\n#DragRace #rpdr17 https://t.co/wvvaztcBaK",
      "Lydia tore that UPPPP!!! #DragRace https://t.co/bWAwXC8l3T",
      "the producers when they thought of having the right lever be 1 and 7 #DragRace https://t.co/pLMVeWp8Lz",
      "Am I crazy or are all of the “popular girls” so unlikable. The hate for Hormona and Suzie is so forced. Half of this cast is annoying af. #DragRace https://t.co/Fe365VPub5",
      "i don't think i've ever seen RuPaul fall in love with somebody as quickly as she did with Lydia B. Kollins during this lipsync like— RuPaul could not keep her eyes off of her 😮‍💨 LYDIA ATE THIS LIPSYNC UP. #DragRace https://t.co/XtlUJPSG6D",
      "This Lana, Kori, &amp; Arriety friend group gotta be the most delusional mess ever in drag race history #DragRace https://t.co/ryH0HBVLKV"
    ]
  },
  {
    "name": "Curry",
    "url": "http://twitter.com/search?q=Curry",
    "promoted_content": null,
    "query": "Curry",
    "tweet_volume": 23068,
    "tweets": [
      "Steph Curry anytime I take his points over https://t.co/wS514VqdvA",
      "Father time beating Steph Curry ass meanwhile LeBron stomping Father time chest in https://t.co/uefDSaBxzR",
      "Warriors need to make this trade ASAP. https://t.co/arsEDzvGHs",
      "It amazes me that grown a$$ men who sorry a$$ couldn’t make it to the league sit there and talk shit abt a 4 time champ 2 time mvp won a gold medal and a guaranteed HOF if yall put as much time into yo life as you do curry’s maybe you wouldn’t be a complete fcking failure. https://t.co/1pxCJ1U9zs",
      "🇺🇸 Stephen Curry is the 2024 USA Basketball 5-on-5 Male Athlete of the Year 🥇 @StephenCurry30 \n\n🏆 #USABAwards https://t.co/VVea71kYX5",
      "The look when you know Zach Lavine gonna be on your team soon https://t.co/4DSi9dirGw",
      "Steph Curry when i have US currency on him… 😭 https://t.co/3Ypk2gHvTY",
      "Steph Curry is officially cooked bro holy https://t.co/jTtvjXHeXs",
      "Thank you. 🙏🏽 https://t.co/uaIIn2uWkl",
      "\"How bad is Steph Curry\"\n\n https://t.co/Il3tdXDh1L"
    ]
  },
  {
    "name": "Pelicans",
    "url": "http://twitter.com/search?q=Pelicans",
    "promoted_content": null,
    "query": "Pelicans",
    "tweet_volume": null,
    "tweets": [
      "Kristaps Porzingis posted the Celtics team dinner after their win over the Pelicans https://t.co/g0lPdrUHJ9",
      "New Orleans Pelicans guard Dejounte Murray has suffered a season-ending torn Achilles tendon, sources tell ESPN. https://t.co/HlRNXoYPzJ",
      "✨ The Ultimate Tote for Commuters!\nhttps://t.co/RrDfNaQJaS\n\"Traveling is a breeze with this tote! Lightweight, roomy, and fits under the seat effortlessly. So many great colors to choose from! 🌍\"",
      "The Celtics went out for a team dinner in New Orleans after Jayson Tatum’s game winner against the Pelicans\n\n(via Kristaps Porzingis IG) https://t.co/6Jj9BLrs9h",
      "The Celtics assisted on 32/42 FGs in their win against the Pelicans tonight (76.2%). They're now 14-0 this season when they have at least 30 assists. https://t.co/3V5UuJX0Bp",
      "Zion says the Pelicans decided it isn’t ‘smart’ for him to play back-to-backs\n\n“If I can play in the back-to-backs, I would. Physically? Yes, I can. But I work for the Pelicans.\"\n\n(via @PelicansNBA) https://t.co/cefiQ1kuQN",
      "the strongest person you know is a new orleans pelicans fan",
      "🕰️Winter Horizon event ends!🎄🔥This is your last chance for legendary skins!💎Don't wait until the end - click and get in before it's too late!🚀",
      "What stands out from the Celtics 118-116 win over the Pelicans? https://t.co/Bi0beWZxXI",
      "If there’s a guy from the New Orleans Pelicans I want to trade for, it’s not Zion Williamson or Brandon Ingram. \n\nIt’s Trey Murphy III. https://t.co/qfYom7RaDh"
    ]
  },
  {
    "name": "namjoon",
    "url": "http://twitter.com/search?q=namjoon",
    "promoted_content": null,
    "query": "namjoon",
    "tweet_volume": 77155,
    "tweets": [
      "20250201 Namjoon's letter on weverse 🐨💜\n\nbrb sobbing as i post this i've missed him and his beautiful words so much https://t.co/JS86OWTX7e",
      "So proud of RM, Rolling Stone Korea's Domestic Star of the Year!  He deserves all the recognition. 💜\nSoo proud at him.\n\n🖇️ https://t.co/p8J6MDq4ad\n\nSTAR OF THE YEAR RM\nCONGRATULATIONS NAMJOON\nPROUD OF YOU NAMJOON \nCONGRATULATIONS RM\nHISTORY MAKER RM\n#RMstarofyear #RMstarof2024 https://t.co/hNpkxdXe4j",
      "no one speak to me. https://t.co/4hzNBrqO0q",
      "god created men and sent kim namjoon as an apology https://t.co/SJ4ZXk2NxT",
      "Rolling Stone Korea has been named #RM as the “Star of the Year (2024) ”\n\n🥹😌💜\nCONGRATULATIONS RM\nRM STAR OF 2024\nHISTORY MAKER RM\n#RMstarofyear  #RMstarof2024\n#방탄소년단RM #RM #김남준 #Namjoon\nhttps://t.co/WSd6rauPSQ https://t.co/Cp88OYD91D",
      "me acting surprised when namjoon notices our kid is starting to look like hoseok\n https://t.co/WsIwdEURXo",
      "The way Joonie is happy to be a sergeant &amp; equally excited to be a civilian &amp; waiting eagerly for 10th June is just so heartwarming &amp; precious,just 4 months to go 🥹🤧💜\n\nWE LOVE YOU SO MUCH NAMJOON\nWE WILL WAIT FOR YOU NAMJOON \n#RM #김남준 #Namjoon\nhttps://t.co/AxLOIsvwl9 https://t.co/aDnBy9OQgD",
      "Sergeant Kim Namjoon, words that carry both pride &amp; longing. He’s enduring so much, yet pushing forward with strength &amp; dedication. We all know his heart yearns for freedom. Let's cheer!\n\nCONGRATULATIONS SERGEANT NAMJOON\nSO PROUD OF SERGEANT NAMJOON \nWE LOVE YOU SERGEANT NAMJOON https://t.co/XGepgG4tVG",
      "Rolling Stone Korea has named Namjoon as one of the “Star of the Year (2024)\"\n\n\"As the leader of BTS, RM has established a solid musical identity as a solo artist further expanding his territory as a 'musician' rather than just K-pop.\"\n\nCONGRATULATIONS RM\nCONGRATULATIONS NAMJOON\nRM STAR OF 2024\n#RMstarofyear #RMstarof2024",
      "📸 INSTAGRAM\n\nRM story:\nMr. Kim Namjoon\nCongratulations 🎉\nYou have been promoted to Sargeant!\n[Sargeant] https://t.co/hZbD2ooszZ"
    ]
  },
  {
    "name": "Giannis",
    "url": "http://twitter.com/search?q=Giannis",
    "promoted_content": null,
    "query": "Giannis",
    "tweet_volume": 10858,
    "tweets": [
      "WEMBY DRILLS A RIDICULOUS THREE OVER GIANNIS 😳🎯 https://t.co/3CCjlMmz5r",
      "WEMBY WITH BACK-TO-BACK BLOCKS ON GIANNIS 👽 https://t.co/iBN2S2ZoZP",
      "WEMBY AND THE SPURS GET THE BEST OF GIANNIS AND THE BUCKS 👽\n\nWHAT A BATTLE ⚔️ https://t.co/n1tXWZZPf6",
      "I’ve never seen Giannis treated like this with all due respect. \n\nWemby is special  https://t.co/s3hCzsjNC2",
      "WEMBY and GIANNIS went AT IT tonight 😈\n\nWemby: 30 PTS, 14 REB, 6 BLK, 5 3PM\nGiannis: 35 PTS, 14 REB, 6 AST, 56.5 FG%\n\nThe @spurs come away with the win at home! https://t.co/nDPsZd2PvV",
      "Giannis and CP3 chirping at each other, the full incident. This what the game been missing\n\n1st clip: Giannis thinks CP3 tripped him\n2nd clip: CP3 mocks Giannis missing at the line\n3rd clip: Giannis asking CP3 to “Come see him after the game”. CP3 saying “Yeah I’ll do that” \n4th clip: Giannis telling CP3 that he’s right here",
      "Giannis to CP3: \"I'm here\" 😂😂😂 https://t.co/4CoHv2L79P",
      "Giannis &amp; CP3 exchanged words after a foul during the game 👀🍿 https://t.co/MQeegCbwRj",
      "Fully believe Giannis had a flashback to 2020 against LeBron when he hit this on Wemby https://t.co/TKTuYogHHq",
      "reminder of what happened last time ringless chris paul pushed giannis https://t.co/MxmxSM9pCc"
    ]
  },
  {
    "name": "USAID",
    "url": "http://twitter.com/search?q=USAID",
    "promoted_content": null,
    "query": "USAID",
    "tweet_volume": 72035,
    "tweets": [
      "@Andrew__Roth Everyone saying this is illegal hasn't even bothered to look at USAID webpage. https://t.co/gKqxj2js77",
      "In year 2025, does Africa still need USAID?\n\nHow many more years is Africa going to need aid? \n\nAre we doomed to be beggars of the world?",
      "Me waiting for President Trump to abolish the USAID tonight. https://t.co/XfARMmuqsn",
      "Due to @usaidindonesia budget restrictions, the following Solicitations are cancelled effective as of the issuance date of this notice.\n\n@usaidindonesia may re-solicit for these positions in the future. Any interested individuals may apply at that time.\n\n@USAID @usembassyjkt https://t.co/RtACXqZaQG",
      "Me waiting for President Trump to abolish the USAID tonight.\n\nAbolish it! LFG🔥🔥🔥 https://t.co/2K6MZJO9A0",
      "Me just waiting for Trump to abolish the USAID https://t.co/d1rlKCD0z0",
      "Trump's been purging and intimidating USAID employees.\n\nNow there’s a rumor he'll dissolve USAID as an independent agency.\n\nIt was created by JFK and established in law to further our national security and spread hope.\n\nThis'd be illegal and against our national interests.",
      "Abolish USAID and all foreign aid.",
      "We shall still ask the @MinofHealthUG for a plan to step in the gap left by the US President’s suspension of @USAID activity for the 90 days. \n\n#USAIDFundingFreeze https://t.co/YIyFlxsQAq",
      "STEPHEN MILLER: Overwhelmingly, the career federal service in this country is far-left.\n\nTAPPER: I don't know that's true.\n\nMILLER: At USAID, 98% donated to Kamala Harris or other left-wing candidates.\n\nTAPPER: You're demonizing an entire workforce. https://t.co/Hu2CtBLrTW"
    ]
  },
  {
    "name": "Purdue",
    "url": "http://twitter.com/search?q=Purdue",
    "promoted_content": null,
    "query": "Purdue",
    "tweet_volume": null,
    "tweets": [
      "When people ask if I watched the IU Purdue game https://t.co/MxLEWE2G6p",
      "Remembering that Purdue returns 95% of this year's team as well as adding their starting center from the beginning of the year. https://t.co/fUKFLW0k8O",
      "NO. 10 PURDUE WINS A BATTLE OVER INDIANA ⚔️\n\nThe Boilermakers hang on to defeat their rivals in West Lafayette 🚂 https://t.co/tXPcy2S2zA",
      "Ughhh….I’m sick! And I still hate Purdue!",
      "Painted the state Gold &amp; Black tonight.\n\nBOILERS WIN! 🟡⚫️ https://t.co/YoSY2dONTg",
      "This sequence by G. https://t.co/YjR601qW5z",
      "OUR. HOUSE. 🚂⬆️ https://t.co/uvuoFzQad2",
      "Making winning plays. https://t.co/eWAcR7VkQw",
      "Indiana-Purdue always delivers. \n\nIn 49 states. \n\nhttps://t.co/KrJuI8Xgmz",
      "The IU bus has just arrived in West Lafayette 🔥 https://t.co/oxQns3Rjb3"
    ]
  },
  {
    "name": "Suzie",
    "url": "http://twitter.com/search?q=Suzie",
    "promoted_content": null,
    "query": "Suzie",
    "tweet_volume": null,
    "tweets": [
      "Am I crazy or are all of the “popular girls” so unlikable. The hate for Hormona and Suzie is so forced. Half of this cast is annoying af. #DragRace https://t.co/Fe365VPub5",
      "onya and suzie got everybody mad LMFAOOOO #DragRace https://t.co/xBveb9q8Hj",
      "ARRIETTY POPPING OFF ON EVERYBODY.....,\n\nTHEM QUESTIONING SUZIE'S TOP PLACMENT BECAUSE OF HER LOOK.\n\nAND THEN SUZIE JUST NOT GIVING A FUCK, AND TWIRLING IN HER CLOWN LOOK.\n\nLIKE THIS UNTUCKED MOMENT IS SO HEATED &amp; FUNNY AT THE SAME TIME LMAOOO !!!!! 😂😂😂\n\n#DragRace #rpdr17 https://t.co/wvvaztcBaK",
      "@RuPaulsDragRace WHY IS NO ONE GETTING THE REFERENCE SUZIE GIRL U KILLED U SLAYED ILY https://t.co/m2QuTHsVtp",
      "Onya &amp; Suzie are showing that it takes more then an outfit your RENTING from a designer to eat the competition. #DragRace https://t.co/FDuGmu7Vdl",
      "Onya and Suzie laughing at the girls in untucked is FKN hilarious #DragRace https://t.co/jRg8NR1iML",
      "Having the best runways doesn’t matter for the most part, what matters is what you do during the challenge. And Suzie excelled in the challenge #DragRace https://t.co/hPUJMpdBAV",
      "Damn they HATE Suzie and Onya and im living for them not caring #DragRace https://t.co/skafhKFGPJ",
      "Onya and Suzie eating be having the girls UPSETTTTTTTTT 😭😭😭 #DragRace https://t.co/wsBza1rXb0",
      "arietty every time the judges gag over suzie’s makeup: #DragRace https://t.co/WiACqVReG6"
    ]
  },
  {
    "name": "Trey Murphy",
    "url": "http://twitter.com/search?q=%22Trey+Murphy%22",
    "promoted_content": null,
    "query": "%22Trey+Murphy%22",
    "tweet_volume": null,
    "tweets": [
      "Trey Murphy is on that Shai development track.\n\nDon’t hop on that bandwagon next  season cuz we not writing back https://t.co/esaSQ4B3De",
      "Trey Murphy III is absolutely cooking!\n\nDribbles his way through for a fancy and-1... he's up to 32 on 75% shooting 🤯 https://t.co/OG8ppCU2s5",
      "Trey Murphy for absolutely no reason: https://t.co/4NKYgeSpld",
      "Trey Murphy tonight vs the Celtics:\n\n40 points \n5 rebounds \n4 assists\n15-20 FG\n8-12 3PT\n\n🔥 🔥 🔥 \n https://t.co/edDLvZt4qS",
      "Trey Murphy is on my favourite team\n https://t.co/hNjbVgj5XM",
      "IVE SEEN ENOUGH TREY MURPHY IS GONNA BE BETTER THAN THAT BARKING THUG JALEN WILLAMS https://t.co/SSI4v53iCc",
      "Trey Murphy with probably his best half as a pro but it doesn’t even matter, everyone’s mind is on what’s going to happen with Dejounte 💔🙏🏽 https://t.co/fzsWS4XTrc",
      "🏀 FRIDAY'S FINAL SCORES 🏀\n\nJayson Tatum scores 27 and hits the GAME-WINNER with 0.2 seconds left to lift the @celtics over the Pels!\n\nJaylen Brown: 28 PTS, 6 REB, 4 AST\nTrey Murphy III: 40 PTS, 5 REB, 4 AST, 8 3PM https://t.co/43KybUr0Mf",
      "Trey Murphy tonight: \n\n40 points \n8 3PM\n75% FG\n\n(Via @realapp_ ) https://t.co/k4il9XdTxW",
      "Trey Murphy is insane. https://t.co/Quxp3DG0xP"
    ]
  },
  {
    "name": "Woodson",
    "url": "http://twitter.com/search?q=Woodson",
    "promoted_content": null,
    "query": "Woodson",
    "tweet_volume": null,
    "tweets": [
      "EXTEND WOODSON😂😂😂 https://t.co/uJBFwZESng",
      "The Paint Crew applauds when Mike Woodson is introduced as head coach https://t.co/ShwEP8fL4i",
      "WHY IS MIKE WOODSON’S SEAT CUSHION SO BIG THATS WILD 😭 https://t.co/mLQjBoYNT4",
      "Indiana had a timeout left in a one-point game in the final 5 seconds and Mike Woodson let his point guard drive right into a defender for an airball instead.\n\nI understand why Indiana fans don't like him. https://t.co/HMriyHd3jV",
      "Mike Woodson without Trayce Jackson-Davis https://t.co/cevuNoVvQV",
      "Mike Woodson is the worse halftime adjustment coach in college basketball. #IUBB https://t.co/f5fhPXtydD",
      "Mike Woodson, welcome to the Matt Painter penitentiary https://t.co/LwDGaK7xmb",
      "Signing day‼️ https://t.co/JYdUAbgo5Y",
      "Mike Woodson’s end of game play execution is the worst of coaches in power conferences. \n\nBack to back blunders down the stretch against Purdue and Maryland. These are two games you have to look to when he’s fired this offseason. https://t.co/2zVfJfXMwK",
      "Mike Woodson down 3 with 3 seconds left https://t.co/wVs8VseW5S"
    ]
  },
  {
    "name": "WTF IS GOING ON",
    "url": "http://twitter.com/search?q=%22WTF+IS+GOING+ON%22",
    "promoted_content": null,
    "query": "%22WTF+IS+GOING+ON%22",
    "tweet_volume": 31895,
    "tweets": [
      "maga dumbfucks voted for a felon, a traitor, an insurrectionist and an adjudicated rapist supported by a literal nazi and they are like: WTF IS GOING ON? https://t.co/8kNCGuUdZZ",
      "WTF IS GOING ON \n\nIs trending on Twitter.\n\nThe answer is America is experiencing its own downfall because the majority of the white community voted for a monster.\n\nAnd a monster will do what a monster does. https://t.co/vuxCL2eUGV",
      "I’m no pilot but I do know a few choppers….\n\nThis looks like a direct line for the plane to me, how could the helicopter not see the plane…🤔\n\nAnd why were there stories about the crash online hours before it happened? \n\nWTF is going on https://t.co/OdXehDm7C1",
      "WTF IS GOING ON\n\nYou voted for a white man promising dictatorship and hate over a Black woman leading with policies and hope. https://t.co/ZodxG8AXfa",
      "2025 already fucking sucks balls!! 2 planes crashed within a few days. The market is crashing!! People are living in fear !! Racism is thriving!! Wtf is going on? Trump needs to leave ! He needs to be impeached immediately! https://t.co/8uolzi8lxI",
      "Now planes crashing ... WTF IS GOING ON https://t.co/kWTlrp2SJd",
      "Look at the speed and trajectory of this thing! Is that really a #planecrash ?? WTF is going on?!? https://t.co/4hCF1ZRPDA",
      "WTF IS GOING ON https://t.co/MVL3HMn0QE",
      "Ight wtf is going on ?🤔……it’s getting scary !",
      "WTF is going on? Well I voted for her, and you guys voted for chaos. https://t.co/cwSOKzJ2WN"
    ]
  },
  {
    "name": "Petterssons",
    "url": "http://twitter.com/search?q=Petterssons",
    "promoted_content": null,
    "query": "Petterssons",
    "tweet_volume": null,
    "tweets": [
      "The @Canucks are out here getting as many Petterssons as they can 🤭\n\nAnyone else hoping that they all factor in on the same goal at some point? https://t.co/f8xRn0SzEX",
      "@FriedgeHNIC Canucks picking up Petterssons be like https://t.co/vddoSKTTWa",
      "John Shorthouse realizing he could soon be calling a game with three Petterssons all on the same team. #Canucks https://t.co/wU6z1nOHMC",
      "Allvin cornering the market on Petterssons https://t.co/96cbx0FpG1",
      "Every team with two Petterssons:\n— Vancouver Canucks\n\nEvery team with two Millers:\n— New York Rangers\n\nMiller just loves to try to one-up Pettersson... https://t.co/wjDEfNvPK6",
      "Two Elias Petterssons?! \n\nYep. 🐳 https://t.co/B2LsIbbNJT",
      "@BigHeadHcky Every team with three Petterssons:\n— Vancouver Canucks\n\nEvery team with two Millers:\n— New York Rangers\n\nPettersson got the last laugh. https://t.co/e4HYA3bHiS",
      "@FriedgeHNIC Allvin collecting all the petterssons https://t.co/X8Nh128XL3",
      "what watching a canucks game is gonna sound like now that there are three petterssons' on the team https://t.co/tXT7CpFuMQ",
      "Now I’m guessing what you thought I said was, “I’d like a lot of Pettersons.”What I said was, “All the Petterssons you have.” https://t.co/20H1jcAikI"
    ]
  },
  {
    "name": "Canucks",
    "url": "http://twitter.com/search?q=Canucks",
    "promoted_content": null,
    "query": "Canucks",
    "tweet_volume": 24888,
    "tweets": [
      "beware NHL, as the vancouver canucks have obtained all three pieces of the peteyforce https://t.co/TbNgG8CbUi",
      "The @Canucks are out here getting as many Petterssons as they can 🤭\n\nAnyone else hoping that they all factor in on the same goal at some point? https://t.co/f8xRn0SzEX",
      "ANOTHER DEAL 🤝 \n\nThe @Canucks stay busy with their second trade of the night, this time with the @penguins! https://t.co/r0ekF6N7Ih",
      "The Canucks when there’s a Pettersson available\n https://t.co/O7sskUjYU2",
      "Over 400 battles in a #Canucks jersey, a leader on and off the ice — J.T., your passion and impact on this team and city won’t be forgotten. Thank you for everything!\n\nWe wish you all the best in New York City! https://t.co/d7iB4LScB9",
      "Canucks: “We’ll give you J.T. Miller but you have to give us something good back, okay?”\n\nRangers: “You can have this bundle of brown bananas.”\n\nCanucks: “But he scored over 100 points last year!”\n\nRangers: “Do you want the bananas or not?”\n\nCanucks: https://t.co/4PdWC8Hbj3",
      "Vancouver Canucks General Manager Patrik Allvin announced today that the club has acquired defenceman Marcus Pettersson and forward Drew O'Connor from the Pittsburgh Penguins in exchange for forward Danton Heinen, defenceman Vincent Desharnais, the rights to forward Melvin Fernström and a conditional first-round pick in the 2025 NHL Entry Draft (acquired from New York Rangers).",
      "This one hurts. Thank you for everything Millsy. One of my favourite Canucks to watch. Going to be heavily missed\n\n#Canucks https://t.co/EJ4ckJP9Xi",
      "oh this hurts 😖😭 https://t.co/IiObF73kFI",
      "heartbroken 😢💔 #Canucks https://t.co/RbAR8eDLwp"
    ]
  },
  {
    "name": "Heinen",
    "url": "http://twitter.com/search?q=Heinen",
    "promoted_content": null,
    "query": "Heinen",
    "tweet_volume": null,
    "tweets": [
      "Vancouver Canucks General Manager Patrik Allvin announced today that the club has acquired defenceman Marcus Pettersson and forward Drew O'Connor from the Pittsburgh Penguins in exchange for forward Danton Heinen, defenceman Vincent Desharnais, the rights to forward Melvin Fernström and a conditional first-round pick in the 2025 NHL Entry Draft (acquired from New York Rangers).",
      "@NHL @Canucks @penguins Welcome back Danton Heinen 👏 https://t.co/GdAOdtcbX3",
      "@frank_seravalli Just did a jersey swap for Heinen. How’s my photoshop skills? https://t.co/jYOwRcptgX",
      "Forgive any mistakes but I tried photoshopping Danton Heinen into a pens sweater as quick as possible https://t.co/KTTNHQ10sS",
      "No more Danton Heinen no more Vinny Desharnais no more 1st round draft pick that we literally had for only a couple hours https://t.co/LlX7DgABj0",
      "The Penguins acquired the Rangers’ 2025 first-round pick (conditional), forward Danton Heinen, defenseman Vincent Desharnais, and 2024 third-round pick Melvin Fernstrom from the Canucks for defenseman Marcus Pettersson and forward Drew O’Connor.\n\nDetails: https://t.co/96yIZjGSC4 https://t.co/3gBNgTiFLw",
      "#Canucks Danton Heinen snaps a 13-game goalless drought https://t.co/9JwbMpJGVk",
      "I think people are going to realize how good Heinen can actually be in this atrocious bottom 6 we have now.",
      "HEINEN IS GONE https://t.co/4M1LPm13ln",
      "Heinen gone, desharnais gone, 3rd pettersson acquired https://t.co/Hu8td1DWxY"
    ]
  },
  {
    "name": "Learjet",
    "url": "http://twitter.com/search?q=Learjet",
    "promoted_content": null,
    "query": "Learjet",
    "tweet_volume": 59462,
    "tweets": [
      "Not a missile. \nA Learjet 55. \nIt fell straight to the ground few seconds after takeoff. \nAir Ambulance from Mexico. https://t.co/3JYUnWrFli",
      "A pediatric patient receiving treatment for a life-threatening illness in the U.S. was aboard the Learjet 55 that crashed in Philadelphia tonight, Jet Rescue Air Ambulance spokesman Shai Gold said\n\nThe girl, one of six on board, was returning to Tijuana, Mexico, along with her mother, a pilot, copilot, doctor, and paramedic.#philadelphiacrash #Philadelphia #airambulance",
      "🚨 #BREAKING UPDATE: The plane which crashed in Philadelphia appears to be a Learjet 55 Air Ambulance from Mexico\n\nIt seems to have crashed shortly after take off from Philly’s Executive Airport (PNE)\n\nNo word on what caused it to crash into the ground like a missile. https://t.co/8JpeIXptUb",
      "@JustXAshton @nicksortor No.\nIt was a plane.\nSpecifically, it's this plane. A Learjet air ambulance.\nSee the letters on the jet engine?\nXA-UCI\nSee the same lettering on the wreckage?\nI wasn't a missile. https://t.co/SZ42LHo1Fo",
      "MEDIVAC MED SERVICE 056 - MTS56 (Learjet 55 Mexico registered XA-UCI) crashed near the Roosevelt Mall after departing the Northeast Philadelphia Airport - KPNE just after 6pm EST. This is an air ambulance flight and the “MEDIVAC” callsign means they had a patient onboard. The flight was enroute to Springfield, MO 🙏 \n\nAudio via @liveatc and tracking via @flightradar24 & @flightaware",
      "Audio of communications between ATC and the Learjet 55 appears to have captured someone saying, “They are f*cking with the wrong people.”\n\nWhat do you hear in this audio?\n\nThis is insane. https://t.co/WSN8yr0xMv",
      "Dashcam footage of the Jet Rescue Air Ambulance crash in Philadephia tonight.\n\nThe Learjet appears to have impacted the ground at a nearly vertical angle. The last transponder signal, sent seconds before the crash, showed a descent rate of more than 11,000 feet per minute. https://t.co/27hGq2xcny",
      "The Mexican air ambulance that just crashed in Philadelphia had an old instrument panel from the 80's. \n\nThey could have definitely had instrument failure in low level clouds and gotten spacial disorientation. \n\nSource: Jet Rescue video of the Air Ambulance Learjet XA-UCI https://t.co/p9iXlW1CXA",
      "A Learjet 55 Air Ambulance from Mexico crashed in Philadelphia shortly after takeoff. Waiting for Trump to blame Black people, women, Joe Biden, Barack Obama and DEI in 3,2,1... 😳👇 https://t.co/2JviWNdelU",
      "This is the Flight 93 debris site on 9/11. The plane had 6000 gallons of fuel and was traveling at 580 miles per hour downward. It left a crater in the ground but notice green trees and grass around the crater. Now compare this to the Philadelphia Learjet crash is widespread. I realize it’s a more populated area, but even so that fireball was huge. I have questions. 🤔"
    ]
  },
  {
    "name": "Jacob Fatu",
    "url": "http://twitter.com/search?q=%22Jacob+Fatu%22",
    "promoted_content": null,
    "query": "%22Jacob+Fatu%22",
    "tweet_volume": null,
    "tweets": [
      "THIS MAN JACOB FATU JUST PUNCHED A STEEL CHAIR AND DIDN’T FEEL A THING \n\nTHIS MAN IS UNREAL 😭\n\n#SmackDown https://t.co/pQvPLhNvbR",
      "“You can get your hair braided all you want Priest, but don’t get it twisted!”\n\n— Jacob Fatu 🎤\n\n#SmackDown\n\n https://t.co/H0LqT6wyAX",
      "Jacob Fatu said “I’m off the leash now” and cut the best promo of the month 😭😭 Give that man everything he wants and more #SmackDown https://t.co/4LQiD4tzaL",
      "Omg they letting this nigga Jacob Fatu TALK 🥹🥹🥹🥹 #SmackDown https://t.co/jY3bOn4p6v",
      "Jacob Fatu and Damian Priest is the feud i didn't know i needed until i saw the face to face tonight.  #SmackDown https://t.co/JLyiTa6sgT",
      "\"We both from the streets right? So why we even talking?!\" - Damian Priest to Jacob Fatu\n\nAND THEN PRIEST SUPERKICKS TAMA TONGA 😭\n\n#SmackDown https://t.co/t6tiiXidIQ",
      "JACOB FATU IS BRILLIANTLY CRAZY!!! WHAT DO YOU MEAN HE JUST PUNCHED A STEAL CHAIR OUTTA LA KNIGHT'S HAND?! WHEN ITS SWINGING FULL FORCE?!?!?! \n\nWE NEED MORE JACOBBB!!!!\n#SmackDown https://t.co/86paxhlhT0",
      "@WrestleOps If anyone’s taking the mantle from Roman after he’s done, it’s gonna be Jacob fucking Fatu. He’s 100000x better than the rest of the bloodline combined https://t.co/KYGJTwyF5u",
      "Jacob Fatu is BUILT DIFFERENT 😤\n\n#SNME https://t.co/0eRTMO9kFI",
      "“You can get your hair braided, but don’t get it twisted around me.” Jacob Fatu is so fucking good man. https://t.co/OlJS2UMe4h"
    ]
  },
  {
    "name": "Lydia",
    "url": "http://twitter.com/search?q=Lydia",
    "promoted_content": null,
    "query": "Lydia",
    "tweet_volume": 11466,
    "tweets": [
      "Lydia tore that UPPPP!!! #DragRace https://t.co/bWAwXC8l3T",
      "i don't think i've ever seen RuPaul fall in love with somebody as quickly as she did with Lydia B. Kollins during this lipsync like— RuPaul could not keep her eyes off of her 😮‍💨 LYDIA ATE THIS LIPSYNC UP. #DragRace https://t.co/XtlUJPSG6D",
      "Lydia serving us the best lipsync of the season so far #DragRace https://t.co/RJCPCO17Ta",
      "I did not know Lydia got tf down like that, she ate that lipsync up no shade #DragRace \n https://t.co/HKuox3OxhV",
      "LYDIA’S RUNWAY LMFAOOOOO #DragRace https://t.co/k5gZZcnmwY",
      "The dunk tank is finally gone, Arrietty got to stay, Suzie Toot win, and we got to watch Lydia eat up that lipsync. I won tonight idk #DragRace https://t.co/dkvdkzRuCL",
      "Ion know why they looked so shocked… Lydia literally ate her up in that lip sync bffr 😭🤷🏾‍♂️🤏🏾 #rupaulsdragrace #DragRace https://t.co/rHWS22n6L0",
      "I HATED seeing Arrietty in the bottom. but I wanna give Lydia her flowers. That was good performance. #RupaulsDragRace #DragRace #Untucked https://t.co/HYGOKtrKFA",
      "ARRIETTY VS LYDIA\n\nWHO DO YOU TINK WON THIS LIPSYNC ?\n\n#DragRace #rpdr17 https://t.co/MyEM4v16iK",
      "The way Lydia TORE that lip sync up I couldn’t keep my eyes off her the whole time and neither could  rupaul yeah yall can kiss her butthole  #DragRace https://t.co/pCwQv87rOf"
    ]
  },
  {
    "name": "Kevin Durant",
    "url": "http://twitter.com/search?q=%22Kevin+Durant%22",
    "promoted_content": null,
    "query": "%22Kevin+Durant%22",
    "tweet_volume": null,
    "tweets": [
      "Kevin Durant when you put American dollar on his parlay https://t.co/IojqIWll5P",
      "Kevin Durant tonight splitting everyone’s money with his cronies at FanDuel https://t.co/QrYDBSG9DJ",
      "Kevin Durant to Devin Booker literally every game: https://t.co/dWyYb9r9je",
      "Investigate Kevin Durant for gambling immediately!",
      "Kevin Durant with 9 points first quarter sitting the whole 2nd quarter for 8 mins is why people say sports betting is rigged. This man was wrll on his way to hitting his points line. Always some bullshit.",
      "Being serious tho I think it’s strange that Kevin Durant stopped scoring after the first… something is up tbh",
      "It is so blatant that Kevin Durant was paid off tonight dude has sat in the corner not engaged on offense the entire night",
      "So Devin booker can stat pad but Kevin Durant can’t? You can’t tell me this shit ain’t rigged they literally put it in our faces 😂🤣",
      "WHY IN THE ENTIRE FLYING FUCK DOES DEVIN BOOKER GET HALF THE 4TH BUT KEVIN DURANT CANT GET ONE SECOND. HOW IN THE UNREALISTC FUCK DOES THAT MAKE ANY SENSE!,!?!?!????",
      "Kevin Durant aint make a shot since the first qtr cant tell me this shit not rigged 😂"
    ]
  },
  {
    "name": "Allahu Akbar",
    "url": "http://twitter.com/search?q=%22Allahu+Akbar%22",
    "promoted_content": null,
    "query": "%22Allahu+Akbar%22",
    "tweet_volume": 15740,
    "tweets": [
      "\"How to tell America is in trouble\" lesson #138:\n\nWhen something falls out of the sky in Philadelphia, PA the immediate response of a pedestrian on the ground is  'Allahu Akbar! Allahu Akbar! https://t.co/KgGhPoHa4U",
      "When the guy recording a plane crash first reaction is to yell Allahu Akbar https://t.co/NLgU9ZJFiK",
      "A small plane crashed in Philadelphia tonight, and people are reacting intensely to a man who recorded the tragic accident while distraughtly shouting, “Allahu Akbar.” \n\nIn this context, “Allahu Akbar” is a plea for God’s mercy, meaning “God is the greatest.”\n\nIt’s ironic how white people fear everything except their own ignorance.",
      "“If you see an airplane crash into the ground like a fiery meteor and the first thing you say is “Allahu Akbar”, you’re not an American”… https://t.co/HwWQRhaZbh",
      "WHY IS THIS MAN YELLING ALLAHU AKBAR WHILE THE PLANE CRASH IN PHILLY IS GOING ON?\n\nYOU ONLY YELL THAT FOR ONE REASON! https://t.co/Yq4m58rKK9",
      "How does a Philadelphia Plane Crash witness records the exact place and moment of the explosion and  yells\n\n“Allahu Akbar!… What the hell... Omg... It’s a plane bro\"\n\n🤔 https://t.co/q1DhioGfEE",
      "So the plane crashes into the ground and the kid immediately goes with “Allahu Akbar”… https://t.co/WvuuIjIhhB",
      "At the Philadelphia Plane Crash, a man records the explosion and  yells\n\n“Allahu Akbar!… What the hell... Omg... It’s a plane bro\"\n\nIf you yell this when people die I am sure you do not know God. \n#planecrash #philadelphiacrash https://t.co/lguMewUWRI",
      "Some people aren’t even worried about the Philadelphia plane crash—they’re more concerned about the guy who said “Allahu Akbar” (God is Great). Why do people hate God? 😭 https://t.co/8XuXRNUZC6",
      "Allahu Akbar means God is great, so MAGA calm down https://t.co/a3C3YvfRqD"
    ]
  },
  {
    "name": "Dejounte Murray",
    "url": "http://twitter.com/search?q=%22Dejounte+Murray%22",
    "promoted_content": null,
    "query": "%22Dejounte+Murray%22",
    "tweet_volume": null,
    "tweets": [
      "New Orleans Pelicans guard Dejounte Murray has suffered a season-ending torn Achilles tendon, sources tell ESPN. https://t.co/HlRNXoYPzJ",
      "Dejounte Murray was helped to the locker room after suffering an apparent non-contact injury on this play 🙏 https://t.co/4HVeiNwduI",
      "🚨 Dejounte Murray tore his achilles and is out for reminder of season\n\nPrayers up 🙏  https://t.co/8aL3glqlp3",
      "Dejounte Murray just showed love to Jalen Johnson after his season ending injury a couple days ago, then tonite Dejounte Tears his Achilles. This world is crazy man. I wish both of my guys speedy and successful recovery’s 😢 https://t.co/UfNa26A1d7",
      "BREAKING: Pelicans G Dejounte Murray suffered a torn achilles and will miss the rest of the season, per @ChrisBHaynes https://t.co/EuHUUhLv0m",
      "His career actually might be over man \nPrayers for Dejounte Murray ❤️🙏🏽https://t.co/0oEx5DIhxK",
      "Prayers up to Dejounte Murray who went down with an injury. 🙏🙏\n\n https://t.co/qYzK9L019B",
      "let’s see dejounte murray’s games played over the last 5 years! surely he won’t have a season ending injury! https://t.co/ysqNFEjgq4",
      "Dejounte Murray who is attempting 7 threes per game was out in the first quarter after an injury SMH \n\nIt’s always something lmao https://t.co/zhHvi52fEo",
      "Dejounte Murray just went down with an apparent Achilles injury…\n\nPrayers 🙏 https://t.co/o1h0gfCDwS"
    ]
  },
  {
    "name": "Tucker",
    "url": "http://twitter.com/search?q=Tucker",
    "promoted_content": null,
    "query": "Tucker",
    "tweet_volume": 56423,
    "tweets": [
      "If Latinos are such hard workers why don’t they build Mexico? https://t.co/FEdA1Hk9aZ",
      "Yes or No? https://t.co/jgkIw44xHX",
      "NEW:\n\nTucker Carlson put himself on the side of the Palestinians\n\nHe slams Ben Shapiro for cheering on the “evil” and “intentional” slaughter of Palestinian civilians by Israel.\n\n@AFpost https://t.co/1E4WKufhd3",
      "Me watching Trump absolutely destroy everything Democrats love. https://t.co/e9bsSxi3bW",
      "QUESTION: Do you think Adam Schiff is guilty of treason for pushing the phony Russian Collusion hoax and lying to to the American people?\n\nYES or NO? https://t.co/h2ZMLit61w",
      "🚨JUST IN: Elon Musk is advocating for the complete removal of all Electronic Voting Machines! in All 50 States.\n\nDo You Support Elon Musk?\n\nYES or NO? https://t.co/vTmQEnNNu9",
      "🚨Give your Honest Opinion: Would you support President Trump prosecuting Nancy Pelosi and the rest of the J6 Committee? \n\nA. YES \nB. NO https://t.co/LNtT5NmYwj",
      "Deshaun Watson and Justin Tucker when they walk into a massage spa https://t.co/wbmUoiT5Td",
      "🚨I want from you to be Honest for this Question:\n\nDo you agree with Tulsi Gabbard that there are Only TWO genders?\n\nA. YES\nB.  NO https://t.co/NxWmoY60Ku",
      "Ukraine is not a sovereign democratic country. https://t.co/wfv02s9aa0"
    ]
  },
  {
    "name": "Chris Paul",
    "url": "http://twitter.com/search?q=%22Chris+Paul%22",
    "promoted_content": null,
    "query": "%22Chris+Paul%22",
    "tweet_volume": null,
    "tweets": [
      "Fuck Chris Paul https://t.co/lZs6XuwT4M",
      "reminder of what happened last time ringless chris paul pushed giannis https://t.co/MxmxSM9pCc",
      "Chris Paul must not have heard who the Bucks have as an assistant coach https://t.co/fnmsl4bMQW",
      "Chris Paul mocking Giannis after he missed a FT 😂 https://t.co/cJM0dg1zjP",
      "Hey Chris Paul https://t.co/EMhtNHcGQz",
      "Giannis would drop kick tf out of Chris Paul, sit down pusc we took your only chance of getting a ring 🤣🤣 https://t.co/LfiqsIl5KJ",
      "Giannis getting mad for no reason at Chris Paul while he tripped over him. Crying the whole time. \n\nPointing at CP3 the whole time. Sochan steps in front. https://t.co/bVAMv8dYjs",
      "Chris Paul still a bitch in 2025. Stay ringless",
      "Chris Paul mocking Giannis after he missed the free throw 😭😭 https://t.co/zI82MCOkCr",
      "The year is 2015. Chris Paul is on the Clippers &amp; Kawhi Leonard is on the Spurs. \n\nThe year is 2025. Chris Paul is on the Spurs &amp; Kawhi Leonard is on the Clippers. \n\nThese two legends swapping teams 10 years later. \n\nWho would’ve thought? 💭 https://t.co/aWJKXpkwCM"
    ]
  },
  {
    "name": "Achilles",
    "url": "http://twitter.com/search?q=Achilles",
    "promoted_content": null,
    "query": "Achilles",
    "tweet_volume": null,
    "tweets": [
      "New Orleans Pelicans guard Dejounte Murray has suffered a season-ending torn Achilles tendon, sources tell ESPN. https://t.co/HlRNXoYPzJ",
      "🚨 Dejounte Murray tore his achilles and is out for reminder of season\n\nPrayers up 🙏  https://t.co/8aL3glqlp3",
      "Happy Birthday to Gustavo Borges (09)\n🇺🇸🇧🇷🇮🇹 who is heading to Germany this month to join Eintracht Frankfurt. A product of Achilles FC, He’s only been in ID camps with the US, how he hasn’t been invited to a camp with this ability is insanity to me. Good luck in Germany Gustavo! https://t.co/i1ND5F2rVA",
      "John Wall never the same after the torn Achilles 😢 https://t.co/LuHAAlcAO4",
      "Help me out. My brother is convinced this is AI. Looks real to me. Thoughts? https://t.co/fKHnqqhRtB",
      "BREAKING: Pelicans G Dejounte Murray suffered a torn achilles and will miss the rest of the season, per @ChrisBHaynes https://t.co/EuHUUhLv0m",
      "Dejounte Murray just showed love to Jalen Johnson after his season ending injury a couple days ago, then tonite Dejounte Tears his Achilles. This world is crazy man. I wish both of my guys speedy and successful recovery’s 😢 https://t.co/UfNa26A1d7",
      "All these legends have one thing in common. Can you guess 👀? https://t.co/7Oz8IgQEBb",
      "It had just taken off?\n\nOne more flight go down this week, I may never get on a plane again. https://t.co/H6wul6Z0AB",
      "🇮🇪🧤 Goalkeeper Gavin Bazunu (22) recently suffered an achilles tendon rupture and was out for 250+ days... \n\nHe's slowly building his fitness back and made these 2 top saves for Southampton's youth team! 👏 \n\nhttps://t.co/IP8k1lypWw"
    ]
  },
  {
    "name": "Tijuana",
    "url": "http://twitter.com/search?q=Tijuana",
    "promoted_content": null,
    "query": "Tijuana",
    "tweet_volume": null,
    "tweets": [
      "A pediatric patient receiving treatment for a life-threatening illness in the U.S. was aboard the Learjet 55 that crashed in Philadelphia tonight, Jet Rescue Air Ambulance spokesman Shai Gold said\n\nThe girl, one of six on board, was returning to Tijuana, Mexico, along with her mother, a pilot, copilot, doctor, and paramedic.#philadelphiacrash #Philadelphia #airambulance",
      "@Breaking911 Plane was of MX registry and returning the patient to Tijuana via Springfield, probably for fuel. https://t.co/oU3wKjR7Fk",
      "🎒🌟 Travel Is Easy Now!\nhttps://t.co/JLnEOUPAg4",
      "🚨NEW: The flight that crashed in Philly was an “angel flight” enroute to Mexico. A girl who had been receiving lifesaving medical care in the NE was returning back to Mexico with her parent. All the occupants of the plane were Mexican &amp; heading to Tijuana.https://t.co/caZDWiBr8V",
      "BREAKING: The Philadelphia plane crash victims include a young Mexican girl who had just received treatment for a life-threatening illness, and was returning to Tijuana with her mother.\n\nA pilot, copilot, doctor and paramedic were also on board.\n\n💔 https://t.co/e5WLCVecxS",
      "🚨 On Jan 31, 2025, a Learjet 55 air ambulance operated by Jet Rescue Air Ambulance crashed after takeoff from Northeast Philadelphia Airport, claiming six lives, including a pediatric patient and their mother.\n\n🔹 Flight path: En route to Tijuana, Mexico, with a stop in Missouri.\n🔹 Crash impact: Explosion ignited homes & vehicles, injuring six residents.\n🔹 Investigation underway: NTSB & FAA probing the cause.\n\nThis comes just two days after a midair collision in D.C. that k!lled 67 people. A devastating week for aviation. 💔",
      "@LauraLoomer It's next destination is listed as Tijuana. It looks like it does a lot of international travel. https://t.co/q8r96IjHYn",
      "🔥Legendary drop awaits, but not forever!⏳Last hours of the Winter Horizon event!😎Click and get in before it's all gone!💰",
      "The child who was on board had received treatment at Shriners Children’s Philadelphia for a life-threatening condition. \n\nShe was on her way back to Tijuana Mexico",
      "The pediatric passenger was a little girl from Tijuana Mexico, per Fox News. https://t.co/js1WPFEusV"
    ]
  },
  {
    "name": "Jayson Tatum",
    "url": "http://twitter.com/search?q=%22Jayson+Tatum%22",
    "promoted_content": null,
    "query": "%22Jayson+Tatum%22",
    "tweet_volume": null,
    "tweets": [
      "JAYSON TATUM FOR THE WIN 🚨\n\nNAILS THE FADING MIDDY WITH 0.2 SECONDS LEFT!\n\nCLUTCH. BUCKET. GETTER. 😤 https://t.co/nyeGcCLJZ6",
      "“Jayson Tatum isn’t clutch” https://t.co/INGy8bZuOk",
      "The Al Horford-Jayson Tatum chest bump after a game winner will never get old https://t.co/gVmQTsxNNI",
      "Jayson Tatum has made the most go-ahead shots in the final five seconds of a game since 2020. https://t.co/on4P3jwIlR",
      "JAYSON TATUM CALLED GAME 🚨 https://t.co/736Ma6cOS2",
      "“Jayson Tatum isn’t clutch” 😂 https://t.co/mwPg68uOu3",
      "“jAySoN tAtUm nOt ClUtCh” 🥴 https://t.co/pMBk1uCcN0",
      "JAYSON TATUM FOR THE GAME 🔥🔥🔥 https://t.co/OGuuCPqByk",
      "Throwback to Jayson Tatum and Jaylen Brown trading buckets at the All-Star Game https://t.co/GQ07v4mm17",
      "Jayson Christopher Tatum https://t.co/hZRmSL92ic"
    ]
  },
  {
    "name": "HuffPost",
    "url": "http://twitter.com/search?q=HuffPost",
    "promoted_content": null,
    "query": "HuffPost",
    "tweet_volume": 16786,
    "tweets": [
      "BREAKING: The New York Times, NBC News, NPR and Politico have been KICKED OUT of their offices in the Pentagon and replaced by The New York Post, OANN, Breitbart and HuffPost.\n\nEvery day is like Christmas Day with President Trump 2.0! 🔥 https://t.co/YmaSIfE6D0",
      "The Pentagon has announced plans to “rotate” out The New York Times, NBC News, NPR, and Politico from their offices at the Pentagon.\n\nIn their place, Breitbart, OANN, the New York Post, and HuffPost will take over.\n\nAnother classic authoritarian move to replace independent outlets with friendly “media” that will only praise the regime.",
      "BREAKING: Secretary of Defense Pete Hegseth just kicked The New York Times, NBC, NPR, and Politico out of their Pentagon press offices to give space to the New York Post, Breitbart, OANN, and HuffPost.\n\nHegseth must be attempting to set the world record for the most transformational changes made in a single month.\n\nWOW!",
      "The Pentagon has informed its resident press corps that NBC, NYT, NPR, and Politico will “rotate out of the building” to give space to New York Post, Breitbart, OANN, and HuffPost. \n\nNBC, who has an entire booth w/ cameras etc. https://t.co/OC4H3xyGdj",
      "Piercing has come a long way from the days of plastic mall studs and piercing guns. So, how did it evolve to in-demand piercers and jewelry that seems more art than accessory? https://t.co/nGgIxPHLi2",
      "Now leading HuffPost:\n\nhttps://t.co/IILwOYv57T https://t.co/IeFTlmHr6O",
      "Trump is the gift that keeps on giving! \n\nThe New York Times, NBC News, NPR and Politico have been KICKED OUT of their offices in the Pentagon &amp; replaced by The New York Post, OANN, Breitbart &amp; HuffPost https://t.co/YQO8VrC03U",
      "Trump’s war on the federal workforce will disproportionately affect workers of color. https://t.co/DbpCsFUvde",
      "“I work construction and am very very hard on wristwatches,” wrote one reviewer. “This watch is worth every penny.” https://t.co/yQcxi3sdzm",
      "These are their words, not ours. https://t.co/FsviNMYQrn"
    ]
  },
  {
    "name": "JT Miller",
    "url": "http://twitter.com/search?q=%22JT+Miller%22",
    "promoted_content": null,
    "query": "%22JT+Miller%22",
    "tweet_volume": null,
    "tweets": [
      "Lifelong #Canucks fan and I gotta say, JT Miller’s departure is about the most rage-inducing decision EVER. #JTMiller https://t.co/jQjICCYHLc",
      "IT’S HAPPENED. \n\nJT Miller watch is over. Who won the trade? https://t.co/zA7TDQIx41",
      "I photoshopped JT Miller in a Rangers jersey, hope it turned out good https://t.co/W7h00SFSaH",
      "welcome to bee york jt miller https://t.co/kw7ijSgZUA",
      "You know who won the JT Miller trade? \nThe rest of the league so we can stop hearing about Miller/Pettersson and hear about other potential trades https://t.co/p5bdbyHsW6",
      "elias pettersson watching jt miller leave:  https://t.co/GvtgeeLHNL",
      "JT Miller was the cancer? Right right. That’s why players like Boeser posted this about him.\n\n#canucks https://t.co/PYQvKjx5MU",
      "May 16th, 2024: JT Miller comes out for the three stars with the crowd chanting his name after putting his team within one win of the conference final \n\nJanuary 31st, 2025: traded\n\nThe book that’ll be written on the demise will be Shakespearean https://t.co/rn1EdISl1u",
      "jt miller, you’ll be missed 💙💚🤍 https://t.co/rUZXZmaJ12",
      "trying to find out the details of the jt miller trade https://t.co/8MiIiPuYPY"
    ]
  },
  {
    "name": "Shriners",
    "url": "http://twitter.com/search?q=Shriners",
    "promoted_content": null,
    "query": "Shriners",
    "tweet_volume": null,
    "tweets": [
      "FOR IMMEDIATE RELEASE\n 01-31-25 \nContact:\nMel Bower mbower@shrinenet.org\n813.233.6836\n \nShriners Children’s is heartbroken to confirm that one of our pediatric patients and the child’s mother were aboard the Jet Rescue Air Ambulance that crashed in Philadelphia this evening. https://t.co/6pSqbjBHhH",
      "My sisters a nurse at Shriners. She cared for this child over the past few months. My heart goes out to her, and all of the Shriners staff as well as the families of all those who lost life in this tragedy tonight.",
      "@I_Am_JohnCullen Shriners https://t.co/KqNjf7RfHe",
      "@RedpillDrifter They burned the Island same day Trumps Tower caught fire. The Temple is a plywood prop - the Real Temples we should be looking at of the monsters are  the  AL MALAIKAH SHRINERS | Los Angeles, California\n\nhttps://t.co/ErrR5mlMXc https://t.co/bDkKhqaxIH",
      "The local channel 10 WCAU NBC is reporting the child had been being treated at the Shriners hospital. Below is part of the debris that people are taking pictures of their locally in Philadelphia. https://t.co/NOhs08Iy6D",
      "@BNODesk It was a fucking ANGEL FLIGHT. A sick girl was being treated by the Shriners Hospital.",
      "@TheInsiderPaper She was my cousins patient at Shriners, only 11 y/o with her mother.",
      "The girl who perished in the Philadelphia air tragedy had been a patient at Shriners Children’s Hospital in Philadelphia, which specializes in orthopedic and spinal cord injuries. The flight plan indicated they were going to stop to refuel in Missouri, then fly on to their final destination of Tijuana, Mexico.",
      "@MarioNawfal SHRINERS CHILDREN'S CONFIRMS PATIENT, MOTHER ABOARD CRASHED AIR AMBULANCE 🙏 FUCKING Unreal Runway 33 DC Plane Crash. Coincidence Fuck No.. https://t.co/ocyqF2BcpE",
      "The child who was on board had received treatment at Shriners Children’s Philadelphia for a life-threatening condition. \n\nShe was on her way back to Tijuana Mexico"
    ]
  },
  {
    "name": "Breitbart",
    "url": "http://twitter.com/search?q=Breitbart",
    "promoted_content": null,
    "query": "Breitbart",
    "tweet_volume": 31832,
    "tweets": [
      "BREAKING: The New York Times, NBC News, NPR and Politico have been KICKED OUT of their offices in the Pentagon and replaced by The New York Post, OANN, Breitbart and HuffPost.\n\nEvery day is like Christmas Day with President Trump 2.0! 🔥 https://t.co/YmaSIfE6D0",
      "The Pentagon has announced plans to “rotate” out The New York Times, NBC News, NPR, and Politico from their offices at the Pentagon.\n\nIn their place, Breitbart, OANN, the New York Post, and HuffPost will take over.\n\nAnother classic authoritarian move to replace independent outlets with friendly “media” that will only praise the regime.",
      "BREAKING: Secretary of Defense Pete Hegseth just kicked The New York Times, NBC, NPR, and Politico out of their Pentagon press offices to give space to the New York Post, Breitbart, OANN, and HuffPost.\n\nHegseth must be attempting to set the world record for the most transformational changes made in a single month.\n\nWOW!",
      "The Pentagon has informed its resident press corps that NBC, NYT, NPR, and Politico will “rotate out of the building” to give space to New York Post, Breitbart, OANN, and HuffPost. \n\nNBC, who has an entire booth w/ cameras etc. https://t.co/OC4H3xyGdj",
      "BREAKING NEWS:\n\nThe Pentagon has informed the press corps that NBC, NYT, NPR, and Politico will “rotate out of the building” to give space to New York Post, Breitbart, and OANN. \n\nThis is awful.",
      "@halbritz BREITBART? NEW YORK POST? https://t.co/CYP7886eEE",
      "Tulsi Gabbard for Director of National Intelligence? \n\nFinally, someone who actually gets it! \n\nShe’s going to bring back trust and integrity to U.S. intelligence. \n\nCan you imagine? \n\nA breath of fresh air instead of the usual swamp nonsense. \n\nGet read… https://t.co/sles9f6Hsu",
      "The Pentagon has announced changes to physical office space arrangements for media outlets who cover the Department of Defense.\n\nThe New York Times, NBC News, NPR, and Politico must VACATE the office space and turn it over to New York Post, OANN, Breitbart, and Huffington Post. https://t.co/a0tsgcpIl3",
      "Why do we even have senators like John Fetterman and governors like Josh Shapiro?  \n\nThey just react to events like plane crashes in Philly instead of actually getting things done.  \n\nBut hey, if they spend more time tweeting about disasters rather than … https://t.co/IGHBGrbA27",
      "POWERFUL: Donald Trump gives a pen to Allyson Phillips, mother of Laken Riley, after he signed the Laken Riley Act\n\n(Roberto Schmidt/AFP via Getty) https://t.co/iDGgsoC6a9"
    ]
  },
  {
    "name": "harry styles",
    "url": "http://twitter.com/search?q=%22harry+styles%22",
    "promoted_content": null,
    "query": "%22harry+styles%22",
    "tweet_volume": 29973,
    "tweets": [
      "harry styles is 31 now 🥹🎂 https://t.co/mRdu3Tat7u",
      "Happy 31st birthday to the talented Harry Styles. https://t.co/cCsPRtQeOB",
      "Happy 31st birthday to Harry Styles! https://t.co/v15xIzFPDu",
      "Happy 31st birthday to the talented and sexy singer Harry Styles. 🎂 https://t.co/heyJmS010R",
      "Happy birthday to the beautiful, talented, record breaking, award winning, genre defying… HARRY STYLES! 🎂🎈 https://t.co/dGZ5X0cQbP",
      "Happy 31st birthday to the talented Harry Styles. https://t.co/BuT7jWxD4Y",
      "Me ready to eat up all the happy birthday posts with new photos of Harry Styles tonight https://t.co/qFgouJNZu2",
      "Happy Birthday Harry Styles, you are the most precious person in the world ❤️‍🩹\n https://t.co/wHHUs6s8gc",
      "me if i see harry styles on a lime bike and not in the studio https://t.co/DzgEkCmSJs",
      "31 years ago today, Anne Twist released “Harry Styles” https://t.co/l7hp2omZQG"
    ]
  },
  {
    "name": "Vancouver",
    "url": "http://twitter.com/search?q=Vancouver",
    "promoted_content": null,
    "query": "Vancouver",
    "tweet_volume": 16639,
    "tweets": [
      "beware NHL, as the vancouver canucks have obtained all three pieces of the peteyforce https://t.co/TbNgG8CbUi",
      "Vancouver Canucks General Manager Patrik Allvin announced today that the club has acquired defenceman Marcus Pettersson and forward Drew O'Connor from the Pittsburgh Penguins in exchange for forward Danton Heinen, defenceman Vincent Desharnais, the rights to forward Melvin Fernström and a conditional first-round pick in the 2025 NHL Entry Draft (acquired from New York Rangers).",
      "🎒 Organize, Pack, and Travel Better with This Bag!\nhttps://t.co/JLnEOUPAg4",
      "How's the weather in your are today? It's raining like cats and dogs in vancouver today https://t.co/06pXidznpP",
      "Pretty nice view from the office again! 🚁 #Vancouver https://t.co/gi0LXaDFJc",
      "Over 400 battles in a #Canucks jersey, a leader on and off the ice — J.T., your passion and impact on this team and city won’t be forgotten. Thank you for everything!\n\nWe wish you all the best in New York City! https://t.co/d7iB4LScB9",
      "Do you think the Vancouver Canucks improved their roster today? https://t.co/cSvnqNgkVB",
      "🕰️Winter Horizon event ends!🎄🔥This is your last chance for legendary skins!💎Don't wait until the end - click and get in before it's too late!🚀",
      "Coldplay frontman Chris Martin to perform at Invictus Games’ opening ceremony https://t.co/AeNzfQoGkF https://t.co/6j7ieqpsWR",
      "B.C. assembles ’war room’ to push back against U.S. tariff threats https://t.co/idCglMne7J https://t.co/vMjwGnipJK"
    ]
  },
  {
    "name": "Dubas",
    "url": "http://twitter.com/search?q=Dubas",
    "promoted_content": null,
    "query": "Dubas",
    "tweet_volume": null,
    "tweets": [
      "Dubas getting a 1st round pick is huge! #LetsGoPens https://t.co/GuARybhg9N",
      "Kyle Dubas you beautiful genius. Absolutely fleeced. Thank you king! https://t.co/4EY5b2Y7K6",
      "did we literally get a top 13 protected first round pick IN THIS YEAR. holy fuck kyle dubas i didn’t think you had it in you https://t.co/toMOLXvviz",
      "Kyle Dubas is COOKING. https://t.co/zmyBW39NXD",
      "Kyle Dubas did what now https://t.co/3fTrtYzwij",
      "KYLE DUBAS YOU BEAUTIFUL MFER. https://t.co/SDdDxLXY1R",
      "Kyle Dubas, you have fixed me https://t.co/Au8hOmnOS0",
      "Best move Dubas has made so far...by a lot! Huge deal for Pittsburgh!",
      "@Sportsnet Damn. It's such a tough decision on who should replace him. I fully trust Armstrong and Dubas to make the best, most unbiased decision. https://t.co/0DLwjEe9VX",
      "@lilgoblin16 @NHL @Canucks @penguins Me when I see a leafs fan continuing the foolish rhetoric that dubas is ass just cause they’re still sour: https://t.co/YLTRwWzSO8"
    ]
  },
  {
    "name": "Myles Rice",
    "url": "http://twitter.com/search?q=%22Myles+Rice%22",
    "promoted_content": null,
    "query": "%22Myles+Rice%22",
    "tweet_volume": null,
    "tweets": [
      "Myles Rice, the hired gun point guard, could have done a skip pass to a wide open Mgbako who played the best game of his college career … decided to go hero-ball and take an awful shot. \n\nAnd people are crying he got fouled?! His decision to take that shot was foul. \n\n👎\n\n #iubb https://t.co/RBxB78ZPTb",
      "Myles Rice with the game on the line https://t.co/FUzOb5sXAe",
      "Here’s the final shot from Myles Rice\n\nA bit of contract there and possibly could’ve been a foul, but no call and Purdue wins\n\nShould this have been a foul? #iubb https://t.co/IrKVSuVTjI",
      "People will blame Woodson rightfully so but holy shit Myles Rice has to be either retarded or a Purdue fan https://t.co/58wvKM01iM",
      "Myles rice with the game on the line https://t.co/beVQMY7TDg",
      "Myles Rice…0 points all game and you think it’s your time to shine for the game winning shot ? Dumbest shit i’ve ever seen #iubb",
      "@IUBarstool Myles Rice in crunch time: https://t.co/cN8DW6oGAy",
      "Myles Rice, then at Washington State, missed the 2022-23 season while undergoing chemo to fight  Hodgkin's lymphoma. \n\n@BTNJourney shares the now cancer-free @IndianaMBB G's story.\n\n#B1GMBBall x @mylesrice02 https://t.co/6WxIpBmklX",
      "Myles Rice. https://t.co/lD1WiPT7ff",
      "It was a foul but that was an insanely selfish take from Myles Rice. Does nothing all game and decides it’s his bad shot to take. Hate it."
    ]
  },
  {
    "name": "Chytil",
    "url": "http://twitter.com/search?q=Chytil",
    "promoted_content": null,
    "query": "Chytil",
    "tweet_volume": null,
    "tweets": [
      "in honor of the best chytil call \n\n https://t.co/4n92AuhIZZ",
      "One last time. Thanks for the years at #NYR, We’ll miss you Filip Chytil:\n\n https://t.co/8amUePxNSf",
      "Filip Chytil and Drew O'Connor are both really fast. #Canucks added some speed up front. https://t.co/VYsCHIguLA",
      "This is what the WOKE LEFT took from you\n\nNEVER FORGIVE\n\nNEVER FORGET \n\n https://t.co/emPCEUQs2h",
      "When Chytil got the Broadway Hat and didn't wanna dance so he gave it to Goody but they still made him dance 😭. The vibes were so high here. Best of luck, Fil. https://t.co/rKXMRDD8GK",
      "Mazanec, 3rd, 1st \n\n- Miller for 6ish seasons\n\nChytil, Mancini, 1st\n\nCould’ve been worse. \n\n#Canucks https://t.co/gZPVlypfzA",
      "moose and chytil gone… i hate the rangers https://t.co/OX5q7S7UvH",
      "just remembered chytil and mancini aren’t on my team anymore and everyones shit talking them https://t.co/HLOsnoUavg",
      "Chytil and Bouchard stare each other down in the playoffs. Who loses?\n\n#Canucks #LetsGoOilers https://t.co/0gaRVW9VVX",
      "Thank You Filip Chytil, we will never forget the “Kid Line Shift” in the 2022 playoffs #NYR https://t.co/VFyIGeUoKT"
    ]
  },
  {
    "name": "the pillows",
    "url": "http://twitter.com/search?q=%22the+pillows%22",
    "promoted_content": null,
    "query": "%22the+pillows%22",
    "tweet_volume": 43325,
    "tweets": [
      "in honor of the pillows disbanding. FLCL is so special to me, i can say with certainty i would not be here if not for this anime https://t.co/jJtjBS5YDB",
      "the pillows disbanded btw\nthey created such an iconic soundtrack to an iconic anime https://t.co/U4gZs9L8lK",
      "the pillows disbanded. Thanks for the memories. https://t.co/E7DWckKDKi",
      "Japanese band 'the pillows' has officially disbanded after 35 years. Details below. https://t.co/gscf119VvH",
      "Ethereum is breaking out 🚀\n\nThe last 2 similar breakouts led to a 40% pump within 8-10 days.\n\nIt seems like the market is finally realizing how undervalued $ETH is.\n\nLet's go ETH; time to hit $4K 🎯 https://t.co/bg9fpR0TQ6",
      "the pillows... disbanded? https://t.co/ZXLrmYYDBW",
      "I meed all Biggy’s pillows to be thrown in the bin #BBMzansi https://t.co/ax6quNAFDy",
      "Ethereum breakout is close.\n\nWe're nearing the final and most explosive phase of this bull cycle. \n\nShould I share my updated portfolio? https://t.co/wn1sMZRKvw",
      "Pillows have suffered in the Big Brother house 🤣 First Sinaye  now Sweet Ash #BBMzansi #BBMzansiumlilo https://t.co/UQSBeN7dXQ",
      "I HAVE TO GO BACK IN TIME.. TO STOP THE PILLOWS FROM DISBANDING!!! https://t.co/NCCbrrHw0z"
    ]
  },
  {
    "name": "Hasan",
    "url": "http://twitter.com/search?q=Hasan",
    "promoted_content": null,
    "query": "Hasan",
    "tweet_volume": 27591,
    "tweets": [
      "Ethan Klein: \"Hasan Is a Radical Socialist Terrorist sympathizer\"\n\nMeanwhile, Hasan in Japan: https://t.co/vLmMWNC4K9",
      "Hasan does this with everyone. You make a video on him and that means you’re a stalker.  https://t.co/P16RCEfq7r",
      "Ethan Klein MOCKS Twitch, alleges Twitch is PLATFORMING TERRORISM for profit and shielding Hasan. https://t.co/fnMQiUBHeO",
      "Ethan Klein's Hasan Piker content nuke summarised by Denims:\n\n\"Hamas Piker groomed me and I was a neurodivergent minor at the ripe age of 40! I was a total fuckin moron when I fell for it a year ago, but now the rest of my brain developed!\" 😭😭😭 https://t.co/a1ArSQr9cD",
      "Hasan reacts to news of the content nuke dropping\n\n“You’re fuc*ing stupid” https://t.co/2GYOVgFdIc",
      "In an attempt to make it look like Hasan Piker is anti-Semitic, Ethan Klein literally DID anti-Semitism in his video. He literally created new anti-Semitic content. Incredible...\n\nAlso, he's not beating the Destiny collaboration allegations. https://t.co/ifoUfRz2PT",
      "Remote jobs are booming in 2025.\n\nHere are 10 websites offering $700 to $1,200 per month working from home. \n\nDon't miss out 👇 https://t.co/dxrrYwQYYX",
      "ethan klein, who as far as I know hasn't been stuck in a parallel dimension the past week and a half, starts his video on hasan insisting that the \"scary thing\" brewing in america is not fascism but actually communism\n\nthe falling off to right wing pipeline claims another https://t.co/WMUSaX0gWk",
      "I spent like 5 years thinking Hasan was some horrible human and decided to watch a stream one day and he dropped like 2 mil to a minority group and then covered like 3 ongoing problematic issuee I just think people hate him cause he calls people idiots when he beefs with them",
      "Ethan Klein's \"content nuke\" expose on Hasan is the dumbest shit i've seen in a LONG time https://t.co/qg1uYASfop"
    ]
  }
]