[
  {
    "category": "political",
    "keyword": "Trump",
    "articles": [
      {
        "title": "Trump-News: „Gazastreifen räumen“ – Trump will Umsiedlung der Palästinenser",
        "link": "https://www.morgenpost.de/politik/article408116356/donald-trump-usa-news-aktuell-blog.html",
        "snippet": "An Bord der Air Force One macht der US-Präsident einen neuen Vorschlag für Frieden im Nahen Osten. Die Trump-News im Blog.",
        "source_url": "Berliner Morgenpost",
        "article_content": {
          "title": "Weil sie gegen Trump ermittelt hatten: FBI-Agenten sollen entlassen werden",
          "content": "Einwilligungen in die Nutzung von Tracking-Technologien\nMit einem Klick auf „Allen zustimmen“ oder „Auswahl zustimmen“ willigen Sie ein, dass wir und die im Datenschutzcenter aufgeführten Drittanbieter zu den dort genannten Zwecken Tracking-Technologien nutzen und dabei (i) auf Informationen, die in Ihrem Endgerät gespeichert sind, zugreifen und/oder Informationen in Ihrem Endgerät speichern (§ 25 Abs. 1 TDDDG) und (ii) aus den erhobenen personenbezogenen Daten individuelle Nutzerprofile gebildet werden, die mit personenbezogenen Daten, die über Ihre Nutzung anderer Webseiten erhoben wurden, zusammengeführt werden (Art. 6 Abs. 1 lit. a) DSGVO).\nWiderruf der Einwilligung\nSie können Ihre Einwilligungen jederzeit über das Datenschutzcenter mit Klick auf „Zustimmung widerrufen“ mit Wirkung für die Zukunft widerrufen.\nBerlin/Washington. Mehrere an Ermittlungen gegen Donald Trump beteiligte FBI-Agenten sollen entlassen werden. Sie sollen bis Montag gehen. US-News im Blog.\nDonald Trump feiert ein beispielloses Comeback als mächtigster Mann der Welt: Der alte und neue US-Präsident unterzeichnet eine Vielzahl an Dekreten – und schraubt damit die Politik seines Vorgängers Joe Biden zurück. Wir berichten über die wichtigsten News aus den USA im Blog.\n10.24 Uhr: Bundesfinanzminister Jörg Kukies (SPD) hat sich für ein neues Freihandelsabkommen mit US-Präsident Donald Trump ausgesprochen. „Wir sollten mit den USA ganz offen über ein Freihandelsabkommen sprechen“, sagte Kukies der „Augsburger Allgemeinen“ vom Samstag. Ein solches Abkommen werde „andere Parameter haben als früher, aber es ist wichtig, ein Angebot zu machen“. Auch Trump könne nicht alle Herausforderungen im Alleingang lösen.\nKukies sieht in der Einfuhr von Öl und Gas aus den USA eine Möglichkeit, um die Beziehung mit Trump auf eine gute Basis zu stellen. „Der neue amerikanische Präsident hat großes Interesse daran gezeigt, mehr Energie nach Europa zu exportieren“, sagte der Vertraute von Bundeskanzler Olaf Scholz (SPD). Deutschland werde weiter Importeur von Energie bleiben. Der Minister plädierte dafür, sich auch für Wasserstoff aus den USA zu öffnen.\n3.04 Uhr: Wegen ihrer Beteiligung an den Ermittlungen gegen den mittlerweile amtierenden US-Präsidenten Donald Trump sollen US-Medienberichten zufolge zahlreiche FBI-Agenten entlassen werden, darunter auch hochrangige Führungskräfte. Die „Washington Post“ berichtete am Freitag unter Berufung auf mit den Plänen vertraute Kreise, dass „Beamte daran arbeiten, potenziell Hunderte (von FBI-Agenten) für eine mögliche Entlassung zu identifizieren“. Laut dem Sender CNN wurden mindestens sechs hochrangige FBI-Führungskräfte angewiesen, „bis Montag in den Ruhestand zu treten, zurückzutreten oder entlassen zu werden“.\nLaut CNN soll zudem bis Freitagabend die „mögliche Entlassung“ Dutzender FBI-Agenten geprüft werden, die an den Ermittlungen gegen Trump-Anhänger beteiligt waren, die am 6. Januar 2021 das US-Kapitol stürmten. NBC News berichtete, dass mehr als 20 Leiter von Außenstellen des FBI von der Entlassungswelle betroffen seien.\nDer gegen Trump eingesetzte Sonderermittler Jack Smith, der in zwei Verfahren auf Bundesebene gegen den Republikaner ermittelt hatte, hatte das Justizministerium bereits im Januar verlassen. Er hatte wegen des Verdachts der Wahlmanipulation und Verschwörung zum Betrug an den Vereinigten Staaten und wegen der Lagerung geheimer Regierungsakten in Trumps Privatanwesen in Florida ermittelt.\nFBI-Chef Christopher Wray trat unmittelbar nach Trumps Wiederwahl zurück. Trump nominierte seinen treuen Gefolgsmann Kash Patel für den Posten. Dieser drohte wie der US-Präsident politischen Widersachern mit Vergeltung.\n5.06 Uhr: Der Senat in Washington hat den von US-Präsident Donald Trump nominierten Milliardär Doug Burgum als Innenminister bestätigt. Die Kongresskammer stimmte am Donnerstag mit klarer Mehrheit für den bisherigen Gouverneur von North Dakota. 79 Senatoren votierten für den 68-Jährigen, 18 gegen ihn. Burgum wird damit Herr über die US-Nationalparks, die für weitere Erdölsuche geöffnet werden könnten.\nZusätzlich zu seinem Ministeramt soll Burgum auch Chef eines neu geschaffenen Nationalen Energierates werden. Er hat den Auftrag, alle Formen der Energieproduktion auszuweiten, um den „sagenhaften Öl- und Gasvorteil“ der USA wiederherzustellen. Dieses Amt muss nicht vom Senat bestätigt werden.\nBurgums Bestätigung als Innenminister erfolgt in einer Zeit, in der Trump die Klimapolitik der USA grundlegend umgestalten will. Kurz nach seinem Amtsantritt hatte Trump per Dekret den Rückzug seines Landes aus dem für den Kampf gegen die Erderwärmung wichtigen Pariser Klimaschutzabkommen angeordnet.\nIm Gegensatz zu Trump, der den menschengemachten Klimawandel leugnet, erkennt Burgum ihn als wissenschaftlich belegte Tatsache an. Während seiner Zeit als Gouverneur von North Dakota hat er ehrgeizige Pläne zur Klimaneutralität vorgelegt.\n23.13 Uhr: US-Außenminister Marco Rubio hat bekräftigt, dass Präsident Donald Trump es mit seinen Plänen für eine Annexion von Grönland ernst meint. „Das ist kein Witz“, sagte Rubio am Donnerstag in einem Interview mit dem Sender SiriusXM Radio. Nach seiner Darstellung will Trump die zum EU-Land Dänemark gehörende riesige Insel allerdings kaufen – und nicht mit militärischer Gewalt zu einem Teil der Vereinigten Staaten machen.\n„Präsident Trump hat dargelegt, was er tun will, und das ist, es zu kaufen“, sagte Rubio über Grönland. Es gehe nicht ein darum, Land zu erwerben. Dass Grönland Teil der USA werde, liege „in unserem nationalen Interesse“ und die Angelegenheit müsse „gelöst werden“.\nRubio begründete dies unter anderem mit seiner Sorge, China könnte mit dem Ziel eines Zugriffs auf die Arktis-Region über staatliche Unternehmen seinen Einfluss in Grönland vergrößern. Dies sei „absolut realistisch“, China sei bereits „am Panamakanal und andernorts“ auf diese Weise vorgegangen. \nLesen Sie dazu unsere Analyse: Erpressung als neue US-Außenpolitik?\nMit Blick auf die Schutzgarantie für Dänemark, welche die USA im Rahmen der gemeinsamen Nato-Mitgliedschaft tragen, sagte Rubio: „Wenn wir bereits dafür verantwortlich sind, das zu tun, dann könnten wir auch gleich mehr Kontrolle darüber haben, was dort passiert.“ \nDänemark hatte vor ein paar Tagen angekündigt, seine Präsenz in der Arktis und im Nordatlantik mit umgerechnet fast zwei Milliarden Euro verstärken zu wollen.\n3.19 Uhr: US-Präsident Donald Trump drängt Hochschulen zu einem entschiedeneren Vorgehen gegen Antisemitismus. Ein von ihm unterzeichneter Erlass fordert sie auf, enger mit Bundesbehörden zu kooperieren und mögliche Verstöße zu melden. In bestimmten Fällen könnten Ermittlungen eingeleitet werden, die im Extremfall zur Ausweisung ausländischer Studierender oder Fakultätsmitglieder führen. Die rechtliche Grundlage dafür bildet ein Passus im US-Einwanderungsrecht, der es ermöglicht, Personen auszuweisen, wenn sie als Bedrohung für die nationale Sicherheit gelten. \nHinter den Kulissen der Politik - meinungsstark, exklusiv, relevant.\nMit meiner Anmeldung zum Newsletter stimme ich der Werbevereinbarung zu.\nDas Dekret verweist explizit auf die Angriffe der Hamas auf Israel am 7. Oktober 2023 sowie auf die danach gestiegene Zahl antisemitischer Vorfälle in den USA, insbesondere an Hochschulen. Kritiker warnen jedoch, dass sie allgemein Teilnehmer propalästinensischer Demonstrationen in den Fokus nimmt, obwohl solche Proteste nicht per se antisemitisch motiviert seien. Es besteht die Sorge, dass die Verordnung nicht nur gegen Antisemitismus gerichtet ist, sondern auch dazu genutzt werden könnte, unliebsame politische Äußerungen – etwa Kritik an der israelischen Regierung – einzuschränken. Bürgerrechtsorganisationen befürchten außerdem eine verstärkte Überwachung ausländischer Studierender und die Einschränkung der Meinungsfreiheit. Es ist deshalb mit juristischem Gegenwind zu rechnen.\nDie Unterzeichnung kann auch als Geste in Richtung des israelischen Ministerpräsidenten Benjamin Netanjahu gelesen werden. Netanjahu hatte angekündigt, in der kommenden Woche den US-Präsidenten zu besuchen.\nDie vorangegangen Nachrichten zu Donald Trump und den USA lesen Sie in diesem Blog.\nfmg/dpa/afp/kna/epd\nAktuelle Nachrichten und Hintergründe aus Politik, Wirtschaft und Sport aus Berlin, Deutschland und der Welt.\n"
        }
      },
      {
        "title": "Trump Index: 6 Companies Linked to Trump’s Cabinet Worth Watching",
        "link": "https://www.theglobeandmail.com/investing/markets/stocks/DJT/pressreleases/30660194/trump-index-6-companies-linked-to-trumps-cabinet-worth-watching/",
        "snippet": "Detailed price information for Trump Media & Technology Group Corp (DJT-Q) from The Globe and Mail including charting and trades.",
        "source_url": "The Globe and Mail",
        "article_content": {
          "title": "Trump Index: 6 Companies Linked to Trump’s Cabinet Worth Watching",
          "content": "\nPresident Donald Trump's cabinet is often referred to as \"The Avengers,\" with each member being accomplished in their field of expertise. Trump’s cabinet has an overwhelming number of successful businessmen and businesswomen who were leaders in the business world prior to entering the government. Many of them are linked to publicly traded companies. If one were to put together a “Trump Index” of companies linked to his cabinet, these six would be constituents worth watching.\nDonald Trump, the 45th and 47th President of the United States, formed the Trump Media & Technology Group (NASDAQ: DJT) from the SPAC reverse merger.\nIt operates the social media platform Truth Social with the intent of enabling free speech. It also has TV streaming platforms, TMTG+ and TMTG News, which have very little information.\nThe company reported Q3 losses of $19.2 million and $673 million in cash and investments with no debt. It earned $1 million in revenue and $4.7 million in interest income.\nThe world’s richest man is no stranger to the spotlight. Elon Musk is the CEO of Tesla Inc. (NASDAQ: TSLA), the largest and most profitable electric vehicle (EV) manufacturer in the United States.\nHe was also a co-founder of digital payments platform PayPal Inc. (NASDAQ: PYPL). Musk also owns Twitter and founded SpaceX and Starlink, a satellite-based high-speed internet provider.\nMusk also co-founded Solar City and Neuralink. Musk was appointed to the newly created Department of Government Efficiency, where he plans to cut up to $2 trillion of government spending.\nFormer CEO and founder of Roivant Sciences Inc. (NASDAQ: ROIV), Vivek Ramaswamy, gained mainstream exposure during his 2024 U.S. Presidential candidacy.\nThe \"Roi\" refers to the return on investment in the company's name. The medical sector biotech was funded partially by the QVT (his former hedge fund), DE Shaw, and many other hedge funds. Roivant acquired patents for undeveloped medicines from larger pharmaceutical companies to bring them to market.\nRamaswamy stepped down as CEO in January 2021 but still retained a 7.17% stake in the company. Ramaswamy also stepped down from DOGE to pursue a run for Ohio Governor in 2026.\nAs a nominee to head the Department of Energy, Chris Wright was the founder and CEO of Denver-based oil and gas company Liberty Energy Inc. (NYSE: LBRT).\nThe company provides hydraulic fracturing (fracking) services to onshore oil and gas production companies.\nWright’s experience in fracking embodies President Trump’s “Drill baby, drill” initiatives.\nLBRT stock is up 11.71% year-to-day (YTD) as of Jan. 24, 2025.\nShift4 Payments Inc. (NYSE: FOUR) is an integrated payments processing solutions company primarily operating in the hospitality industry with over a 30% market share of the nation’s restaurants and hotels using the platform. It was founded by Jared Isaacman, who is President Trump’s nominee to head NASA. Isaacman was a high school dropout who left to join an IT consulting job at a payment processing firm at just 16.\nHe left to start up a rival firm in his basement with a $10,000 check from his grandfather as seed money. The company would eventually grow to become Shift4. Isaacman took up piloting to avoid burnout and set the world record for the fastest time flying around the world in under 62 hours in a Cessna Citation CJ2 in 2009. Isaacman’s net worth rose to $1.8 billion at the time of his nomination.\nAs former co-founder and CEO of sports entertainment leader WWE owned byTKO Group Holdings Inc. (NYSE: TKO), Linda McMahon was chosen by President Trump to run the Department of Education (DOE).\nMcMahon was instrumental in helping the WWE grow into a mainstream phenomenon. She was also the former head of the Small Business Administration (SBA).\nTrump has previously pledged to abolish the DOE during his presidential campaign. McMahon would be instrumental in Trump’s goal of shifting educational oversight back to the states.\nThe article \"Trump Index: 6 Companies Linked to Trump’s Cabinet Worth Watching\" first appeared on MarketBeat.\nAll market data\n(will open in new tab)\n is provided by Barchart Solutions. Copyright © 2025.\nInformation is provided 'as is' and solely for informational purposes, not for trading purposes or advice. For exchange delays and terms of use, please read disclaimer\n(will open in new tab)\n.\n© Copyright 2025 The Globe and Mail Inc. All rights reserved.\nAndrew Saunders, President and CEO"
        }
      }
    ]
  },
  {
    "category": "political",
    "keyword": "Tariffs",
    "articles": [
      {
        "title": "Trump’s Tariff Wars",
        "link": "https://foreignpolicy.com/live/trump-tariff-trade-brad-setser/",
        "snippet": "As the second Trump administration rolls out its priorities, one thing is clear: Tariffs are an underlying foreign-policy principle of the “Trump doctrine.” Negotiating over Colombian deportees? Tariffs. Cutting off fentanyl from China? Tariffs. Pressuring Europe to spend more on defense? Tariffs. Who will be the winners and losers of such a system? Brad Setser will explore this in conversation with FP’s Ravi Agrawal.",
        "source_url": "Foreign Policy",
        "article_content": {
          "title": "Trump’s Tariff Wars",
          "content": "By using this website, you agree to our use of cookies. This use includes personalization of content and ads, and traffic analytics. Review our Privacy Policy for more information.\nThis issue is preventing our website from loading properly. Please review the following troubleshooting tips or contact us at support@foreignpolicy.com.\nBy submitting your email, you agree to the Privacy Policy and Terms of Use and to receive email correspondence from us. You may opt out at any time.\n\n                    Your guide to the most important world stories of the day\n                \n\n                        Essential analysis of the stories shaping geopolitics on the continent\n                    \n\n                        The latest news, analysis, and data from the country each week\n                    \n\n                    Weekly update on what’s driving U.S. national security policy\n                \n\n                    Evening roundup with our editors’ favorite stories of the day\n                \n\n                        One-stop digest of politics, economics, and culture\n                    \n\n                        Weekly update on developments in India and its neighbors\n                    \n\n                    A curated selection of our very best long reads\n                \n\n                                    \n                        FP Live:\n                    \n                                \n                    Trump’s Tariff Wars                \n            \n\n                Print Archive            \n\n                See All            \n\n\n\n\nFollow FP on X\nFollow FP on LinkedIn\nFollow FP on Instagram\nFollow FP on Facebook\n\n\nALREADY AN FP SUBSCRIBER? LOGIN\nOn-demand recordings of FP Live conversations are available to FP subscribers.\nSUBSCRIBE NOW\nAs the second Trump administration rolls out its priorities, one thing is clear: Tariffs are an underlying foreign-policy principle of the “Trump doctrine.” Negotiating over Colombian deportees? Tariffs. Cutting off fentanyl from China? Tariffs. Pressuring Europe to spend more on defense? Tariffs. \nBut for how long can the new White House use tariffs as a foreign-policy cudgel? How will countries respond? Who will be the winners and losers of such a system? Brad Setser is an expert on debt, trade, and capital at the Council on Foreign Relations and unpacked these questions in conversation with FP’s Ravi Agrawal.\nCountries will retaliate as much as they’re willing to hurt themselves—or make a point.\n INSIDER  |  RAVI AGRAWAL\nPREFER TO LISTEN?\nFollow the FP Live podcast for the entire conversation, plus other in-depth discussions, wherever you get your podcasts.\nThe new U.S. president is taking an aggressive economic strategy during his first days in office.\nANALYSIS  |  ALEXANDRA SHARP\nTrump can make his favorite trade tool work—if he picks the right targets.\nARGUMENT  |  AARON L. FRIEDBERG\nA Phase Two negotiation isn’t out of the question. Washington must get it right this time.\nARGUMENT  |  WENDY CUTLER\nASK A QUESTION\n\n\t\t\t\t\tAsk a Question\n\t\t\t\t\nRegistered\n\n\t\t\t\t\t\t\t\t\t\tAsk a Question\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\tAsk a Question\n\t\t\t\t\nOnly FP subscribers can submit questions for FP Live interviews.\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSubscribe\n\t\t\t\t\t\t\n\t\t\t\t\t\nALREADY AN FP SUBSCRIBER? LOGIN\nOnly FP subscribers can submit questions for FP Live interviews.\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSubscribe\n\t\t\t\t\t\t\n\t\t\t\t\t\nALREADY AN FP SUBSCRIBER? LOGIN\nASK A QUESTION\n\n\t\t\t\t\tAsk a Question\n\t\t\t\t\nRegistered\n\n\t\t\t\t\t\t\t\t\t\tAsk a Question\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\tAsk a Question\n\t\t\t\t\nOnly FP subscribers can submit questions for FP Live interviews.\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSubscribe\n\t\t\t\t\t\t\n\t\t\t\t\t\nALREADY AN FP SUBSCRIBER? LOGIN\nOnly FP subscribers can submit questions for FP Live interviews.\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSubscribe\n\t\t\t\t\t\t\n\t\t\t\t\t\nALREADY AN FP SUBSCRIBER? LOGIN\nBe the first to hear about upcoming FP Live interviews with leading foreign-policy experts.\nBy submitting your email, you agree to the Privacy Policy and Terms of Use and to receive email correspondence from us. You may opt out at any time.\n✓ Signed Up\nAs the second Trump administration rolls out its priorities, one thing is clear: Tariffs are an underlying foreign-policy principle of the “Trump doctrine.” Negotiating over Colombian deportees? Tariffs. Cutting off fentanyl from China? Tariffs. Pressuring Europe to spend more on defense? Tariffs. Who will be the winners and losers of such a system? Brad Setser explored this in conversation with FP’s Ravi Agrawal.\n\nWATCH NOW\n\nOnly FP subscribers can submit questions for FP Live interviews.\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSubscribe\n\t\t\t\t\t\t\n\t\t\t\t\t\nALREADY AN FP SUBSCRIBER? LOGIN\nOnly FP subscribers can submit questions for FP Live interviews.\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSubscribe\n\t\t\t\t\t\t\n\t\t\t\t\t\nALREADY AN FP SUBSCRIBER? LOGIN\nWar has spread to the digital world. Cyberattacks can target civilian infrastructure, create new biothreats, and sow disinformation. What tools can private and governmental actors use to defend against these risks? At this year’s World Economic Forum summit, FP’s Ravi Agrawal moderated the session ​​“Defending the Cyber Frontlines,” in discussion with leaders in technology, defense, and humanitarian work.\n\nWATCH NOW\n\nOnly FP subscribers can submit questions for FP Live interviews.\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSubscribe\n\t\t\t\t\t\t\n\t\t\t\t\t\nALREADY AN FP SUBSCRIBER? LOGIN\nOnly FP subscribers can submit questions for FP Live interviews.\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSubscribe\n\t\t\t\t\t\t\n\t\t\t\t\t\nALREADY AN FP SUBSCRIBER? LOGIN\nDonald Trump says he believes he won the 2024 U.S. presidential election because of his stance on immigration. The president-elect has called undocumented workers “savage gangs” who should be subject to “the largest deportation operation in American history.” Columnist Edward Alden joined FP Live to explain what we know of Trump’s plans so far and how likely he is to enact them.\n\nWATCH NOW\n\nOnly FP subscribers can submit questions for FP Live interviews.\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSubscribe\n\t\t\t\t\t\t\n\t\t\t\t\t\nALREADY AN FP SUBSCRIBER? LOGIN\nOnly FP subscribers can submit questions for FP Live interviews.\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSubscribe\n\t\t\t\t\t\t\n\t\t\t\t\t\nALREADY AN FP SUBSCRIBER? LOGIN\nEvery January in Foreign Policy, the International Crisis Group lists 10 conflicts to watch in the year ahead. But beyond Israel’s conflicts with Iran and Hamas, and the wars in Syria and Ukraine, what else should we be keeping an eye on? Join an FP Live conversation with the International Crisis Group’s president and CEO, Comfort Ero.\n\nWATCH NOW\n\nOnly FP subscribers can submit questions for FP Live interviews.\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSubscribe\n\t\t\t\t\t\t\n\t\t\t\t\t\nALREADY AN FP SUBSCRIBER? LOGIN\nOnly FP subscribers can submit questions for FP Live interviews.\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tSubscribe\n\t\t\t\t\t\t\n\t\t\t\t\t\nALREADY AN FP SUBSCRIBER? LOGIN\n\n\t\t\t\t\t\tALREADY AN FP SUBSCRIBER? \n\t\t\t\t\t\tLOGIN\n\t\t\t\t\t\n\n\t\t\t\t\t\tYour email address: \n\t\t\t\t\t\n\n\t\t\t\t\t\tNot You? Log Out\n\t\t\t\t\t\n\n\t\t\t\t\tAll FP Email Preferences\n\t\t\t\t\tSubscribe\n\t\t\t\t\n\n\t\t\t\t\tClose Window\n\t\t\t\t\n\n\t\t Close \n\t\nFollow FP on X\nFollow FP on LinkedIn\nFollow FP on Instagram\nFollow FP on Facebook\nFollow FP on X\nFollow FP on LinkedIn\nFollow FP on Instagram\nFollow FP on Facebook\nForeign Policy Magazine is a division of Graham Holdings Company. All contents (c) 2024, Graham Digital Holding Company. All rights reserved. Foreign Policy, 655 15th St NW, Suite 300, Washington, DC, 20005."
        }
      },
      {
        "title": "USD surging again - Trump tariff threats, Bessent want tariffs too | Forexlive",
        "link": "https://www.forexlive.com/news/usd-surging-again-trump-tariff-threats-bessent-want-tariffs-too-20250127/",
        "snippet": "Bessent wants a gradual rise in tariffs, could go as high as 20%",
        "source_url": "ForexLive",
        "article_content": {
          "title": "USD surging again - Trump tariff threats, Bessent want tariffs too",
          "content": "\n      Subscribe to our Daily Wrap\n    \nPremium\n\n          Join Forexlive News Updates\n        \n\n          Join Forexlive FX & Crypto Chat\n        \n\n          Follow us on Twitter\n        \n\n          Follow Us on Facebook\n        \nTrump continues to promise tariffs:\nEarlier:\nBessent will be the Treasury Secretary. I argued in that post that Trump will do what Trump will do on tariffs, not what Bessent wants to do.\nAnd here we are, Trump not backing down and the dollar roaring higher. EUR, AUD, GBP, CAD, NZD, all slammed.EUR/USD for example:\nTags\nMost Popular\nFollow Us\nRead our Terms, Cookies and Privacy Notice\nHIGH RISK WARNING: Foreign exchange trading carries a high level of risk that may not be suitable for all investors. Leverage creates additional risk and loss exposure. Before you decide to trade foreign exchange, carefully consider your investment objectives, experience level, and risk tolerance. You could lose some or all your initial investment; do not invest money that you cannot afford to lose. Educate yourself on the risks associated with foreign exchange trading and seek advice from an independent financial or tax advisor if you have any questions.\nADVISORY WARNING: FOREXLIVE™ is not an investment advisor, FOREXLIVE™ provides references and links to selected news, blogs and other sources of economic and market information for informational purposes and as an educational service to its clients and prospects and does not endorse the opinions or recommendations of the blogs or other sources of information. Clients and prospects are advised to carefully consider the opinions and analysis offered in the blogs or other information sources in the context of the client or prospect's individual analysis and decision making. None of the blogs or other sources of information is to be considered as constituting a track record. Past performance is no guarantee of future results and FOREXLIVE™ specifically hereby acknowledges clients and prospects to carefully review all claims and representations made by advisors, bloggers, money managers and system vendors before investing any funds or opening an account with any Forex dealer. Any news, opinions, research, data, or other information contained within this website is provided on an \"as-is\" basis as a general market commentary and does not constitute investment or trading advice, and we do not purport to present the entire relevant or available public information with respect to a specific market or security. FOREXLIVE™ expressly disclaims any liability for any lost principal or profits which may arise directly or indirectly from the use of or reliance on such information, or with respect to any of the content presented within its website, nor its editorial choices.\nDISCLAIMER: FOREXLIVE™ may be compensated by the advertisers that appear on the website, based on your interaction with the advertisements or advertisers.\nFinance Magnates CY Limited"
        }
      }
    ]
  },
  {
    "category": "political",
    "keyword": "USAID",
    "articles": [
      {
        "title": "USAID pauses funding programmes for Pakistan",
        "link": "https://www.brecorder.com/news/40345234/usaid-pauses-funding-programmes-for-country",
        "snippet": "ISLAMABAD: The US Agency for International Development (USAID) has paused all funding for programmes in Pakistan…",
        "source_url": "Brecorder",
        "article_content": {
          "title": "USAID pauses funding programmes for Pakistan",
          "content": "ISLAMABAD: The US Agency for International Development (USAID) has paused all funding for programmes in Pakistan following the Trump administration’s decision to halt all foreign aid on January 20, barring that to Egypt and Israel.\n“Thank you for your message concerning President Trump’s executive order on re-evaluating and realigning US foreign aid. We have been asked to refer all media queries on the President’s Executive Orders to the White House”, an email received from US Embassy Islamabad stated.\nAfter US President Donald Trump issued the executive order on “Re-evaluating and Realigning United States Foreign Aid” on January 20, Secretary of State Marco Rubio sent out a memo stopping all foreign aid during a 90-day reassessment period with the exception of Israel and Egypt.\n$77.8m ‘Recharge Pakistan’ project being launched on 10th\nAccording to the US government’s Foreign Assistance website, the disbursements for Pakistan declined from $169.8 million in 2023 to $116.5 million in 2024.\nAccording to the portal, the main sectors for assistance in 2024 were basic health ($21.53 million), disaster prevention and preparedness ($14.01 million), business and other services ($13.34 million), energy ($12.04 million), conflict, peace and security ($11.7 million), government and civil society ($6.608 million), agriculture ($4.823million), emergency response ($3.3 million), other multi-sector ($5.003 million), while operating expenses accounted for $15.6 million.\nDuring his first tenure, on January 2, 2018, US President Donald Trump stated that the United States had foolishly handed Pakistan more than $33 billion over 15 years while getting nothing in return, and pledged to put a stop to it. “They give safe haven to the terrorists we hunt in Afghanistan, with little help. No more!” Trump wrote on Twitter.“\nCopyright Business Recorder, 2025"
        }
      },
      {
        "title": "USAID pauses funding programmes for Pakistan",
        "link": "https://www.brecorder.com/news/40345234/usaid-pauses-funding-programmes-for-pakistan",
        "snippet": "ISLAMABAD: The US Agency for International Development (USAID) has paused all funding for programmes in Pakistan…",
        "source_url": "Brecorder",
        "article_content": {
          "title": "USAID pauses funding programmes for Pakistan",
          "content": "ISLAMABAD: The US Agency for International Development (USAID) has paused all funding for programmes in Pakistan following the Trump administration’s decision to halt all foreign aid on January 20, barring that to Egypt and Israel.\n“Thank you for your message concerning President Trump’s executive order on re-evaluating and realigning US foreign aid. We have been asked to refer all media queries on the President’s Executive Orders to the White House”, an email received from US Embassy Islamabad stated.\nAfter US President Donald Trump issued the executive order on “Re-evaluating and Realigning United States Foreign Aid” on January 20, Secretary of State Marco Rubio sent out a memo stopping all foreign aid during a 90-day reassessment period with the exception of Israel and Egypt.\n$77.8m ‘Recharge Pakistan’ project being launched on 10th\nAccording to the US government’s Foreign Assistance website, the disbursements for Pakistan declined from $169.8 million in 2023 to $116.5 million in 2024.\nAccording to the portal, the main sectors for assistance in 2024 were basic health ($21.53 million), disaster prevention and preparedness ($14.01 million), business and other services ($13.34 million), energy ($12.04 million), conflict, peace and security ($11.7 million), government and civil society ($6.608 million), agriculture ($4.823million), emergency response ($3.3 million), other multi-sector ($5.003 million), while operating expenses accounted for $15.6 million.\nDuring his first tenure, on January 2, 2018, US President Donald Trump stated that the United States had foolishly handed Pakistan more than $33 billion over 15 years while getting nothing in return, and pledged to put a stop to it. “They give safe haven to the terrorists we hunt in Afghanistan, with little help. No more!” Trump wrote on Twitter.“\nCopyright Business Recorder, 2025"
        }
      }
    ]
  },
  {
    "category": "sports",
    "keyword": "Curry",
    "articles": [
      {
        "title": "Steph Curry’s wife Ayesha Curry reacts as Cameron Brink expresses wish to hit the strip club with Curry gang",
        "link": "https://www.sportskeeda.com/us/wnba/news-steph-curry-s-wife-ayesha-curry-reacts-cameron-brink-expresses-wish-hit-strip-club-curry-gang",
        "snippet": "Los Angeles Sparks star Cameron Brink’s highly anticipated podcast is finally out with the first episode of “Straight to Cam” dropping on Tuesday.",
        "source_url": "Sportskeeda",
        "article_content": {
          "title": "Steph Curry's wife Ayesha Curry reacts as Cameron Brink expresses wish to hit the strip club with Curry gang",
          "content": "The first episode of Los Angeles Sparks star Cameron Brink's podcast \"Straight to Cam\" dropped on Tuesday.\nEarly in the first episode, the discussion turned to strip clubs, with Brink confessing that they make her uncomfortable. Co-host Sydel Curry-Lee added that the venues can be intimidating, but after some back and forth, the two friends decided that they needed to give the clubs another chance.\nThe idea seemed enticing to Golden State Warriors guard Steph Curry's wife, Ayesha Curry. After seeing a promotional video for the podcast on Instagram, Ayesha jumped into the comments section with a cartwheel emoji.\nBrink revealed that one of the reasons she is so uncomfortable at the clubs is that she is not sure where to look. She also said that she would be more at ease if there were only women in the club.\nThe Curry and Brink families have longstanding ties that date back to the '80s. Cameron Brink's parents, Michelle and Greg, were star athletes at Virginia Tech where they became close friends with Sonya and Dell Curry, Steph and Sydel's parents.\nMichelle Bain-Brink was roommates with Sonya Curry during their college days. The families have remained in close contact over the years.\nSydel Curry-Lee seemed to be more comfortable with the idea of going to strip clubs and revealed that she last went to one for a friend's birthday in 2022. Her issue stems from the countless rules people have to follow.\nCurry-Lee, the wife of NBA guard Damion Lee, remembered sitting at the club and not knowing what to do while watching the dancers. While she applauded the dancers, she claimed many of her friends threw bills and touched the dancers.\nSydel Curry-Lee is expecting her third child in 2025, and joked with Brink that a trip to a strip club is on the cards soon after that.\nWarriors Nation! You can check out the latest Golden State Warriors Schedule and dive into the Warriors Depth Chart for NBA Season 2024-25.\nQuick Links\n"
        }
      },
      {
        "title": "Yoshinoya teams up with famous curry restaurant to offer the aromatic Beef Roka Curry",
        "link": "https://soranews24.com/2025/01/28/yoshinoya-teams-up-with-famous-curry-restaurant-to-offer-the-aromatic-beef-roka-curry/",
        "snippet": "Even curry skeptics might like this one for its masterful blend of several spices.",
        "source_url": "SoraNews24 -Japan News-",
        "article_content": {
          "title": "SoraNews24 -Japan News-",
          "content": "Bringing you yesterday's news from Japan and Asia, today.\n    \nRocketNews24 Japanese\n\nEven curry skeptics might like this one for its masterful blend of several spices.\n\nJapanese beef bowl chain Yoshinoya recently began offering a limited-time menu item called Beef Roka Curry (牛魯珈カレー) for 729 yen (US$4.68). The dish went on sale at locations nationwide on January 16 and features curry from a popular restaurant in Tokyo’s Okubo neighborhood, Spicy Curry Roka, paired with Yoshinoya’s own famous simmered beef. We’d heard plenty of people praising it since its release, so one recent day we headed to the Yoshinoya branch in front of the famous Shibuya 109 department store to try it for ourselves.\n▼ Ad for Beef Roka Curry on the left\n\n…Which in itself was probably a mistake. Shibuya is a bustling city center, and right at lunchtime, there’s a continuous line of salarymen, young people, and foreign tourists heading into this particular shop. Luckily, our worries turned out to be unfounded because the staff there were masterful at serving the food quickly and clearing up after customers, leading to an incredibly fast seat-turnover rate.\n\nWe decided to spring for a slight variation of the dish called the Niku Daku Beef Roka Curry (839 yen), which contains slightly more meat than the plain Beef Roka Curry. When it was our turn, the curry also arrived promptly and piping hot.\n\nDespite the larger quantity, the amount of beef and onions nestled on top of the bed of rice was still only the same amount as that of a regular-sized gyudon beef bowl at the chain. Some diners might want to order more beef on the side if they’re used to a larger serving.\n\nWe took our first bite and–WHAM!–the curry packed a flavorful punch. It wasn’t just there to add to the looks of the dish but was adding some heavy, tasty lifting.\n\nNo wheat flour was used in the curry as a binding agent, so its flavor is thrust at you full throttle. It also contains an aromatic edge of cardamom, cinnamon, and cloves to balance its pure spiciness. This last point makes it very different from Matsuya’s Gorogoro Nikomi Chicken Curry (“Gorochiki Curry”)–and why even people who tend to shy away from spicy foods should be able to handle it, especially when paired with the rice. Those who want to tone it down even more, though, might consider adding the “quattro cheese” or “omelet egg” as an additional topping to their dish.\n\nAll in all, while the curry was supposed to complement the beef, it actually outshone the meat in our opinion. It’s not that the beef doesn’t go well with it–just that rather than enhancing the beef’s flavor, the curry actually buries it instead.\n\nYoshinoya currently plans to offer the Beef Roka Curry through the end of April, so interested diners still have plenty of time to try it for themselves. If you end up going to the same Shibuya 109 location that we did, you might also want to check out the cutest onigiri Tokyo has offer which is only a short walk away–perhaps once its opening crowds die down a bit more.\nAll images © SoraNews24\n● Want to hear about SoraNews24’s latest articles as soon as they’re published? Follow us on Facebook and Twitter!\n[ Read in Japanese ]\n\nFollow SoraNews24\n© SoraNews24 -Japan News- / SOCIO CORPORATION\n"
        }
      }
    ]
  },
  {
    "category": "sports",
    "keyword": "Giannis",
    "articles": [
      {
        "title": "The Old Byre Home / Gianni Botsford Architects",
        "link": "https://www.archdaily.com/1026175/the-old-byre-home-gianni-botsford-architects",
        "snippet": "Completed in 2023 in United Kingdom. Images by Schnepp Renou. Set on a ridge amid acres of pasture above West Cowes, Isle of Wight, near shipyards and light industry, The Old Byre is a conversion of two farm…",
        "source_url": "ArchDaily",
        "article_content": {
          "title": "The Old Byre Home / Gianni Botsford Architects",
          "content": "Projects\nImages\nProducts\nFolders\nAD Plus\nBenefits\nArchive\nContent\nMaps\nAudio\n+ 23\n\n\nText description provided by the architects. Set on a ridge amid acres of pasture above West Cowes, Isle of Wight, near shipyards and light industry, The Old Byre is a conversion of two farm buildings into a home that also affords residency and working spaces for visiting artists.\n\n\nInsulated and wrapped in corrugated cement board on the outside, the project leaves the interior of the old barns largely intact, prioritizing retention over demolition.\n\n\nSeen from the outside, The Old Byre appears indistinguishable from other farm buildings nearby. From the central courtyard on the other hand, where drift seeds and weeds grow in the cracks of the original surface and drains, a complex domestic exterior unfolds, framed by a translucent polycarbonate facade punctuated by large glazed aluminum doors which provide a separate entrance to each of the living and working spaces inside.\n\n\nThe two buildings that make up The Old Byre have been purposefully left disconnected. Daily life is animated by passages and crossings between private and social spaces, through the cool morning air, rain, and summer heat. At night, the facade glows, intimating activities on the inside. In the older barn, a house within a house has been built from spruce plywood. A back alley connects the more intimate, private interiors it harbors, tempered and modulated by full-height doors without traditional handles or locks.\n\n\nA concrete plinth supports the facade, frames the courtyard, and continues into the interior, providing the connecting ground for the transformation within. Animals used to live here, now humans. The archetypes that animate the design of The Old Byre are the piazza, the archive, the sound of work and industry, the demand of the environment, the social, the sharing of food, and care.\n\n"
        }
      },
      {
        "title": "70 points pour Giannis et Dame à Utah",
        "link": "https://www.insidebasket.com/actu/70-points-pour-giannis-et-dame-a-utah.html",
        "snippet": "Au Delta Center, Giannis Antetokounmpo et Damian Lillard totalisent 70 des 125 points des Bucks pour venir à bout du Jazz 125 à 110.",
        "source_url": "Inside Basket",
        "article_content": {
          "title": "70 points pour Giannis et Dame à Utah",
          "content": "\n\nDans la victoire des Bucks sur le Jazz 125 à 110, Giannis Antetokounmpo et Damian Lillard compilent 70 points. Individuellement, les deux stars sont à 35 points chacun avec 18 rebonds et 7 passes du Greek Freak, 8 passes et 5 rebonds de Dame Time.\n \nCôté Jazz, Lauri Markkanen et Collin Sexton sont à 19 points chacun.\n \nMilwaukee en est à 26-18, 10-34 pour Utah."
        }
      }
    ]
  },
  {
    "category": "sports",
    "keyword": "NHL",
    "articles": [
      {
        "title": "Ex-Red Wings forward trying to return to NHL via AHL",
        "link": "https://www.mlive.com/redwings/2025/01/ex-red-wings-forward-trying-to-return-to-nhl-via-ahl.html",
        "snippet": "Sam Gagner signed a professional tryout contract with the Belleville Senators.",
        "source_url": "mlive",
        "article_content": {
          "title": "Ex-Red Wings forward trying to return to NHL via AHL",
          "content": "Former Detroit Red Wings forward Sam Gagner has joined the Ottawa Senators' AHL affiliate. (AP Photo/Paul Sancya)AP\nSam Gagner has played 1,043 NHL games, including 129 with the Detroit Red Wings, and wants to play some more, even if it means working his way up through the minors.\nThe 35-year-old forward signed a professional tryout contract the AHL Belleville Senators this week and registered an assist Friday in his debut.\nGagner had been out of hockey since last season, when he played 28 games with the Edmonton Oilers (five goals, five assists) and 15 games with the AHL Bakersfield Condors (three goals, six assists).\nThe Red Wings acquired Gagner, along with two second-round picks, in 2020 from Edmonton for Andreas Athanasiou. Athanasiou had two points in 13 games with the Oilers, including four playoff contests, before bolting as a free agent. Gagner had 21 goals and 47 points with the Red Wings.\nThe Ottawa Senators have been shut out in their past two games and three of their previous five.\n\n\n\n\nIf you purchase a product or register for an account through a link on our site, we may receive compensation. By using this site, you consent to our User Agreement and agree that your clicks, interactions, and personal information may be collected, recorded, and/or stored by us and social media and other third-party partners in accordance with our Privacy Policy.\nUse of and/or registration on any portion of this site constitutes acceptance of our User Agreement, (updated 8/1/2024) and acknowledgement of our Privacy Policy, and Your Privacy Choices and Rights (updated 1/1/2025).\n© 2025 Advance Local Media LLC. All rights reserved (About Us).\nThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Advance Local.\nCommunity Rules apply to all content you upload or otherwise submit to this site.\nYouTube's privacy policy is available here and YouTube's terms of service is available here.\nAd Choices"
        }
      },
      {
        "title": "NHL Rumors: Oilers, Canucks, Maple Leafs, Stars - The Hockey Writers NHL Rumors Latest News, Analysis & More",
        "link": "https://thehockeywriters.com/nhl-rumors-january-30-2025/",
        "snippet": "NHL rumors: Could Brandon Saad go to the Oilers, would Morgan Rielly to the Canucks make sense, and how long is Heisaknen out?",
        "source_url": "The Hockey Writers",
        "article_content": {
          "title": "NHL Rumors: Oilers, Canucks, Maple Leafs, Stars",
          "content": "In today’s NHL rumors rundown, could the Edmonton Oilers be a team that looks at Brandon Saad? He’s now an unrestricted free agent, and there might be a connection. Meanwhile, one Sportsnet analyst threw out the idea of a blockbuster trade between the Vancouver Canucks and Toronto Maple Leafs. Finally, Miro Heiskanen has been ruled out week-to-week with an injury. What does this mean for the Dallas Stars and for Team Finland at the Four Nations Face-Off tournament?\n\nOilers Now host Bob Stauffer sometimes gets the fan base in Edmonton stirring. He did so on Wednesday when he threw out comments about free agents wanting to come to Edmonton, including one “who was waived today.” He was hinting at Brandon Saad and made the connection between Saad and GM Stan Bowman from their days in Chicago.\nRelated: Status of NHL Rebuilds: Senators, Sabres, Canadiens & Red Wings\nStauffer added, “And my guess is he’s going to target a team that’s cap strapped, that’s got a chance to win. Who is his general manager in Chicago? Who would know him better than Stan?”\nFrank Seravalli shot down the idea suggesting Saad is the last thing the Oilers need right now. He also suggested that if everyone on the Oilers’ roster is healthy, Saad wouldn’t have a guarantee of playing time or being a regular. Why would he want to sign up for that? Seravalli believed several teams might be interested but pointed to the Vegas Golden Knights as a team to watch.\nSportsnet’s Nick Kypreos tossed out the idea of the Canucks and Maple Leafs making a blockbuster trade. Speculation continues to surround J.T. Miller and Kypreos suggested defenseman Morgan Rielly going back to Vancouver in the deal.\nKypreos justified the idea by saying:\n“…Would you not now knock on the door of Jimmy Rutherford and you flip Morgan for J.T. Miller, who are roughly, I think, half a million dollars each off the salary cap? So that’s looked after. They’re both, I think, relatively the same age, and I think they both have relatively the same amount of years left on their contract, which is 5 years. Does that make the Leafs better?”\nHe added, “Morgan’s going to say no to a lot of teams. Going home to British Columbia, maybe, is the one team that Morgan would say yes too.” Rielly has a full no-move clause, as does Miller. While the Canucks might address their blue line issues with this trade, it doesn’t bring them back a center. And, as Justin Bourne pointed out, Rielly is having a down year. Is he the kind of player, who when put on the second pair, is the best return for Miller?\nThe Dallas Stars could be without star defenseman Miro Heiskanen for the foreseeable future, as head coach Pete DeBoer confirmed he is week-to-week with a lower-body injury. The injury occurred after a collision with Vegas Golden Knights captain Mark Stone, forcing Heiskanen to leave the game and head down the tunnel.\nAccording to Lia Assimakopoulos of the Dallas News, Heiskanen underwent an MRI on Tuesday and is set to see a specialist for further evaluation. While an exact timeline for his return remains uncertain, his availability for the upcoming Four Nations Tournament is in serious doubt, though no official decision has been made.\nLosing Heiskanen is a significant blow to the Stars, as the 24-year-old plays a crucial role in both their defensive structure and offensive transition game. So far this season, he has been among the team’s top-minute-loggers and a key piece on special teams.\nWith Heiskanen sidelined, the Stars will have to rely on players like Thomas Harley and Esa Lindell to take on bigger roles.\n\n\nFounded in 2009, The Hockey Writers is a premier destination for news and information on everything hockey. Updated hourly, with analysis, commentary and features from hundreds writers worldwide, our articles are read over 5 million times every month."
        }
      }
    ]
  },
  {
    "category": "sports",
    "keyword": "Rangers",
    "articles": [
      {
        "title": "Rangers Acquire Forward Lucas Edmonds | New York Rangers",
        "link": "https://www.nhl.com/rangers/news/rangers-acquire-forward-lucas-edmonds",
        "snippet": "New York Rangers President and General Manager Chris Drury announced today that the team has acquired forward Lucas Edmonds from the Tampa Bay Lightning in exchange for forward Ryder Korczak.\nEdmonds, 23, has skated in 26 games for the Syracuse Crunch of the American Hockey League (AHL), recording five points",
        "source_url": "NHL",
        "article_content": {
          "title": "Rangers Acquire Forward Lucas Edmonds",
          "content": "New York Rangers President and General Manager Chris Drury announced today that the team has acquired forward Lucas Edmonds from the Tampa Bay Lightning in exchange for forward Ryder Korczak.\nEdmonds, 23, has skated in 26 games for the Syracuse Crunch of the American Hockey League (AHL), recording five points (1G-4A).\nIn three seasons with Syracuse, the North Bay, Ontario native has collected 25 goals and 23 assists for 48 points in 120 contests. During his first professional season in 2022-23, he finished with 15 goals and 12 assists for 27 points in 49 games, leading all Crunch rookies in points and tying for fifth on the team in goals.\nPrior to his pro debut, the 5-11, 178-pound forward played one season (2021-22) in the Ontario Hockey League (OHL) with the Kingston Frontenacs, earning 113 points (34G-79A) in 68 games. He ranked third in the league in points and first in assists. He also won the Jim Mahon Trophy as the OHL’s top scoring right winger.\nEdmonds was originally selected by the Lightning in the third round, 86thoverall, of the 2022 NHL Draft."
        }
      },
      {
        "title": "Rangers Agree to Terms with Will Borgen | New York Rangers",
        "link": "https://www.nhl.com/rangers/news/rangers-agree-to-terms-with-will-borgen",
        "snippet": "New York Rangers President and General Manager Chris Drury announced today that the team has agreed to terms with defenseman Will Borgen on a five-year contract extension.\nBorgen, 28, has registered three points (1G-2A) in 17 games for the Rangers since being acquired from the Seattle Kraken on Dec. 18.",
        "source_url": "NHL",
        "article_content": {
          "title": "Rangers Agree to Terms with Will Borgen",
          "content": "New York Rangers President and General Manager Chris Drury announced today that the team has agreed to terms with defenseman Will Borgen on a five-year contract extension.\nBorgen, 28, has registered three points (1G-2A) in 17 games for the Rangers since being acquired from the Seattle Kraken on Dec. 18. In that span, he ranks third on the team in blocked shots (29), fifth in hits (30), sixth in total time-on-ice (316:00). From the time he made his Rangers debut on Dec. 20 through the start of play today, he is one of only 14 NHL players with 25+ hits and 25+ blocked shots. In addition, the team holds a 9-5-3 record for 21 points with him in the lineup.\nBetween the Rangers and Kraken this year, the Moorhead, Minnesota native has notched five points (2G-3A) in 50 games along with 78 hits. Over this NHL career, he has tallied 10 goals and 48 assists for 58 points in 264 games between the Rangers, Kraken and Buffalo Sabres. He registered 203 hits in 2022-23 and 195 hits in 2023-24, and he ranks 13th among NHL defensemen in hits since the start of the 2022-23 season (476).\nBorgen was originally selected by Buffalo in the fourth round, 92nd overall, of the 2015 NHL Entry Draft."
        }
      }
    ]
  },
  {
    "category": "sports",
    "keyword": "Pelicans",
    "articles": [
      {
        "title": "Mavericks-Pelicans takeaways",
        "link": "https://www.mavs.com/mav-pels-takeaways-2/",
        "snippet": "Daniel Gafford’s continued superior play and Klay Thompson’s shooting are among the highlights of the Mavericks’ win at New Orleans.",
        "source_url": "Dallas Mavericks",
        "article_content": {
          "title": "GAFFORD’S UPRISING, THOMPSON’S SHOOTING TOP MAVS’ HIGHLIGHTS",
          "content": "NEW ORLEANS – Daniel Gafford said he felt like earlier in this season he was letting down his running mate at center, Dereck Lively II.\nMake no mistake. Gafford, who is creeping up on the one-year anniversary of his arrival to the Mavericks, has let down nobody this season. But he couldn’t help the way he felt.\n“At the start of the season, I felt like I wasn’t picking him up,” Gafford said after the Mavericks’ 137-136 win over the New Orleans Pelicans on Wednesday. “We’re a team and I’m supposed to have his back.\n“Now that he’s out, it’s only right that I pick up where he left off.”\nNo worries there.\nGafford had 22 points and 12 rebounds against the Pelicans and has been on a serious sizzle since Lively went out with a stress fracture in his right ankle on Jan. 14.\nGafford’s numbers since Lively departed: 18.9 points and 10.6 rebounds per game and he has shot a remarkable 73.2 percent from the field.\nLots of those shots are dunks, but Gafford has mixed numerous nice jump-hooks that he is becoming very effective at.\nGafford was 9-of-9 from the field against the Pelicans and made all four of his free throws to go with four blocked shots and three assists. In other words, he was flawless. The Mavericks were plus-eight when Gafford was on the floor, best on the team.\nAs for his one-year anniversary with the Mavericks, Gafford said he doesn’t give it much thought and that he has handled it the way he thought best.\n“I didn’t want to come in here and try to be the main guy,” he said. “They already got the main guy (Lively).”\nHere’s our other takeaways from the win in New Orleans, which was the Mavericks’ third in their last four games.\nHeating up: Klay Thompson had 20 points, the second game in a row he’s topped the 20 plateau. He had 23 on Monday against Washington. Is this the start of something big? Maybe. “We’re making an emphasis to get him the ball and to keep getting him the ball and value those minutes when he’s out there and call his number when we don’t have anything offensively,” Kyrie Irving said. “He’s one of those emergency buttons for us. He stays in rhythm and engaged. He does great things for us.”\nLong-range weapons: For the second game in a row, the Mavericks made 20 three-pointers.\n They hit 20-of-43 triples against the Pelicans after going 20-of-45 against Washington. It’s only the fourth time this season they’ve had 20 or more three-pointers and this is the first time they’ve done it back-to-back.\nOn a roll: P.J. Washington continues to run up big numbers in the absence of Luka Dončić and Lively. In the past eight games, Washington has averaged 19.5 points, along with 10.6 rebounds over the last eight games and he had 25 points and 14 boards against the Pelicans. He has not scored below 13 points or had fewer than seven rebounds in any of those games.\nX: @ESefko\nCopyright © 2025 NBA Media Ventures, LLC. All rights reserved. No portion of NBA.com may be duplicated, redistributed or manipulated in any form. By accessing any information beyond this page, you agree to abide by the Privacy Policy / Your California Privacy Rights and Terms of Use | Accessibility and Closed Caption | AdChoices\nDesigned and developed by MG Marketing."
        }
      },
      {
        "title": "Pelicans big picture look with 36 regular season games remaining | Pelicans Podcast",
        "link": "https://www.nba.com/pelicans/news/new-orleans-pelicans-podcast-1-27-2025",
        "snippet": "On the latest New Orleans Pelicans Podcast for Monday, Jan. 27, 2025, Pelicans.com’s Jim Eichenhofer and Gus Kattengell take a big picture look at the Pelicans with 36 regular season games left to go in the 2024-25 NBA season. Also Jim introduces his new Monday segment, the Spoiler Scale.",
        "source_url": "beIN SPORTS",
        "article_content": {
          "title": "No title found",
          "content": ""
        }
      }
    ]
  },
  {
    "category": "sports",
    "keyword": "NBA",
    "articles": [
      {
        "title": "Report: Miller joining NBC as lead NBA analyst",
        "link": "https://www.espn.com/nba/story/_/id/43612770/report-reggie-miller-joining-nbc-lead-nba-analyst",
        "snippet": "Hall of Famer Reggie Miller will join NBC Sports as its top color commentator when the NBA returns to the network later this year, Front Office Sports reported Wednesday.",
        "source_url": "ESPN",
        "article_content": {
          "title": "Report: Reggie Miller joining NBC as lead NBA analyst",
          "content": "Hall of Famer Reggie Miller will join NBC Sports as its top color commentator when the NBA returns to the network later this year, Front Office Sports reported Wednesday.\nMiller reportedly will call the games alongside play-by-play broadcasters Mike Tirico and Noah Eagle, starting with the 2025-26 season.\nAn NBC Sports spokesperson declined to comment and Miller's representatives could not be reached for comment, per Front Office Sports.\nMiller, 59, has worked as an NBA analyst for TNT since 2005.\nIn August, the NBA announced a new 11-year, $77 billion media deal with incumbent ESPN and newcomers NBC and Amazon Prime Video that goes into effect next season.\nNBC previously aired NBA games from 1954-62 and again from 1990-2002.\nMiller was inducted into the Hall of Fame in 2012. The five-time All-Star shooting guard averaged 18.2 points per game over 18 seasons with the Indiana Pacers from 1987-2005."
        }
      },
      {
        "title": "NBC hiring Reggie Miller as top NBA analyst: Sources",
        "link": "https://www.nytimes.com/athletic/6097600/2025/01/29/reggie-miller-nbc-nba-game-analyst/",
        "snippet": "Miller will be paired with NBC’s Mike Tirico and Noah Eagle for NBA broadcasts.",
        "source_url": "The New York Times",
        "article_content": {
          "title": "NBC hiring Reggie Miller as top NBA analyst: Sources",
          "content": "89\nReggie Miller will be a top game analyst when NBC starts its 11-year deal to broadcast NBA games next season, sources briefed on the move said Wednesday.\nNBC declined to comment. Front Office Sports was first to report news of Miller’s deal with NBC.\nLast month, The Athletic reported NBC was in talks with Miller to add him to its broadcast team. He will be paired with the network’s No. 1 and 2 football game callers, Mike Tirico and Noah Eagle, per the sources.\nAdvertisement\nNBC recently hired game analyst Jamal Crawford to join its NBA coverage. Like Miller, Crawford will work with Tirico and Eagle. NBC views Miler and Crawford as both being its top analysts. If it remains with a two-person team, it will have to designate one as the true No. 1 for when it broadcasts its marquee events, like the conference finals. It could also eventually choose to go with a three-man booth for its biggest games.\nNBC/Peacock will begin its 11-year, nearly $27 billion deal with the NBA next season and will likely need at least four broadcast teams. Beginning next year, Peacock will have exclusive games each Monday. On Tuesdays, NBC will have national games, but will be regionally divided with two games.\nThe network will have extended playoff coverage, sharing the postseason with ABC/ESPN and Amazon Prime Video. In six of the 11 seasons, NBC will air one of the conference finals.\nMiller, 59, played 18 seasons in the NBA — all with the Indiana Pacers — and earned five All-Star selections. Following his playing career, he entered broadcasting and has worked with TNT since 2005. He was inducted into the Naismith Basketball Hall of Fame in 2012.\n(Photo: Ron Chenoy / Imagn Images)\n"
        }
      }
    ]
  },
  {
    "category": "global",
    "keyword": "NFTs",
    "articles": [
      {
        "title": "Crypto NFT Today: The Latest News in Blockchain, Cryptocurrency, & NFTs- January Week 4 - Innovation & Tech Today",
        "link": "https://innotechtoday.com/crypto-nft-today-the-latest-news-in-blockchain-cryptocurrency-nfts-january-week-4-2/",
        "snippet": "Welcome to another edition of Crypto NFT Today! The past two weeks have been full of must-know events that will define the future of blockchain,",
        "source_url": "Innovation and Tech Today",
        "article_content": {
          "title": "Crypto NFT Today: The Latest News in Blockchain, Cryptocurrency, & NFTs- January Week 4",
          "content": "January 31, 2025\nCHECK THIS OUT\nWelcome to another edition of Crypto NFT Today! The past two weeks have been full of must-know events that will define the future of blockchain, cryptocurrency, and NFTs.\nWith a huge Bitcoin profit reported for Tesla this week, Fairshake announcing money that has the potential to influence the 2026 election, and more, there’s lots of essential news you should know about. So, let’s dive in and see what’s happening! \nTesla’s Bitcoin holdings contributed to a significant surge in reported net income for the fourth quarter, thanks to a recent change in accounting rules for digital assets. Tesla’s digital asset value jumped from $184 million over the past four quarters to $1.08 billion for the December period, according to its earnings release on Wednesday.\nThis increase follows a recent policy shift by the Financial Accounting Standards Board (FASB), which now requires companies to mark their digital asset holdings to market each quarter, starting in 2025. Prior to this change, companies that owned Bitcoin had to report their holdings at the lowest value recorded during their ownership, even if the asset’s value increased later.\n\nFairshake, the super PAC funded by some of crypto’s biggest backers, revealed Thursday that it has $116 million in cash on hand, positioning itself with a substantial war chest for the 2026 midterm elections. The fundraising total, which includes $11 million in new contributions, solidifies Fairshake as one of the most powerful political forces in the country.\n“With the midterms approaching, we are ready to continue supporting candidates who are dedicated to advancing innovation, creating jobs, and implementing thoughtful, responsible regulation,” Fairshake said in a statement.\nSeveral online marketplaces selling Donald Trump-branded merchandise—such as GetTrumpWatches.com, GetTrumpFragrances.com, and GetTrumpSneakers.com—have begun accepting the Trump memecoin (TRUMP) as a payment method, in addition to credit cards and Bitcoin (BTC).\nPayments via TRUMP will be processed through Solana Pay, a decentralized payment system that enables users to send money directly to merchants without intermediaries. According to the website’s FAQ, the watches are made-to-order and will start shipping in October. These products are not sold directly by Trump but are part of a licensed partnership with CIC Digital LLC, the company responsible for issuing the TRUMP tokens.\nFormer U.S. Senator Bob Menendez, a vocal crypto skeptic, was sentenced to 11 years in prison on Wednesday after being convicted on charges of bribery and acting as an agent for Egypt.\nMenendez, a Democrat from New Jersey, was known for his strong criticism of cryptocurrency. He once described Bitcoin (BTC) as an “ideal choice for criminals” and opposed El Salvador’s adoption of BTC. “You were successful, powerful, you stood at the apex of our political system,” District Judge Sidney H. Stein told Menendez, as reported by AP.\nInnovation & Tech Today features a wide variety of writers on tech, science, business, sustainability, and culture. Have an idea? Visit us here: https://innotechtoday.com/submit/\n \nWe hate spam too. You'll get great content and exclusive offers. Nothing more.\nINNOVATIVE PROPERTIES WORLDWIDE, INC.\n720.476.4920\nFollow Us\n©Innovation & Tech Today 2025. All rights reserved.\nIPW"
        }
      },
      {
        "title": "Ethereum NFT Project Doodles Swaps CEOs After McDonald’s Collab - Decrypt",
        "link": "https://decrypt.co/303207/ethereum-nft-project-doodles-swaps-ceos",
        "snippet": "Original artist Scott “Burnt Toast” Martin is taking over the CEO role, declaring that the “extractive corpo era of Doodles is over.”",
        "source_url": "Decrypt",
        "article_content": {
          "title": "No title found",
          "content": ""
        }
      }
    ]
  },
  {
    "category": "entertainment",
    "keyword": "Drag Race",
    "articles": [
      {
        "title": "RuPaul’s Drag Race Recap: Character Work",
        "link": "https://www.vulture.com/article/rupauls-drag-race-recap-season-17-episode-4-btch-im-a-drag-queen.html",
        "snippet": "An unchallenging challenge delivers little drama, but a lot of information about the queens’ individual strengths and weaknesses.",
        "source_url": "Vulture",
        "article_content": {
          "title": "RuPaul’s Drag Race Recap: Character Work",
          "content": "Things you buy through our links may earn Vox Media a commission.\nWatching this week’s episode of Drag Race is like watching an episode of How It’s Made: Everybody does their job, I am able to gather information, and there’s no real tension. That’s not really a criticism. Drag Race, or any reality show really, needs this kind of episode in order to tell us basic information about the contestants, to put points on the board for the contenders, and to unceremoniously shuffle the non-contenders off-screen. The hope is that, even if it’s not gripping TV, it will at least be funny and fun enough to endear us to the contestant pool.\nSo, were you endeared? Did you walk away thinking “this is a group of queens I’m happy to spend time with?” I would say this episode worked about 50 percent on me — as in, I’m pretty enchanted by about half the girls, and the other half make my eyes glaze over. And it’s too bad that, for the second week in a row, one of the ones I was enchanted by goes home, leaving us with a cast that’s increasing in blandness by the day. But all hope is not lost! Ignoring this week’s elimination, the show is on track to do what it does best: Funnel the most interesting competitors into the top. Are a lot of queens who don’t make for the best TV still present? Well, yes. Am I dreading the next episode? No, I’m not.\nContributing to the episode’s smoothness — as in its lack of distinction or, well, interest — is that the challenge is just so easy. This week, the girls are tasked with making what are essentially 30-second music videos inspired by iconic Drag Race moments. Do a lip sync” is not exactly the hardest ask for a group of drag queens, and the collaboration being asked of them is very simple: you do your assigned clip, I’ll do mine. “The challenge still seems very individual,” the eventual winner says at one point. And she’s right!\nPart of the issue is that it doesn’t leave much room for the queens to maneuver. They’re “randomly” (which is to say, not at all randomly) assigned both their groupings and their parts, which are written for them, and their sole job is to interpret. If they were choosing their own parts, then at least we’d be able to say the challenge required some amount of understanding about both what they’re good at and what the judges respond to. Can I fault Lana Ja’Rae’s entirely forgettable work this week when she was saddled with a bland track? Kinda! But not as much as if she’d chosen the part for herself. Still, what surprised me is how wide the gap ended up being between the best and worst performances. There was both a higher ceiling and a lower floor for performances than I expected, which is a big part of successful challenge design. Granted, there was still a large group of middling, unexciting performances, but I also learned that some people are stars with a strong sense of artistic direction (in 30-second increments) and others… well, we’ll get to Kori later.\nSince this episode isn’t about a storyline but rather characters, I think it’s worth looking at each queen’s path through the episode and the season so far, starting with Onya Nerve, who is rapidly approaching “Lock for top four” status. She’s granted a killer track, doing a jazzed-up version of Laganja Estranja’s standup set, and she absolutely murders it. The thing that the judges are rightly harping on with Onya is that she’s the one queen this season with presence. When she’s performing, you can’t keep your eyes off of her, and it turns out she is a remarkable lip syncer with a wildly expressive face. So far, her storyline focuses on her “lone wolf” qualities — she’s not used to working with other queens, and she’s wildly suspicious of Drag Race’s strategic side — which I assume will lead to further conflict down the line. In the Werk Room, we get a whole section dedicated to Onya’s point of view on integrating drag and Black culture, and on the runway she gets to exemplify that in a dress covered in African quilts. I might quibble that the black panel around her knees is too big, but she looks great. Two weeks ago, I called her a dark horse. These days, she looks like a full-on frontrunner.\nCrystal Envy is pretty clearly in second place this week, which is interesting. The first part of Drag Race typically focuses on basic competency, leaving the measurements of character creation, creative capabilities, and branding for the back half. As with Q last season, it seems like Crystal is altogether likely to breeze through this first part of the competition but have some trouble in the second half. She’s a super-competent pageant girl (the occasional wigline aside), but I have yet to fully understand the Crystal character. In the video, she’s a strict bitch, and she puts the pageant background to good use when directing the other girls, but I liked her way more as the human tumbleweed in Lana and Lydia’s video. Would love to see her expand on that ridiculous side. My issue comes on the runway: She rightfully earns raves for a “delicious” outfit, but I still don’t see any aesthetic point of view here. It’s good drag! Better drag than Onya’s, even! But I could pick Onya’s outfit out of a lineup as Onya’s outfit. What is specific to Crystal, the performer, here?\nThey’re joined in the top by Suzie Toot, who seems to be there largely so Michelle can commend the fact that she changes up her makeup on the runway. Her rocker number is cute, and displays a performer’s understanding of how to create a parody of a rock star character. She isn’t The Standout, but she does stand out, and it’s a good sign for Suzie that she can land in the top without it feeling like a “breakout” episode for her in any way. I didn’t really respond to the outfit, but the makeup was the important part. I think we can assume that she’s one of the major characters of the season.\nWe’re still in a place where “skating by” is a pretty reasonable strategy, though next week is probably the last time we can pretend that’s okay. The biggest coasters at this point are pretty clearly Lana and Lydia, both of whom have yet to get the breakout moments that queens like Lexi, Onya, and Jewels seem to snatch up with ease. They end up paired in the music video challenge and are both positively steamrolled by Crystal’s human tumbleweed. I like Lydia’s look a lot this week — glad to see her get out of excessive ruching — but thought Lana’s leg warmers were kind of ugly. Still, both of these young queens are looking more and more like cannon fodder.\nMaintaining cannon-fodder status as well are Hormona Lisa and Acacia Forgot, though the former does significantly better than the latter this week. In fact, if any of the queens who have yet to wind up in the top were to make a late-stage run this season, I think I’d bet on Hormona. The “Porkchop queen to real contender” storyline is juicy, and she has a well-documented sense of humor, even if it didn’t come through in her talent show. Compare that to Acacia, who allows Sam Star to bulldoze past her in every way this week. Acacia’s biggest strength is an ugly-chic aesthetic that nobody else is really touching, but as of yet, she’s not been able to translate her drag POV to success in the challenges. Hormona’s runway is sweet and inoffensive. Her best look is still somehow the one she made there.\nLast week’s winner Sam Star has a quieter week, but, especially in Untucked, the claws are slowly coming out with this one. She’s mostly exhibited strained positivity thus far, but one of the biggest strengths of her mother Trinity the Tuck as a TV character is that she was unafraid, when needed, of being a true, Southern, tell-it-like-it-is bitch. It seems like Sam might have a little more of that than she’s letting on, and since I think she’s in this competition for the long run, I’d like to see more of that. Her runway this week is another grandiose piece of costuming, but “I woke up like this” is yet another example of her being stuck in the early 2010s. As for her video, it’s nothing great, but she’s clearly the star when compared to Acacia.\nClear frontrunners Lexi and Jewels both get prominent time in the Trauma Makeup Corner this week. (Jewels’s second visit!) They also both do well in the video, though Lexi inexplicably gets narrated as doing badly while filming her musical-theater-ballad Jasmine Kennedie bit. She’s fine! Both of these queens are clearly toward the front of the pack — Lexi’s already a challenge winner, while Jewels was top two the first week and outshone Arrietty in their Alyssa Edwards-themed dance track video this week — and they’re both wildly good at claiming screen time. On the runway, Lexi pulls off yet another high-fashion stunner (that doesn’t quite fit the challenge), while Jewels is polished if not groundbreaking. I see both these girls making it to the end. Still, if there’s an issue to flag with both of their storylines, it’s that neither has talked to the judges yet because of Rate-A-Queen. Either could have taken Suzie’s spot in the top this week if the show wanted them there, but Suzie was foisted forward and established a rapport with Michelle and Ru. Something to keep an eye on!\nArrietty has a bit of a downer episode, after a solid second-place showing last week. Her critiques largely focus on her being outshined by Jewels (accurate), but I have a feeling that the more relevant point is that Michelle hates her makeup. She showed last week that she’s willing to tone it down — and honestly, that was my favorite makeup of hers — so I’m surprised at how surprised she is that the judges don’t like her signature beat. Michelle hates everyone’s signature beat! Is it fair? More and more these days I come down on the side of “the show is not about drag, it’s about Drag Race drag, so don’t get pissy when they don’t like the thing you knew they wouldn’t like.” I’m not saying that their close-mindedness is correct, but I do think it’s well-documented. Her look otherwise gets knocked for not looking quilt-like, which is fair, but it’s still a better outfit than the vast majority of the girls.\nAlso in the bottom is Kori King, who it turns out needed a break in her confidence. Kori carries herself like a real contender, which is great because delusion can get you far, but her work has just not lived up to her imagined skill level. The video this week is bad, and for all her ability to catch the camera’s eye, she shows real issues knowing what will read on camera. The video is uncomfortable to watch, and her explained jokes don’t land. It’s looking like this queen might be all bombast. The polish issues that Michelle brings up with her look this week are also really big problems: The bottom of the breastplate is visible, her undergarments are showing in the back, the sizing of the hair is totally wrong, etc. That’s all fine on stage at Jacques’ or Lizard Lounge, but it’s tougher sell on TV.\nAnd that, finally, brings us to Joella, who goes home this week not because her Mariah Paris Balenciaga-inspired gospel performance in the challenge is worse than Kori’s (it’s not), but because of her runway. For the “quilted” runway, Joella comes as a quilt. She wears a large rectangle of quilting, and nothing else. Here’s the thing: This kind of troll drag really appeals to me. It’s not Drag Race-y, but it’s interesting to hear the judges critique this outfit like it’s an attempt to look like Crystal Envy that failed. “You have no shape!” The Drag Race judges cry in response to a giant rectangle of stupidity. For all the talk of RuPaul wanting “stupid” from the girls, this is a much better example than Burger Finger ever was. I think it’s a mistake to wear this, but I’m not going to pretend like I didn’t think this look was hilarious and amazing.\nOnya ends up winning the challenge, quite rightly but to Crystal’s dismay, and Kori and Joella lip sync to the Pussycat Dolls’ “Buttons.” I don’t think anyone, either in the room or watching at home, had much hope for Joella by the time the music started, but whatever hope did exist was diminished when she decided to try to make it look like the RuPaul on the back of her quilt outfit was lip syncing to Snoop Dogg’s verse by shaking her ass. But — and here’s the thing — I did laugh. Kori definitely beats Joella, but I’m sad to see her go. She held my interest every time she was on screen! That’s no easy task. RIP to a true queen.\n• Untucked isn’t as good this week, but it’s still fun. Sam Star starts getting really bitchy, and it’s really fun. Even with that, though, I think the best moment is Hormona telling us about how her mother quilted her outfit with one hand because she chopped the other fingers off accidentally. That’s a true country girl.\n• I assume this challenge was inspired by the B. Ames-style of Drag Race remixes, but none of the content even sort of compared to the quality of her work. I recommend you revisit the Alyssa Edwards remix stat!\n• The only moment used in the remixes that I wasn’t super familiar with was the Mariah monologue that Joella lip synced to, which happens in the same Untucked episode as the sugar daddy fight. Do you think they had to avoid sugar daddy because Shangela is too toxic right now? Something to chew on!\n• The shots on the runway where Joella’s quilt takes up the entire screen is some of the best Drag Race cinematography in a long time.\n• My favorite runway quip in a long while is Carson referring to Acacia’s look as “The number one Amish saleswoman for Mary Kay.”\n• Trauma makeup corner: Lexi and Jewels both share the reasons they started drag. For Lexi it was so she could physically survive after being kicked out of her home by her mother, and for Jewels it was a form of gender expression.\n• Gay thoughts from gay people: My dear friend Kat texted me this screed while watching the episode live that I will now copy and paste for you to read: “literally what is there to hate about Joella’s outfit except for the fact that it is TOO iconic and incredible??? We’ve been clamoring for the delusional queens, queens with a strong POV, and then Joella gives you just that and you call it bad???? it is so spectacularly insane that you can’t help but love it. She really said the best way to showcase WHO I AM on the runway is in a giant quilt with my face poking out. And I say THANK YOU JOELLA!!!” To that I would add: I loved loved loved watching it deflate.\n• Predicted top four: Holding steady with Lexi, Suzie, Onya, Sam, but I’m not entirely sure about it. Are the first four challenge winners just the top four? Should I maybe swap Sam for Jewels?\nBy submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.\nThings you buy through our links may earn Vox Media a commission."
        }
      },
      {
        "title": "Drag Race’s Latest Twist Ending Was Predicted by Daya Betty",
        "link": "https://tvline.com/recaps/drag-race-season-17-episode-5-ending-results-predicted-1235404685/",
        "snippet": "We’ll tell you one queen who wasn’t surprised by the end of ‘Drag Race’ Season 17, Episode 5 — Daya Betty. Let us explain.",
        "source_url": "TVLine",
        "article_content": {
          "title": "Drag Race’s Latest Twist Ending Was Predicted by Daya Betty",
          "content": "\nFriendly warning: This article spoils RuPaul’s Drag Race Season 17, Episode 5. Haven’t watched yet? Sashay… away.\nDaya Betty might want to go out and buy herself a few lottery tickets right about now.\nFriday’s episode of Drag Race ended with eliminated queen Arrietty pulling the remaining lucky lever on the Badonka Dunk Tank (presented by Las Vegas!), drenching Michelle Visage and saving herself from having to go back to Seattle.\nSo, what exactly does this have to do with Season 14 queen Daya, you ask? Well, Arrietty’s lucky lever happened to be No. 1, just as Daya predicted it would be during her recent visit to Drag Race’s official after show The Pit Stop. Her theory was that, because the previous lucky lever was No. 7, the other one would turn out to be No. 1. She called it a Season 17 “Easter egg.” \n\n“There’s a reason for everything,” Daya said. “I mean, you know what? You heard it here, folks. And if I cracked the code, I’m just saying, I need a producer credit.” \nTo be fair, it’s absolutely up for debate whether credit for this prediction should be given to Daya or Pit Stop host Monét X Change. It was, at the very least, a collaborative effort. But since they seem comfortable settling on Daya, so will we. Watch the convo (beginning at the 31-minute mark) and decide for yourself:\nEarly frontrunner Suzie Toot netted her second win of the season this week, unsurprisingly crushing the acting challenge, while Lydia B(utthole) Kollins found herself in the bottom alongside Arrietty. Following a lip sync battle to Earth, Wind & Fire’s “Boogie Wonderland,” Lydia was sent to safety… and you know the rest.\nSince no queens were eliminated this week, 12 remain in the competition: Acacia Forgot, Arrietty, Crystal Envy, Hormona Lisa, Jewels Sparkles, Kori King, Lana Ja’Rae, Lexi Love, Lydia B(utthole) Kollins, Onya Nurve, Sam Star and Suzie Toot.\nThat said, Arrietty did pull the only remaining lucky lever. So for those of you sickos who derive pleasure from watching girls’ dreams get crushed on national television, your wait will soon be over.\nComments are monitored, so don’t forkin' curse and don’t bore us with how much your coworker’s sister-in-law makes per hour. Talk smart about TV!\n\nComment *\nName *\nEmail *\nYour email address will not be published. We will notify you when someone replies.\n\n\nΔdocument.getElementById( \"ak_js_1\" ).setAttribute( \"value\", ( new Date() ).getTime() );\nThis is a coincidence, this whole thing is obviously rigged, Arrietty was saved because production wanted her to be saved, it didn’t matter which lever she pulled.\n\nI totally agree! They wanted to keep her and they wanted to be done with the tank. Killed two birds with one stone.\n\nRegardless of lever, production was going to dunk Michelle.\n\nBy providing your information, you agree to our Terms of Use and our Privacy Policy. We use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply.\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising.\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\n"
        }
      }
    ]
  },
  {
    "category": "entertainment",
    "keyword": "Royal Rumble",
    "articles": [
      {
        "title": "WWE Royal Rumble 2025: Favourites to win men’s Rumble match",
        "link": "https://www.indiatoday.in/visualstories/sports/wwe-royal-rumble-2025-favourites-to-win-mens-rumble-match-206081-29-01-2025",
        "snippet": "Here’s a look at the favourites to win the men’s Royal Rumble match this year.",
        "source_url": "India Today",
        "article_content": {
          "title": "No title found",
          "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
        }
      },
      {
        "title": "When is the WWE Royal Rumble? Royal Rumble Date, TV Channel and More... - The Playoffs",
        "link": "https://theplayoffs.news/en/when-is-the-wwe-royal-rumble-royal-rumble-date-tv-channel-and-more/",
        "snippet": "The 2025 Royal Rumble to be star-studded with legends like John Cena, CM Punk, Rey Mysterio, and Seth Rollins.",
        "source_url": "",
        "article_content": {
          "title": "When is the WWE Royal Rumble? Royal Rumble Date, TV Channel and More…",
          "content": "The 2025 Royal Rumble to be star-studded with legends like John Cena, CM Punk, Rey Mysterio, and Seth Rollins.\nWWE has been a hot topic on social media ever since the 2025 Royal Rumble was announced. Royal Rumble is just a few days away and the internet is filled with rumors, speculations, and queries regarding the mega event. Numerous legends and superstars have announced their participation in the Rumble. The winner of the Rumble gets to choose the title for which they would like to compete at WrestleMania.\nRoyal Rumble is scheduled to take place on Saturday, February 1, 2025. WWE to set to start February their largest event after Wrestlemania. They started January with Raw’s Premiere on Netflix and amassed 4.9 million views globally.\nFifteen superstars have announced themselves for the 30-Men Royal Rumble. Four of them are from the SmackDown brand while ten of them are from the Raw brand. It includes legends like John Cena and Rey Mysterio who will be attending their last Royal Rumble. Superstars like CM Punk, Seth Rollins, Roman Reigns, LA Knight, and Jey Uso will also be participating in the Royal Rumble.\nWWE United States Championship Shinsuke Nakamura and WWE Intercontinental Champion Bron Breakker will also take part in the Rumble. Sami Zayn, LA Knight, Chad Gable, Penta, Carmelo Hayes, and Logan Paul are the other superstars who will be part of the 30-Men Royal Rumble.\n#RoyalRumble is about to go VIRAL this Saturday because @LoganPaul will be competing in the Men's #RoyalRumble Match!\n\n📍 INDIANAPOLIS\n🎟️ https://t.co/MlJix5Xu1y pic.twitter.com/V95nPGnH6l\nTen women from the WWE roster have also announced their participation. Four of them are from the SmackDown brand and the remaining six are from the red brand of WWE. Charlotte Flair will also return to WWE through the Royal Rumble. Women’s tag team champion Bianca Belair and Naomi will also be part of the Rumble.\nWWE Intercontinental Champions Lyra Valkyria, Liv Morgan, Raquel Rodriguez, Nia Jax, Bayley, Ivy Nile, and Iyo Sky are the remaining to take part in the 30-Women Royal Rumble.\nWomen's Intercontinental Champion @Real_Valkyria looks to SOAR in the Women's #RoyalRumble Match this Saturday!\n\n📍 INDIANAPOLIS\n🎟️ https://t.co/MlJix5Y1R6 pic.twitter.com/7U7UEq5cUS\nCody Rhodes and Kevin Owens will fight in a ladder match for the WWE Undisputed Championship. DIY will fight against Motor City Machine Guns for the tag team championship in a 2-out-of-3 Falls match.\nAlso Read: WWE Royal Rumble 2025 Predictions: Will AJ Lee make an appearance at the Royal Rumble?\nThe 2025 Royal Rumble will occur at Lucas Oil Stadium, Indianapolis, Indiana at 6 PM ET / 3 PM PT. It is the home ground for the Indianapolis Colts in the NFL. The stadium has a seating capacity of 63,000 fans.\nWWE Royal Rumble will stream live on Peacock in the USA and on Netflix internationally.\nNo, Royal Rumble will air on Peacock in the United States. It will be available on Netflix internationally.\nAlso Read: Braun Strowman Injury Update: What happened to Braun Strowman?\nImage Credit: WWE X.com\n"
        }
      }
    ]
  },
  {
    "category": "entertainment",
    "keyword": "Sabrina",
    "articles": [
      {
        "title": "‘Confident’ Sabrina Carpenter addresses ‘regressive’ critics",
        "link": "https://www.geo.tv/latest/587430-confident-sabrina-carpenter-addresses-regressive-critics",
        "snippet": "Sabrina Carpenter just broke silence over her viral racy persona.The 25-year-old pop star, who gained immense recognition over her latest song, Espresso, bluntly told her critics to stay away from her performances if they don’t…",
        "source_url": "Geo News",
        "article_content": {
          "title": "'Confident' Sabrina Carpenter addresses 'regressive' critics",
          "content": "January 26, 2025\nSabrina Carpenter just broke silence over her viral racy persona.\nThe 25-year-old pop star, who gained immense recognition over her latest song, Espresso, bluntly told her critics to stay away from her performances if they don’t like her raunchy displays.\nAddressing the criticism she faces for her risque dance routines, revealing outfits and indirectly explicit lyrics, Carpenter expressed frustration over the fact that female artists are still being \"shamed.\"\nSpeaking to The Sun for their Sunday newspaper, the Feathers hitmaker said, “My message has always been clear — if you can’t handle a girl who is confident in her own s**uality, then don’t come to my shows.”\nShe continued, “Female artists have been shamed forever. In the Noughties it was Rihanna, in the Nineties it was Britney Spears, in the Eighties it was Madonna — and now it’s me.\"\nCarpenter also mentioned that her critics have a rather “regressive” attitude as they ignore all the positive aspects of her art.\n“It’s essentially saying that female performers should not be able to embrace their s**uality in their lyrics, in the way we dress, in the way we perform,” she explained.\nThe Please Please Please singer continued, “It is totally regressive. It’s like those who want to shame don’t make comments when I talk about self-care or body positivity or heartbreak, which are all normal things a 25-year-old goes through. They just want to talk about the s**ual side of my performances.”\nShe also believes that it is important for women in the industry to support one another in these situations.\n“As women, we can look at another woman and be like, ‘Oh, she has the perfect body’. But if you were to ask the woman you think has a perfect body, I guarantee she will have her own insecurities. That’s why as women we need to be kind to each other,” Sabrina Carpenter concluded.\nCopyright © 2025. Geo Television Network. All Rights Reserved. | Contact Us | Authors"
        }
      },
      {
        "title": "Sabrina Carpenter: “Female artists have been shamed forever”",
        "link": "https://faroutmagazine.co.uk/sabrina-carpenter-hits-back-criticism-image/",
        "snippet": "‘Espresso’ hitmaker Sabrina Carpenter has responded to harmful comments made by Mike Stock, Matt Aitken and Pete Waterman, who claimed her image is “offensive.”",
        "source_url": "Far Out Magazine",
        "article_content": {
          "title": "Sabrina Carpenter hits back at criticisms of her image: “Female artists have been shamed forever”",
          "content": "American pop sensation Sabrina Carpenter has responded to comments made by the songwriting trio Mike Stock, Matt Aitken and Pete Waterman, who labelled the singer’s image as “offensive.” \nThe trio wrote and produced many classic hits throughout the 1980s and 1990s, including tracks by Dead or Alive, Kylie Minogue, Rick Astley, Cliff Richard, and Donna Summer.\nHowever, speaking to The Sun, Stock, Aitken, and Waterman claimed that Carpenter’s approach to femininity is harmful. Waterman claimed, “To see Sabrina Carpenter dressed as a little girl is quite offensive.”\nThe former Pop Idol judge added, “She doesn’t need that. She’s got great talent and yet the whole of the industry, these girls come out in as little as possible because they know they’re driving young boys to their websites.” \nMeanwhile, Stock said: “They’ve won all of their freedoms and their rights, women. They fought for everything they’ve got and now they’re throwing it away, is the way I would look at it.”\nThe trio also criticised Carpenter’s “allegorical” take on “sexual” lyrics.\nIn response to these comments, Carpenter spoke to The Sun on Sunday, stating, “My message has always been clear – if you can’t handle a girl who is confident in her own sexuality, then don’t come to my shows.” \nShe continued, “Female artists have been shamed forever. In the noughties it was Rihanna, in the nineties it was Britney Spears, in the eighties it was Madonna – and now it’s me. It’s essentially saying that female performers should not be able to embrace their sexuality in their lyrics, in the way we dress, in the way we perform.” \nCarpenter concluded by calling the trio “regressive,” adding, “It’s like those who want to shame don’t make comments when I talk about self-care or body ­positivity or heartbreak, which are all normal things a 25-year-old goes through. They just want to talk about the ­sexual side of my performances.”\nThe singer, a former Disney star, found worldwide success with her album Short n’ Sweet last year, becoming one of the biggest names in contemporary music thanks to the record.\n\n\nPlease add me to the mailing list!\n\nPlease add me to the mailing list!\n"
        }
      }
    ]
  },
  {
    "category": "entertainment",
    "keyword": "Pillows",
    "articles": [
      {
        "title": "Project aims to save willow tit from extinction",
        "link": "https://www.bbc.co.uk/news/articles/c74en5nj4elo",
        "snippet": "Natural England says the willow tit is one of the UK’s fastest declining resident birds.",
        "source_url": "BBC",
        "article_content": {
          "title": "Mission to save willow tit from extinction",
          "content": "The population of willow tits in Britain has fallen by 94% since 1970, said Natural England\nWork is under way in Cornwall to help save a native bird which nature experts have described as \"dangerously close to extinction\".\nThe county is one of the last areas in southern England which still has willow tits, according to Natural England (NE).\nAs part of the project, areas of Goss Moor in mid Cornwall are being managed to create habitat where it is easier for the birds to forage.\nBeth Lloyd-Davies, senior reserves manager for Goss Moor National Nature Reserve, said: \"The bird is really special. We need to do all we can to protect it.\"\nBeth Lloyd-Davies, senior reserves manager for Goss Moor National Nature Reserve, described the willow tit as a special bird\nNE, which is funding the initiative, said the willow tit was believed to be the UK's fastest declining resident bird.\nIt said only a core population remained on the mid-Cornwall moors Site of Special Scientific Interest (SSSI), particularly Goss Moor and Helman Tor.\nNE said the willow tit was:\nThe only British tit species to excavate its own nest holes\nTimid and sometimes bullied by great tits and blue tits\nA bird that thrived in wet woodland and scrubland of mixed age\nWillow is being cut back at Goss Moor to encourage regrowth and create foraging ground for willow tits\nIan Moye, who is managing the conservation work, said the project included clearing large areas of scrub.\n\"It's about increasing biodiversity, with more insects and invertebrates,\" he said.\n\"It creates a good habitat for willow tits, especially when they are feeding their young.\"\nPeter Roseveare, from Cornwall Birds, has been monitoring willow tit numbers as part of the Cornwall Willow Tit Project\nPeter Roseveare, of Cornwall Birds which is also part of the project, said he was optimistic the work would help save the willow tit.\n\"If we continue to do this work on a habitat wide scale, the bounce back could be pretty quick,\" he said.\nThe University of Exeter, Natural England and Cornwall Birds are working with other local groups as part of the project.\nNatural England said semi-rotten logs and branches were ideal nest sites for willow tits\nDavid Marshall, programme manager at NE, said the focus of its work was nature recovery and inspiring others to manage land in a nature friendly way.\n\"The habitat restoration is giving the population a real chance to recover,\" he said.\n\nA Defra spokesperson said the government was committed to protecting and restoring nature, including reversing the decline in species.\n\"That is why we are investing over £400m into nature's recovery to create habitats for wildlife to thrive and families to enjoy,\" they said.\n\"We are also investing £5bn into farming over the next two years – the largest ever directed at sustainable food production and nature recovery in our country's history.\"\nFollow BBC Cornwall on X\n, external\n, Facebook\n, external\n and Instagram\n, external\n. Send your story ideas to spotlight@bbc.co.uk\n, external\n.\nOne in six UK species at risk of extinction - report\nClimate and Nature Bill falls as MPs vote to end debate\nDartmoor given funding boost for its heritage and nature\nNatural England\nUniversity of Exeter\nCornwall Birds\nAppeal for help to bring the bells of St Sampson's Church home\nHelston man sentenced over giving false information to police\nTaxi driver filmed trying to 'run over' teens says 'I would do it again'\nMan with alcohol addiction died suddenly while with friends, inquest hears\nPublic notices roundup: Road closures in Falmouth and Penryn\nPolice on scene after two vehicle collision at A30 blackspot\nHamas releases three Israeli hostages in Gaza\nMedical jet with six on board crashes into Philadelphia neighbourhood\nSecretive US church coerced women into giving up babies for adoption\nSecretive US church coerced women into giving up babies for adoption\nThe Papers: 'AstraZeneca ditches vaccine plant' and Trump's EU tariff threat\n'My £5,700 energy bill was cancelled because supplier broke rules'\nBeyoncé and Taylor Swift square off at Grammys - what to watch for\n'I'm a circus acrobat - I can't do school holidays'\nTake-off or bail out? The airport even Ryanair thinks is a tough sell\nLabour ministers tread carefully as welfare reform looms\nDrew McIntyre: 'I'm a wrestling villain - but my mum was my hero'\nCould the UK actually get colder with global warming?\nThe story behind a rugby icon who faded into the shadows\nGavin Henson was everywhere. Then he wasn’t. But does he want to be found?\nPreview the highly anticipated Motherland spin-off\nLucy Punch returns as ‘alpha mum’ Amanda to face downsizing and the horror of modern teens\nHow to halve the cost of your phone bill\nMartin talks about new rules that stop surprise price increases in your contract\nGreat British Menu returns for its 20th anniversary\nThe nation's top chefs compete for the chance to cook at an incredible four-course banquet\nCopyright © 2025 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking."
        }
      },
      {
        "title": "Google’s 105-Qubit Willow Chip Achieves Major Quantum Milestones",
        "link": "https://www.forbes.com/sites/moorinsights/2025/01/28/googles-105-qubit-willow-chip-achieves-major-quantum-milestones/",
        "snippet": "The chip has broken new ground in a key random circuit sampling benchmark, an important development in Google’s roadmap for fault-tolerant quantum computing.",
        "source_url": "Forbes",
        "article_content": {
          "title": "Google’s 105-Qubit Willow Chip Achieves Major Quantum Milestones",
          "content": "Google's new Willow quantum chip has broken new ground in an important random circuit sampling ... [+]\nGoogle has chalked up several amazing quantum computing records with its newest quantum 105-qubit superconducting chip called Willow. This performance is no surprise, considering Google’s heritage of record-setting quantum chips, reaching back to Foxtail in 2017, Bristlecone in 2018 and Sycamore in 2019.\nGoogle announced Willow last month, and I think it is necessary to reemphasize the importance of this research after Jensen Huang, CEO of Nvidia, recently remarked that quantum computing likely won’t be useful for another 20 years. Granted, there remains a lot of ground to cover to reach fault tolerance, which will be critical for many practical applications, but there has also been a lot accomplished in quantum in just the past 12 months. Marketplace evidence, research results (including qubit fidelity close to what is needed for fault tolerance) and the roadmaps of many quantum computing companies indicate that useful quantum technology is much closer than Huang believes.\nRead on for more on how the new Willow chip performed on the random circuit sampling benchmark. I also discuss what may be the most important piece of this development for future quantum fault tolerance, the results of applying a new error-corrected surface code. To provide more context, I’ll also share historical perspective from Professor John Martinis, who led some of the most important work on earlier generations of Google’s quantum chips, and how his work has now paid off — just as he predicted — with Willow.\nWillow’s performance across key metrics\nWillow has improved on earlier generations of Google’s quantum chips in several ways. For starters, the use of tunable qubits and couplers in Willow has provided it with much faster gates and operations that help achieve lower error rates. This speed also allows hardware to be optimized or adjusted during operation. Variances in superconducting qubits can sometimes create high error rates, but tuners allow nonconforming qubits to be reconfigured and aligned with other qubits to eliminate errors.\nNext up is the duration of quantum states. A major limitation of quantum computing has been the length of time qubits can maintain their quantum states. Willow has increased that time by 5x, from 20 microseconds to 100 microseconds. This allows more complex problems to be run.\nA third advantage of Willow is that Google’s logical qubits can now function below the critical quantum error correction threshold. The QEC threshold arises from a theory developed in the 1990s, and until now it has been a barrier to efficient quantum computing. In the Willow chip, however, error rates are reduced by one-half as physical qubits are added in scale. Thanks to this, as Google increases the size of its surface code from 3x3 to 5x5 to 7x7 the encoded logical qubits maintain their coherence for longer times. Increasing grid size allows for more complex error patterns to be corrected, similar to more redundancy in classical error correction. It also means that logical qubits can maintain their quantum states longer than the underlying physical qubits.\nThis leads me to the single most important part of Google’s Willow announcement: Willow is the first quantum processor to demonstrate an exponential reduction in error rates as the number of qubits is increased. Traditionally, adding qubits causes the error rate to increase.\nOther factors necessary for fault-tolerant quantum computing have also been demonstrated by Google researchers. For one thing, having a repeatable performance over several hours without degradation is needed to run large-scale fault-tolerant algorithms — and Willow has now demonstrated that capability.\nGoogle uses random circuit sampling as an ongoing benchmark to compare new experimental quantum processors against supercomputers running classical algorithms. It is important to point out that random circuit sampling is not useful as an application in itself; it is only a threshold test. But if a system fails to pass RCS, there is no need for further testing.\nFive years ago, the Google quantum research group claimed that the 53 superconducting qubits of its 54-qubit Sycamore chip (one qubit was faulty) had achieved quantum supremacy — meaning that it outperformed comparable classical computing. Back then, Google researchers said they were able to complete a RCS benchmark computation in 200 seconds that theoretically would take a classical supercomputer 10,000 years to complete. IBM disputed the claim using calculations indicating it was possible for a classical computer to achieve the same results. However, it was eventually accepted by the quantum community that if Google had used all 54 qubits, it would have taken a classical supercomputer much longer than 10,000 years to equal Sycamore’s achievement.\nThis year, in another quantum supremacy test, Google pitted the new 105-qubit Willow chip against the same RCS benchmark experiment that the Sycamore chip ran in 2019. Willow ran the RCS benchmark in under five minutes; it has been determined that today’s best classical supercomputer would need 10 septillion years to run the same benchmark (that’s a 1 followed by 25 zeros). In short, because Willow performs below the error correction threshold, it is able to conduct random circuit sampling far beyond what is possible with classical computers.\nIf you’re not familiar with quantum computing, these comparisons may seem confusing at first. But they are directly attributable to the number of qubits involved. The Willow chip has 105 qubits compared to Sycamore's 53. Each additional qubit results in an exponential increase in computing power, not a linear increase. The difference in the execution time between the tests in 2019 and the ones conducted in recent months today becomes understandable in this context. Because Willow has 52 more qubits than Sycamore, it has 2^52 (4.5 quadrillion) more computational states.\nBesides the increase in qubits, many other improvements have been made to quantum systems since 2019. Algorithms are a billion times better because of extensive experimentation by the large community of computer scientists in the ecosystem. Plus, quantum processors have improved significantly in various ways, including in the quality of qubits.\nGoogle's roadmap to fault-tolerant quantum computing\nFollowing its 2019 benchmark results, Google published a road map with a 10-year timeline for developing a large error-corrected quantum computer with 1,000 logical qubits using 1,000,000 physical qubits. As shown in the diagram above, the roadmap has six milestones; after its latest achievement with Willow, Google is now approaching the third milestone.\nFor another perspective on the Willow chip, I recently discussed Google’s achievement with Prof. John Martinis, who led the Google team that designed and tested the Sycamore chip. Prof. Martinis is currently working on a quantum startup called Qoloab with his cofounders Alan Ho (another Google veteran) and Prof. Robert McDermott.\nDuring that conversation, I recalled remarks that Prof. Martinis made about a yet-to-be-developed quantum computer chip for a Forbes article I published nearly five years ago. “Google’s plan is roughly to build a million-qubit system in about 10 years, with sufficiently low errors to do error correction,” he said. “Then at that point you will have enough error-corrected logical qubits that you can run useful, powerful algorithms that you now can’t solve on a classical supercomputer. And maybe even at a few hundred qubits, with lower errors, it may be possible to do something special-purpose.”\nThose remarks are very close to describing how Google’s Willow chip has actually played out.\nGoogle currently believes that it will be able to produce useful commercial quantum applications in the next five years or less. Many quantum scientists believe it will take at least another decade before quantum computers are able to handle world-affecting computations in areas such as climate change, drug discovery, materials science and financial modeling.\nOf course, Google is not the only company on this path. There is a great deal of experimentation and collaboration being done with logical qubits. One notable example is Microsoft, which has done exciting work with both Quantinuum’s H-2 trapped-ion processor and Atom Computing’s neutral-atom processor.\nGoogle acknowledges there are many challenges remaining. While the maximum code distance used in the Willow research was 7, to obtain the necessary error rate for fault tolerance would require a distance-27 logical qubit, which would need almost 1,500 physical qubits to create it. For quantum error correction, a higher distance means that an error code can handle more errors before it fails. A larger distance means the code has more layers of checks and balances that can detect and repair errors before they cause problems.\nThat is just one of the many challenges that must be overcome to achieve fault tolerance. While some might believe Google’s timeline is overly optimistic, I believe the company is on track. In another five years, fault tolerance will be a lot closer. And useful commercial quantum applications in some form or another should be quite doable.\nMoor Insights & Strategy provides or has provided paid services to technology companies, like all tech industry research and analyst firms. These services include research, analysis, advising, consulting, benchmarking, acquisition matchmaking and video and speaking sponsorships. Of the companies mentioned in this article, Moor Insights & Strategy currently has (or has had) a paid business relationship with Atom Computing, Google, IBM, Microsoft, Nvidia and Quantinuum.\n\nOne Community. Many Voices. Create a free account to share your thoughts. \nOur community is about connecting people through open and thoughtful conversations. We want our readers to share their views and exchange ideas and facts in a safe space.\nIn order to do so, please follow the posting rules in our site's Terms of Service.  We've summarized some of those key rules below. Simply put, keep it civil.\nYour post will be rejected if we notice that it seems to contain:\nUser accounts will be blocked if we notice or believe that users are engaged in:\nSo, how can you be a power user?\nThanks for reading our community guidelines.  Please read the full list of posting rules found in our site's Terms of Service."
        }
      }
    ]
  },
  {
    "category": "entertainment",
    "keyword": "Hasan",
    "articles": [
      {
        "title": "Hasan Ali set to rejoin Warwickshire | The Express Tribune",
        "link": "https://tribune.com.pk/story/2524738/hasan-ali-set-to-rejoin-warwickshire",
        "snippet": "He is available from May’s T20 Blast",
        "source_url": "The Express Tribune",
        "article_content": {
          "title": "Hasan Ali set to rejoin Warwickshire",
          "content": "IN\nHe is available from May's T20 Blast\nPakistan pacer Hasan Ali is committed to rejoining Warwickshire for the 2025 season, where he will feature in all formats.\nHis availability is expected from the start of the T20 Blast in May through to the end of September. After undergoing surgery and completing a rehabilitation program jointly managed by Warwickshire and Pakistan's medical teams, Hasan has fully recovered and resumed bowling at full intensity.\n\"I said last year that Edgbaston felt like a second home to me but it's becoming more like a first home now,\" Hasan said. \"I love playing for Warwickshire, playing for the Bears fans. And I hope they see, by the way I play, how much I want to win for this club.\n\n\"Being awarded my White Bear Cap in 2023 was among the proudest moments of my career, and I want to create many more special memories with the Bears next season.\n\"Last year was unlucky with the injury. I felt I was bowling well and taking plenty of wickets in the Blast. But now I'm back bowling at 100 percent in training and focused on joining up with Warwickshire next season.\"\nThe right-arm pacer has been an impressive performer for Warwickshire, taking 27 wickets in nine County Championship appearances across the 2023 and 2024 seasons, alongside 19 wickets in the T20 Blast.\nHowever, his availability in 2024 was disrupted by a late recall to Pakistan's squad for the T20 World Cup, limiting his time with the county.\nWarwickshire head coach Mark Robinson expressed optimism about his return, confirming that discussions with the Pakistan Cricket Board (PCB) had ensured an uninterrupted stint for the pacer in 2025.\n\"His call-up last May came out of the blue and took Hasan away from our County Championship start. We've had reassurances this year from the PCB that Hasan will be able to focus on the Bears, which is great news.\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ\nUpdated 2 hours ago\nNetflix confirms 'The Sandman' will conclude with its second season, a decision taken Neil Gaiman's recent scandals.\nUpdated 3 hours ago\nKarla Sofía Gascón deactivated her X account after an old tweet resurfaced of her calling Selena Gomez a “rich rat.”\nUpdated 4 hours ago\nThe Audience Award-winning queer comedy was allegedly pulled from the Sundance Online site due to leaks.\nUpdated 7 hours ago\nViral videos show flight attendant Ian Epstein entertaining passengers before his death in the D.C. plane crash.\nPCB declares Gaddafi Stadium’s upgrade as World record for completion time\nNathan Lyon surpasses Warne's record as Australia near victory against Sri Lanka\nAram Bagh, BCP Pechs win basketball titles\nNeymar returns to Brazil's Santos\nManchester City face Real Madrid in UCL play-offs\nNZ make one addition to ODI squad\nTrans pilot Jo Ellis rumored to be Black Hawk pilot in fatal collision over Potomac River\nGovt revises profit rates on National Savings schemes, pensioners' certificates\nRs1500 and Rs100 prize bond draw dates for February 2025 announced\nPetrol, diesel prices expected to go up again\nNetflix announces ‘Squid Game’ final season release date\nGold double jumps to all-time high\nPakistan's carbon trading policy guidelines\nDeeply sought\nThe erosion of university autonomy\nThe microplastics menace\nTech politics and Trump 2.0\nAcrimony over the right to Indus water\n Plot no.5 Express News Building Near KPT FLY over  Karachi Pakistan \nThis material may not be published, broadcast, rewritten, redistributed or derived from. Unless otherwise stated, all content is copyrighted © 2025 The Express Tribune."
        }
      },
      {
        "title": "Hasan Ali set to rejoin Warwickshire for 2025 season",
        "link": "https://www.geosuper.tv/latest/41714-hasan-ali-set-to-rejoin-warwickshire-for-2025-season",
        "snippet": "Hasan available from May’s T20 Blast start to September’s end",
        "source_url": "Geo Super",
        "article_content": {
          "title": "Hasan Ali set to rejoin Warwickshire for 2025 season",
          "content": "Pakistan pacer Hasan Ali is committed to rejoining Warwickshire for the 2025 season, where he will feature in all formats.\nHis availability is expected from the start of the T20 Blast in May through to the end of September.\nAfter undergoing surgery and completing a rehabilitation program jointly managed by Warwickshire and Pakistan’s medical teams, Hasan has fully recovered and resumed bowling at full intensity.\n\"I said last year that Edgbaston felt like a second home to me… but it’s becoming more like a first home now,\" Hasan said. \"I love playing for Warwickshire, playing for the Bears fans. And I hope they see, by the way I play, how much I want to win for this club.\n\"Being awarded my White Bear Cap in 2023 was among the proudest moments of my career, and I want to create many more special memories with the Bears next season.\n\"Last year was unlucky with the injury. I felt I was bowling well and taking plenty of wickets in the Blast. But now I’m back bowling at 100 percent in training and focused on joining up with Warwickshire next season.\"\nThe right-arm pacer has been an impressive performer for Warwickshire, taking 27 wickets in nine County Championship appearances across the 2023 and 2024 seasons, alongside 19 wickets in the T20 Blast.\nHowever, his availability in 2024 was disrupted by a late recall to Pakistan’s squad for the T20 World Cup, limiting his time with the county.\nWarwickshire head coach Mark Robinson expressed optimism about his return, confirming that discussions with the Pakistan Cricket Board (PCB) had ensured an uninterrupted stint for the pacer in 2025.\n\"His call-up last May came out of the blue and took Hasan away from our County Championship start. We’ve had reassurances this year from the PCB that Hasan will be able to focus on the Bears, which is great news.\n\"Of course, the contract comes with the caveat that Hasan continues to make good progress in his post-op rehab and arrives fully fit.\n\"Hasan is a heart-on-the-sleeve performer who always gives his all to the cause. He’s a proven wicket-taker at the highest level and was flying with us last season before the injury. He brings real energy to the place — in the dressing room and on the pitch — and inspires everyone around him with his enthusiasm. I’m looking forward to welcoming him back into the Bears’ fold.\"\nCopyright © 2025. GEO SUPER, All Rights Reserved"
        }
      }
    ]
  },
  {
    "category": "entertainment",
    "keyword": "K-pop",
    "articles": [
      {
        "title": "Meta Platforms, Inc. SEC 10-K Report",
        "link": "https://www.tradingview.com/news/tradingview:28914a6edaef3:0-meta-platforms-inc-sec-10-k-report/",
        "snippet": "Meta Platforms, Inc., a leading technology company known for its social media platforms and innovative hardware products, has released its 2024 Form 10-K report. The report highlights the company’s robust financial performance, significant business achievements, strategic initiatives, and the chall…",
        "source_url": "TradingView",
        "article_content": {
          "title": "Meta Platforms, Inc. SEC 10-K Report",
          "content": "Meta Platforms, Inc., a leading technology company known for its social media platforms and innovative hardware products, has released its 2024 Form 10-K report. The report highlights the company's robust financial performance, significant business achievements, strategic initiatives, and the challenges it faces in a dynamic regulatory and competitive environment.\nFinancial Highlights\nMeta Platforms, Inc. reported strong financial results for 2024, driven by increased advertising revenue and effective cost management:\nBusiness Highlights\nMeta Platforms, Inc. achieved notable business milestones in 2024, reflecting its diverse revenue streams and global reach:\nStrategic Initiatives\nMeta Platforms, Inc. is pursuing several strategic initiatives to drive long-term growth and enhance shareholder value:\nChallenges and Risks\nMeta Platforms, Inc. faces several challenges and risks that could impact its business operations and financial performance:\nSEC Filing: Meta Platforms, Inc. [ META ] - 10-K - Jan. 29, 2025\nTraders and investors use our platform.\nTop website in the world when it comes to all things investing.\nMobile reviews with 4.9 average rating. No other fintech apps are more loved.\nCustom scripts and ideas shared by our users.\n@ketory_fx\n@tradewithaks\n@ejacobsfx\n@Ceyhun Özgür GÖNÜL\n@stocktcm\n@tradingsignalio\n@richardwilliam251\n@anna_mcmorrin_\n@tradingfrance\nHasnat Ali 🇵🇰❤️@iamhasnatali\n@kubetson\n@youngtraderwealth\n@TradingView\n@setupstrading\n@fx.today\n@kornevs\n@half_bake_chef\n@jeavons_louise1\nWhatever the trade"
        }
      },
      {
        "title": "February Korean Netflix schedule: Song Joong Ki’s Bogotá to Melo Movie; 5 exciting K-drama and K-movie releases",
        "link": "https://www.pinkvilla.com/entertainment/february-korean-netflix-schedule-song-joong-kis-bogota-to-melo-movie-5-exciting-k-drama-and-k-movie-releases-1370301",
        "snippet": "Bogotá, Melo Movie, Single’s Inferno season 4, many more exciting K-dramas, and other series are set to release this February. Take a look.",
        "source_url": "pinkvilla",
        "article_content": {
          "title": "February Korean Netflix schedule: Song Joong Ki's Bogotá to Melo Movie; 5 exciting K-drama and K-movie releases",
          "content": "Naga Chaitanya says wife Sobhita Dhulipala is his 'go-to person' for professional decisions; 'When I'm in stress...'\nScream 7: Cast, Storyline, Release Date, and Everything You Need To Know About Courteney Cox's Slasher Horror\nBox Office: Does Kangana Ranaut stand to LOSE MONEY on Emergency? We analyze\nJennifer Garner and Ben Affleck’s ‘Growing’ Closeness Might Be Affecting Her Current BF John Miler: 'Feels Like...'\nZoe Saldaña Speaks Out on Emilia Perez Co-Star Karla Sofía Gascón's Racist Tweets: 'Don’t Have Any Tolerance'\nPrateik Babbar to tie the knot with Priya Banerjee on THIS special day of love? Here’s what we know\nDabba Cartel OTT Release Date: When and where to watch Shabana Azmi, Jyothika’s upcoming thriller-drama\nThandel First Review: Aamir Khan reveals the one special reason why the Naga Chaitanya, Sai Pallavi starrer would be a ‘superhit’\nHarlem Stars Meagan Good and Jerrie Johnson Get Candid About Harlem Coming to an End: 'The Bitter Part is...'\nBTS’ RM sends Lunar New Year wishes with warm letter; announces promotion to sergeant: ‘I’ll be out of here’\nLee Se Young and Na In Woo’s Motel California achieves peak popularity with 6.0 percent ratings for episode 7\nBLACKPINK’s Jisoo drops smashing purple cover poster for upcoming solo album AMORTAGE, fans react: ‘She ate’\nBLACKPINK's Jisoo's wish fulfilled by Dex sparks hilarious fan reactions: 'He kept his promise'\nBLACKPINK’s Jisoo, Lisa, IVE, ZEROBASEONE and more: 13 anticipated K-pop comebacks in February 2025\n‘Anyone who has dated…’: BLACKPINK Jennie reveals relating to Love Hangover lyrics; shoots multiple MVs for Ruby\nFebruary Korean Netflix schedule: Song Joong Ki's Bogotá to Melo Movie; 5 exciting K-drama and K-movie releases\nNewJeans' parents join social media to share stance on HYBE dispute, blast label in statement: 'We urgently need…'\nOk Taecyeon gets stunned by Seohyun's unexpected kiss in The First Night With the Duke first look; Watch\nAlia Bhatt brings cool vibe to airport fashion as she slays in sweatshirt and black track pants with Rs 2,15,876 bag\nRashmika Mandanna adds vibrant twist to ethnic style with colorblocked suit for Chhaava promotions\nMom-to-be Amy Jackson serves hot mama vibes in her 5 fashionable Gucci dress and Prada jacket looks\nKeerthy Suresh's multicolored floral lehenga exudes festive charm, showcasing maximalist style at its finest\nKajol and Madhuri Dixit blend power dressing with elegance, clearly saying ‘we are here to slay’\nYami Gautam serves bossy look in wine-color pantsuit worth Rs 28,800; a classy office-wear addition\nTamannaah Bhatia’s black chiffon Dolce & Gabbana dress worth Rs 5,19,573 is designed to steal spotlight at any party\nMaharani Radhika Raje Gaekwad embraces royal family’s treasured collection in 100-year-old Paithani Nauvari Saree at 25th Anniversary of Sabyasachi\nAditi Rao Hydari vs Malaika Arora Fashion Face-Off: Who styled the denim jumpsuit better?\nUnveiling the Costliest Watches Owned by Salman Khan, Ranveer Singh, And More B-town Stars\nFitness Influencer, Carla Visentin’s Inspiring 40kg Weight Loss Journey: Diet And Workout Strategies Revealed!\nThe Rise And Fall of Diddy’s Billion-Dollar Empire: Where His Fortune Stands Now\nSelena Gomez’s 4.9 Million Dollar LA Mansion is Pure Luxury – Take a Look!\nVirat Kohli's Rs 1050 Crore Empire: A Look at His Lavish Lifestyle And Career Milestones\nStep Inside Shark Tank India’s Anupam Mittal’s Rs. 15 Crore Mumbai Home with Jaw-dropping Views!\nChris Martin’s Rs 1,382 Crore Net Worth: A Look at His Extravagant Lifestyle And Career Milestones\nInside Diljit Dosanjh’s Rs.172 Crore Fortune: Lavish Homes, Luxury Cars, And a Private Jet!\nCancer to Scorpio: Top 4 Zodiac Signs Who Allow Their Emotions to Affect Their Careers\nBogotá, Melo Movie, Single’s Inferno season 4, many more exciting K-dramas, and other series are set to release this February. Take a look.\nFrom Song Joong Ki’s Bogotá: City Of The Lost to Choi Woo Shik and Park Bo Young’s Melo Movie and many more interesting Korean series, movies, and reality shows will be premiering on Netflix in February of this year. Korean entertainment fans can look forward to the release of shows of varied genre content soon. Know about them and their premiere dates.\nA cunning con artist finds himself unexpectedly stranded in a mysterious village inhabited by spirits. With the aid of his companions, he sets out to unravel the dark secrets surrounding the unexplained disappearances of the ghostly villagers.\n\n\nIt follows the story of a young Korean man who moves to Bogotá after losing everything during the IMF crisis, hoping to start anew. While he achieves success through the Colombian black market, risking everything for a shot at survival and success.\n\n\nIt is a dating show of young adults from varied backgrounds. They perform various tasks and pick their ideal one to escape the island with and go to a luxurious hotel called Paradise.\n\n\nA forensic doctor joins forces with a rookie prosecutor to crack a series of murder cases. Despite their initial dislike towards each other, they put aside their differences and form a formidable partnership.\n\n\nWhen a budding filmmaker and a discerning critic cross paths, romance blossoms. As they navigate life's challenges together, they discover a deep connection, weaving a poignant narrative of unlikely companionship and love.\n\n\nMelo Movie teaser, poster: Choi Woo Shik and Park Bo Young preview exciting second chance at love story; Watch\n\nPeuli is a Korean entertainment writer at Pinkvilla, specializing in coverage of top Korean news of the day, including \nPeuli is a Korean entertainment writer at Pinkvilla, specializing in coverage of top Korean news of the day, including K-pop updates or K-drama releases. After pursuing English honours at Calcutta University, she switched to Journalism (PG) from the Asian College of Journalism. She has over a year of experience working in a newsroom and a hobby of simplifying ornate information available online. She is also a part-time K-pop, K-drama and cricket enthusiast.\n\nBy providing this information, you agree that we may process your personal data in accordance with our Privacy Statement"
        }
      }
    ]
  }
]